{"columns":["t.uri","t.name","t.definition"],"data":[["http://dicom.nema.org/resources/ontology/DCM/112132","very small","A qualitative descriptor of a size that is considerably less than typical."],["http://eol.org/schema/HeadWidth","head width",""],["http://eol.org/schema/terms/AETinRange","actual evapotranspiration rate in geographic range","Monthly AET (Actual Evapotranspiration Rate) within the geographic range of a taxon.  Evapotranspiration (ET) is the sum of evaporation and plant transpiration from the Earth's land surface to atmosphere."],["http://eol.org/schema/terms/Absent","not present in region","This organism is known to be absent in this location or region"],["http://eol.org/schema/terms/ActiveGrowthPeriod","active growth period","The growing season of a plant.  The time of year when a plant has its most active growth."],["http://eol.org/schema/terms/AdultYearlySurvival","Adult Yearly Survival",""],["http://eol.org/schema/terms/AfterHarvestRegrowthRate","after harvest regrowth rate","Indicates the relative rate of regrowth of a herbaceous plant after a harvest of above ground herbage. "],["http://eol.org/schema/terms/AgeAtEyeOpening","age at eye opening","Age at which both eyes are fully open after birth."],["http://eol.org/schema/terms/AgeAtMaturity","age at maturity","Age at the first successful reproduction."],["http://eol.org/schema/terms/AminoAcidCompositionOfMilk","amino acid composition of milk",""],["http://eol.org/schema/terms/AnaerobicSoilTolerance","anaerobic soil tolerance","The relative tolerance of the plant to anaerobic soil conditions."],["http://eol.org/schema/terms/ArmPlusDiscLength","arm plus disc length",""],["http://eol.org/schema/terms/Ash_content","ash content",""],["http://eol.org/schema/terms/Attached","substrate-attached","This organism is normally physically attached to the substrate upon which it lives"],["http://eol.org/schema/terms/BillLength","bill length","Length of the bill."],["http://eol.org/schema/terms/Bioluminescent","bioluminescent","Has this organism been observed to produce and transmit light?"],["http://eol.org/schema/terms/BloatPotential","livestock bloat potential","The relative potential of an herbaceous plant to cause bloat in livestock. "],["http://eol.org/schema/terms/BloomColor","bloom color","The color of the water or other matrix in which an organism has reached an unusually high number"],["http://eol.org/schema/terms/BloomPeriod","bloom period","The seasonal period in the U.S. during which the plant blooms the most. The bloom period is defined as the time when pollen is shed and stigmas are receptive."],["http://eol.org/schema/terms/BodyShape","body Shape",""],["http://eol.org/schema/terms/BodyVolume","body volume","Volume occupied by the whole body of one individual of this taxon"],["http://eol.org/schema/terms/BreedingHabitat","breeding habitat","Primary habitat where the species breeds."],["http://eol.org/schema/terms/BrowseAnimalPalatability","browse animal palatability","The relative palatability of the plant to browsing animals."],["http://eol.org/schema/terms/BudSource","bud source","Location of bud bank for resprouting. "],["http://eol.org/schema/terms/CITES_I","CITES Appendix I","Appendix I lists species that are the most endangered among CITES-listed animals and plants. They are threatened with extinction and CITES prohibits international trade in specimens of these species except when the purpose of the import is not commercial, for instance for scientific research. In these exceptional cases, trade may take place provided it is authorized by the granting of both an import permit and an export permit (or re-export certificate). Article VII of the Convention provides for a number of exemptions to this general prohibition."],["http://eol.org/schema/terms/CITES_II","CITES Appendix II","Appendix II lists species that are not necessarily now threatened with extinction but that may become so unless trade is closely controlled. It also includes so-called \"look-alike species\", i.e. species whose specimens in trade look like those of species listed for conservation reasons. International trade in specimens of Appendix-II species may be authorized by the granting of an export permit or re-export certificate. No import permit is necessary for these species under CITES (although a permit is needed in some countries that have taken stricter measures than CITES requires). Permits or certificates should only be granted if the relevant authorities are satisfied that certain conditions are met, above all that trade will not be detrimental to the survival of the species in the wild. (See Article IV of the Convention)"],["http://eol.org/schema/terms/CITES_III","CITES Appendix III","Appendix III is a list of species included at the request of a Party that already regulates trade in the species and that needs the cooperation of other countries to prevent unsustainable or illegal exploitation. International trade in specimens of species listed in this Appendix is allowed only on presentation of the appropriate permits or certificates. (See Article V of the Convention)"],["http://eol.org/schema/terms/CNRatio","carbon-to-nitrogen ratio","The percentage of organic carbon divided by the percentage of total nitrogen in organic material. "],["http://eol.org/schema/terms/CalcareousSoilTolerance","calcareous soil tolerance","The relative tolerance of the plant to calcareous soil. Calcareous soil is defined as soil containing sufficient free CaCO3 and other carbonates to effervesce visibly or audibly when treated with cold 0.1M HCl. These soils usually contain from 10 to almost 1000g/kg CaCO3 equivalent."],["http://eol.org/schema/terms/CapitulumLength","Capitulum Length",""],["http://eol.org/schema/terms/CarapaceLength","Carapace length",""],["http://eol.org/schema/terms/CarbohydrateCompositionOfMilk","carbohydrate composition of milk",""],["http://eol.org/schema/terms/CaudalFinShape","caudal fin shape","Any measurable or observable characteristic related to the shape of a caudal fin. "],["http://eol.org/schema/terms/CellDepth","cell depth","A 1D measurement of a single cell. Typically, this is the distance along a straight line connecting the dorsal-most part of the cell to the ventral-most part of the cell. It is perpendicular to the length axis and the width axis."],["http://eol.org/schema/terms/CellLength","cell length","A 1D measurement of a single cell along its longest axis. Typically, this is the distance along a straight line connecting the anterior-most point and the posterior-most point."],["http://eol.org/schema/terms/CellMaxAreaPerMaxVolume","cell maxArea/maxVolume","ratio of Maximum Cell Surface Area to Maximum Cell Volume.  "],["http://eol.org/schema/terms/CellMinAreaPerMinVolume","cell minArea/minVolume","ratio of Minimum Cell Surface Area to Minimum Cell Volume.  "],["http://eol.org/schema/terms/CellShape3D","cell shape three dimensional","Three dimensional cell shape"],["http://eol.org/schema/terms/CellShapeFrontal","cell shape frontal plane","Two dimensional shape of a cross section of the cell dividing it into dorsal and ventral portions (frontal plane)."],["http://eol.org/schema/terms/CellShapeMedian","cell shape median plane","Two dimensional shape of a cross section of the cell dividing it into left and right portions (median plane).\r\n"],["http://eol.org/schema/terms/CellShapeTransverse","cell shape transverse plane","Two dimensional shape of a cross section of the cell dividing it into anterior and posterior portions (transverse plane).\r\n"],["http://eol.org/schema/terms/CellSurfaceArea","cell surface area","Surface area of a cell."],["http://eol.org/schema/terms/CellWidth","cell width","A 1D measurement of a single cell. Typically, this is the distance along a straight line connecting the left-most part of the cell to the right-most part of the cell. It is perpendicular to the length axis and the depth axis."],["http://eol.org/schema/terms/ChelaWidth","Chela width","a pincer-like organ terminating certain limbs of some arthropods"],["http://eol.org/schema/terms/ChlorophyllAConcentration","chlorophyll A concentration","concentration of chlorophyll A in seawater at a location where this organism has been observed or collected."],["http://eol.org/schema/terms/ChloroplastLocation","chloroplast location","Place within a cell where the chloroplasts can be found. "],["http://eol.org/schema/terms/ChloroplastNumber","chloroplast number","Quantity of chloroplasts"],["http://eol.org/schema/terms/ChloroplastQuantity","chloroplast quantity","A qualitative measure of individual chloroplasts present in a cell"],["http://eol.org/schema/terms/CingulumLocation","cingulum location","One of three places on a dinoflagellate where a cingulum can be positioned relative to the midpoint of the cell."],["http://eol.org/schema/terms/CingulumType","cingulum type","A morphological configuration of the cingulum"],["http://eol.org/schema/terms/CingulumWidth","cingulum width","A 1D measurement along the shortest axis of a cingulum"],["http://eol.org/schema/terms/ClimateChangeVulnerabilityScore","Climate Change Vulnerability Score","The \"climate change vulnerability score\" (CCVS) is an aggregation of six autecological traits that are known to be associated with vulnerability to CC: endemism, micro-endemism, temperature preference, altitudinal preference, stream zonation preference, and life history."],["http://eol.org/schema/terms/Colonial","Colonial",""],["http://eol.org/schema/terms/CommercialAvailability","commercial availability","The availability of plant propagules in the commercial marketplace."],["http://eol.org/schema/terms/Cosmopolitan","Cosmopolitan",""],["http://eol.org/schema/terms/DescribedAcceptedSpecies","known marine species","number of currently described and taxonomically accepted marine species in this clade (Appeltans et al. 2012. The Magnitude of Global Marine Species Diversity. Current Biology 22, 2189–2202. http://dx.doi.org/10.1016/j.cub.2012.09.036)"],["http://eol.org/schema/terms/DevelopmentalMode","developmental mode","Broad recognized categories describing development, the process by which organisms grow and mature"],["http://eol.org/schema/terms/DiapauseInitiation","diapause","Life stage(s) at which diapause can occur. (http://en.wikipedia.org/wiki/Diapause#Initiation)"],["http://eol.org/schema/terms/DiatomSymmetryType","diatom symmetry type","a traditional division of the Bacillariophyceae or diatoms into two groups based upon symmetry (http://en.wikipedia.org/wiki/Diatom#Classification)"],["http://eol.org/schema/terms/Diet","diet includes","Information about the items eaten by this organism."],["http://eol.org/schema/terms/DietBreadth","diet breadth","Number of dietary categories eaten by an organism."],["http://eol.org/schema/terms/DiscDiameter","Disc diameter",""],["http://eol.org/schema/terms/DispersalAge","dispersal age","Age at which young permanently leave the parent, parental group, social group or any associated territories."],["http://eol.org/schema/terms/DissolvedNitrate","water nitrate concentration","Dissolved nitrate concentration in seawater at a location where this organism has been observed or collected."],["http://eol.org/schema/terms/DissolvedOxygen","water dissolved O2 concentration","Dissolved oxygen concentration in seawater at a location where this organism has been observed or collected."],["http://eol.org/schema/terms/DissolvedPhosphate","water phosphate concentration","Dissolved phosphate concentration in seawater at a location where this organism has been observed or collected."],["http://eol.org/schema/terms/DissolvedSilicate","water silicate concentration","Dissolved silicate concentration in seawater at a location where this organism has been observed or collected."],["http://eol.org/schema/terms/EcomorphologicalGuild","ecomorphological guild","organisms that share certain morphological traits due to adaptation to similar environments and ecological roles"],["http://eol.org/schema/terms/EggDiameter","egg diameter","Diameter of the egg life stage of this organism. An egg is an organic vessel in which an embryo first begins to develop. In most birds, reptiles, insects, molluscs, fish, and monotremes, it is the zygote, resulting from fertilization of the ovum, which is expelled from the body and permitted to develop outside the body until the developing embryo can survive on its own."],["http://eol.org/schema/terms/EggLayingBegins","egg laying begins","The date for the laying of the first egg of a clutch."],["http://eol.org/schema/terms/EggMass","egg mass","The amount of matter in the egg stage of an organism, after laying or spawning."],["http://eol.org/schema/terms/EpiconeShape","epicone shape","An approximation of the 3D shape of the epicone described using one or more geometric solids."],["http://eol.org/schema/terms/ExtinctionStatus","extinction status","Indicates whether a taxon is extant (living today) or extinct."],["http://eol.org/schema/terms/FattyAcidCompositionOfMilk","fatty acid composition of milk",""],["http://eol.org/schema/terms/FemalesPerGroup","Females per Group",""],["http://eol.org/schema/terms/FireResistance","fire resistance","The ability of an organism to resist burning."],["http://eol.org/schema/terms/FireTolerance","fire tolerance","The relative ability of a plant to resprout, regrow, or reestablish from residual seed after a fire. "],["http://eol.org/schema/terms/FoliagePorositySummer","foliage porosity summer","Indicates the porosity (coverage) of the foliage during the summer months.  Foliage porosity is an important factor when trees or shrubs are used as windbreaks for the protection of crops and livestock shelters. Denser (or less porous) foliage allows more wind to pass through."],["http://eol.org/schema/terms/FoliagePorosityWinter","foliage porosity winter","Indicates the porosity (coverage) of the foliage during the winter months.  Foliage porosity is an important factor when trees or shrubs are used as windbreaks for the protection of crops and livestock shelters. Denser (or less porous) foliage allows more wind to pass through."],["http://eol.org/schema/terms/FoliageTexture","foliage texture","The general texture of the plant’s foliage relative to other species with the same growth habit, e.g., fine/smooth, medium, coarse/rough."],["http://eol.org/schema/terms/ForagingHabitat","foraging habitat","Primary habitat where the species forages during the breeding season.  "],["http://eol.org/schema/terms/ForagingTime","foraging time","Time of day when adults forage during\r\nthe breeding season."],["http://eol.org/schema/terms/FossilFirst","first appearance","The first appearance of this taxon in the fossil record."],["http://eol.org/schema/terms/FossilLast","last appearance","The last appearance of this taxon in the fossil record."],["http://eol.org/schema/terms/FrostFreeDays","frost free days","The average number of frost-free days within the plant’s known geographical range. For cultivars, the geographical range is defined as the area to which the cultivar is well adapted rather than marginally adapted."],["http://eol.org/schema/terms/FruitPersistence","fruit/seed persistence","Are the fruit or seed generally recognized as being persistent on the plant?\r\n"],["http://eol.org/schema/terms/FruitSeedColor","fruit or seed color","The predominant and conspicuous color of the mature fruit or seed from a landscaping aesthetics standpoint."],["http://eol.org/schema/terms/FuelwoodSuitability","fuelwood suitability","The relative suitability or potential of a tree or shrub to produce fuelwood. If suitability is unknown, fuelwood potential is expressed in terms of weight (in lbs) per cubic foot of green wood. Relative values correspond to these numerical ranges: Low: \u003c28; Medium: 28-35; High: \u003e35. Plants other than trees and shrubs are left blank here."],["http://eol.org/schema/terms/GardenPersistent","garden persistent range","Lists jurisdictions where a plant persists around gardens and old habitations, is not naturalized."],["http://eol.org/schema/terms/GenerationTime","generation time","In population biology, the generation time is a quantity that reflects the average time between two consecutive generations. Reciprocal of Generation Frequency"],["http://eol.org/schema/terms/GeographicRangeArea","geographic range (size of area)","The total extent of the geographic range of an organism."],["http://eol.org/schema/terms/GerminationRequirements","germination requirements","The environmental requirements needed for the plant to germinate."],["http://eol.org/schema/terms/GrainType","grain type","The grain crop classification of a plant."],["http://eol.org/schema/terms/GrassGrowthType","grass growth type","The distance of the growing point (terminal meristem) of the vegetative grass tiller to the crown."],["http://eol.org/schema/terms/GrazeAnimalPalatability","graze animal palatability","The relative palatability of a plant to grazing animals."],["http://eol.org/schema/terms/HabitatBreadth","habitat breadth","Number of habitat layers used by an organism"],["http://eol.org/schema/terms/HasDispersalVector","has dispersal vector","a dispersal vector is \"an agent transporting seeds or other dispersal units\". Dispersal vectors may include biotic factors, such as animals, or abiotic factors, such as the wind or the ocean."],["http://eol.org/schema/terms/HasToxin","has toxin","A toxic substance has been chemically detected and identified in this organism"],["http://eol.org/schema/terms/HeadBodyLength","head-body length","Head-body length is the total length from tip of nose to anus, base of tail or vent (i.e. tail length is excluded).  "],["http://eol.org/schema/terms/HeadtoCoccyxLength","head to coccyx length","The distance from the head to the caudal vertebrae in the coccygeal region."],["http://eol.org/schema/terms/HedgeTolerance","hedge tolerance","The relative tolerance of woody perennials to hedging (close cropping) by livestock or wildlife. Herbaceous plants are scored \"None” here by default."],["http://eol.org/schema/terms/HeightStanding","height standing","The height when maintaining an erect upright position."],["http://eol.org/schema/terms/HindTarsusLength","hind tarsus length","The hind foot length, from heel to toe."],["http://eol.org/schema/terms/HomeRange","home range","Size of the area within which everyday activities of individuals or groups (of any type) are typically restricted."],["http://eol.org/schema/terms/HoneyBeePain","Honey Bee Pain Scale","Pain Scale based off the stings of honey bee with a rating from 1-10."],["http://eol.org/schema/terms/HumanLivestockToxicity","human/livestock toxicity","The relative toxicity of an organism to either humans or livestock."],["http://eol.org/schema/terms/HumanPopulationDensity","human population density","The human population density within the geographic range of a taxon."],["http://eol.org/schema/terms/HumanPopulationDensityChange","human population density change","Rate of increase in human population density within the geographic range of a species. "],["http://eol.org/schema/terms/HypoconeShape","hypocone shape","An approximation of the 3D shape of the hypocone described using one or more geometric solids."],["http://eol.org/schema/terms/InitialMortalityRate","initial mortality rate","The initial mortality rate (IMR) represents the mortality rate independently of the ageing process. Though there are different methods, the IMR is typically estimated from the mortality rate prior to its exponential increase with age, which can be obtained from the mortality curve (by looking at the baseline mortality prior to its exponential increase) or, for mice, by using t = 0.25 in the Gompertz equation."],["http://eol.org/schema/terms/InterBirthInterval","inter-birth interval","The length of time between successive births of a female."],["http://eol.org/schema/terms/IntroducedRange","introduced range includes","Lists jurisdictions in which a given organism has been introduced recently."],["http://eol.org/schema/terms/InvasiveRange","invasive in","Information about the jurisdictions where the taxon is considered to be an invasive organism due to its negative impact on human welfare or ecosystems."],["http://eol.org/schema/terms/KnownSpecies","known marine species","number of currently described and taxonomically accepted species in this clade (Appeltans et al. 2012. The Magnitude of Global Marine Species Diversity. Current Biology 22, 2189–2202. http://dx.doi.org/10.1016/j.cub.2012.09.036)"],["http://eol.org/schema/terms/LittersPerYear","litters per year","Number of litters per female per year"],["http://eol.org/schema/terms/Log10Productivity","log10 productivity","The rate of production of reproductive biomass expressed as a log base 10."],["http://eol.org/schema/terms/MaleFemaleBodyMassRatio","male female body mass ratio",""],["http://eol.org/schema/terms/MaleTenure","Male Tenure",""],["http://eol.org/schema/terms/MalesPerGroup","Males per Group",""],["http://eol.org/schema/terms/MantleLength","Mantle length",""],["http://eol.org/schema/terms/MarineLarvalDevelopmentStrategy","marine larval development strategy",""],["http://eol.org/schema/terms/MatingSystem","mating system",""],["http://eol.org/schema/terms/MiddleToeLength","middle toe length","length of the middle toe"],["http://eol.org/schema/terms/MidpointAltitude","midpoint altitude","Elevation above sea level of the midpoint of the vertical range of an organism."],["http://eol.org/schema/terms/MilkPhospholipids","milk phospholipids",""],["http://eol.org/schema/terms/MineralCompositionOfMilk","mineral composition of milk",""],["http://eol.org/schema/terms/MoistureUse","moisture use","Ability to use (i.e., remove) available soil moisture relative to other species in the same (or similar) soil moisture availability region."],["http://eol.org/schema/terms/MortalityRateDoublingTime","mortality rate doubling time","The mortality rate doubling time (MRDT) is considered to be a measure of the rate of ageing.  It is estimated from the slope of the Gompertz curve by: MRDT = 0.693/G  where G is the exponential (Gompertz) mortality rate coefficient. "],["http://eol.org/schema/terms/NativeRange","native range includes","Lists jurisdictions in which a given organism is a member of the undisturbed fauna or flora."],["http://eol.org/schema/terms/NestType","nest type","The most common nest type used by a species. "],["http://eol.org/schema/terms/NewSpeciesDescribed1999to2008","number of new species decribed 1999-2008","number of new species published between 1999 and 2008 (Appeltans et al. 2012. The Magnitude of Global Marine Species Diversity. Current Biology 22, 2189–2202. http://dx.doi.org/10.1016/j.cub.2012.09.036)"],["http://eol.org/schema/terms/NonInvasiveRange","not invasive in","Information about the jurisdictions where the taxon is present but not considered to be an invasive organism due to its negative impact on human welfare or ecosystems."],["http://eol.org/schema/terms/NucleusLocation","nucleus location","The location of the nucleus within a eukaryotic cell."],["http://eol.org/schema/terms/NumberDNARecordsInGGBN","number of DNA Records In GGBN","number of DNA records in this clade in the Global Genome Biodiversity Network (GGBN) repository of genome quality tissues.\r\n"],["http://eol.org/schema/terms/NumberOfHosts","number of hosts","number of host species required to complete the lifecycle of this organism"],["http://eol.org/schema/terms/NumberOfSequencesInGenBank","number of sequences in GenBank","number of sequences for taxa in this clade in GenBank"],["http://eol.org/schema/terms/NumberPublicRecordsInBOLD","number of public records in BOLD","number of records in this clade in the Barcode Of Life Database (BOLD)"],["http://eol.org/schema/terms/NumberRecordsInBOLD","number of records in BOLD","number of records for taxa in this clade in the Barcode of Life Database (BOLD)"],["http://eol.org/schema/terms/NumberRecordsInGBIF","number of records in GBIF","number of records for taxa in this clade in the Global Biodiversity Information Facility (GBIF) "],["http://eol.org/schema/terms/NumberReferencesInBHL","number of references in BHL","number of references to taxa in this clade in the Biodiversity Heritage Library"],["http://eol.org/schema/terms/NumberSpecimensInGGBN","number of specimens in GGBN","number of records in this clade in the Global Genome Biodiversity Network (GGBN) repository of genome quality tissues."],["http://eol.org/schema/terms/NutrientCompositionOfMilk","nutrient composition of milk",""],["http://eol.org/schema/terms/OceaniaRealm","the Oceanian realm (islands)","The Oceanian realm is one of the World Wildlife Fund-WWF biogeographic realms, and is unique in not including any continental land mass. It includes the islands of the Pacific Ocean in: Micronesia, the Fijian Islands, the Hawaiian islands, and Polynesia (with the exception of New Zealand)."],["http://eol.org/schema/terms/OptimalGrowthTemperature","optimal growth temperature","Optimal temperature conditions for cell division"],["http://eol.org/schema/terms/OuterEarLength","outer ear length","External ear (pinna) length is a standard measurement in mammalogy, usually measured in a living mammal or a fresh mammal carcass. External ear length is measured from the base of the notch at the bottom of the ear to the apex (highest point) of the ear."],["http://eol.org/schema/terms/OvaDiameter","egg diameter","Diameter of an egg."],["http://eol.org/schema/terms/OxygenSaturation","water O2 saturation","The percent oxygen saturation in seawater at a location where this organism has been observed or collected."],["http://eol.org/schema/terms/PETinRange","potential evapotranspiration rate in geographic range","Monthly PET (Potential Evapotranspiration Rate) within the geographic range of a taxon.   Evapotranspiration (ET) is the sum of evaporation and plant transpiration from the Earth's land surface to atmosphere.  Potential evapotranspiration (PET) is a representation of the environmental demand for evapotranspiration and represents the evapotranspiration rate of a short green crop, completely shading the ground, of uniform height and with adequate water status in the soil profile. It is a reflection of the energy available to evaporate water, and of the wind available to transport the water vapour from the ground up into the lower atmosphere."],["http://eol.org/schema/terms/PercentSpeciesCurrentlyDescribed","percent  of marine species currently described","percent of all marine species in this clade that are currently described (estimate) (Appeltans et al. 2012. The Magnitude of Global Marine Species Diversity. Current Biology 22, 2189–2202. http://dx.doi.org/10.1016/j.cub.2012.09.036)"],["http://eol.org/schema/terms/PercentSurveyedSpeciesNotYetKnownToScience","percent surveyed species not yet known to science","percent of undescribed species in this clade, found in this survey (Appeltans et al. 2012. The Magnitude of Global Marine Species Diversity. Current Biology 22, 2189–2202. http://dx.doi.org/10.1016/j.cub.2012.09.036)"],["http://eol.org/schema/terms/PercentSynonyms","percent synonyms among marine species","percent of all marine species names in this clade that are considered subjective synonyms (Appeltans et al. 2012. The Magnitude of Global Marine Species Diversity. Current Biology 22, 2189–2202. http://dx.doi.org/10.1016/j.cub.2012.09.036)"],["http://eol.org/schema/terms/PlantHabit","PlantHabit","general growth form, including size and branching. Some plants have different growth habits depending on environment or location"],["http://eol.org/schema/terms/PlantingDensity","planting density","Recommended minimum number of individual plants to plant per area."],["http://eol.org/schema/terms/PopulationGroupSize","population group size","Number of individuals in a group that spends the majority of their time in a 24 hour cycle together"],["http://eol.org/schema/terms/PostFireSeedlingEmergence","post-fire seedling emergence","Seedling density per pre-fire mature individuals emerging during the first year after fire (seedlings/mature)."],["http://eol.org/schema/terms/PostFireSeedlingSurvival","post-fire seedling survival","Proportion of seedlings surviving first dry season after fire."],["http://eol.org/schema/terms/PrecipitationInRange","precipitation in geographic range","Monthly precipitation within the geographic range of a taxon."],["http://eol.org/schema/terms/PrecipitationTolerance","precipitation tolerance","Minimum tolerable rainfall (in inches), expressed as the average annual minimum precipitation that occurs 20% of the time (i.e., the probability of it being this dry in any given year is 20%) at the driest climate station within the known geographical range of the plant. geographical range of the plant. For cultivars, the geographical range is defined as the area to which the cultivar is well adapted rather than marginally adapted."],["http://eol.org/schema/terms/PrenatalDevelopmentDuration","prenatal development duration","The duration of the development from fertilized,  deposited or implanted egg to hatching/birth.  Corresponds to egg incubation duration in oviparous animals and to gestation period duration in viviparous animals."],["http://eol.org/schema/terms/Present","geographic distribution includes","This organism is known to be present in this location or region"],["http://eol.org/schema/terms/PrimaryGrowthForm","primary growth form","The primary growth form on the landscape in relation to soil stabilization on slopes and streamsides. Each plant species is assigned the single growth form that most enhances its ability to stabilize soil."],["http://eol.org/schema/terms/PrimaryMacronutrientRequirements","primary macronutrient requirements","The relative level of nutrition (N, P, K) required by a plant for normal growth and development."],["http://eol.org/schema/terms/PropagationMethod","plant propagation method","Methods used to produce new plants from a parent plant."],["http://eol.org/schema/terms/Propagule","propagule","The dispersal unit for sexual regeneration."],["http://eol.org/schema/terms/ProsomeHeight","prosome height","Height (dorso-ventral distance) of the prosome of an arthropod. Prosome: anterior region of body, commonly limited behind by major articulation. Collective term for the combined cephalasome and metasome in copepods"],["http://eol.org/schema/terms/ProsomeLength","prosome length","Length of the prosome of an arthropod. Prosome: anterior region of body, commonly limited behind by major articulation. Collective term for the combined cephalasome and metasome in copepods"],["http://eol.org/schema/terms/ProsomeWidth","prosome width","Width of the prosome of an arthropod. Prosome: anterior region of body, commonly limited behind by major articulation. Collective term for the combined cephalasome and metasome in copepods"],["http://eol.org/schema/terms/ProteinCompositionOfMilk","protein composition of milk",""],["http://eol.org/schema/terms/ProteinPotential","protein potential","The relative protein content of the plant parts that are grazed or browsed by animals."],["http://eol.org/schema/terms/RNAtoDNAratio","RNA:DNA ratio","ratio of RNA to DNA biomass fractions in an organism"],["http://eol.org/schema/terms/RangeMidpointLatitude","range midpoint latitude","The angular distance, north or south of the earth's equator, of the midpoint of the known geographic range of an organism."],["http://eol.org/schema/terms/RecordInBOLD","records in BOLD?","this clade is represented by geo-referenced data in the Barcode of Life Database (BOLD)"],["http://eol.org/schema/terms/RecordInGBIF","records in GBIF?","this clade is represented by geo-referenced data in the Global Biodiversity Information Facility (GBIF)"],["http://eol.org/schema/terms/ReferenceInBHL","references in BHL?","this clade is represented in the literature in the Biodiversity Heritage Library (BHL)"],["http://eol.org/schema/terms/ReproductiveSkew","Reproductive Skew",""],["http://eol.org/schema/terms/RespClip","resprout ability after clipping","The ability of woody perennials to resprout following top (above ground biomass) removal."],["http://eol.org/schema/terms/RespDist","resprout ability after disturbance","Resprouting ability after an undefined disturbance that removed most of the aboveground biomass."],["http://eol.org/schema/terms/RespFire","resprout ability after fire","Resprouting ability one year after being ca. 100% scorched or burned by fire. "],["http://eol.org/schema/terms/ResproutAbility","resprout ability after clipping","The ability of woody perennials to resprout following top (above ground biomass) removal."],["http://eol.org/schema/terms/Salinity","water salinity","Dissolved salt concentration in seawater at a location where this organism has been observed or collected."],["http://eol.org/schema/terms/SeedAbundance","fruit/seed abundance","The amount of seed produced by the plant compared to other species with the same growth habit."],["http://eol.org/schema/terms/SeedBank","seed bank","Location of persistent seed bank (longevity \u003e 1 yr)."],["http://eol.org/schema/terms/SeedBankLong","SeedBankLong","automatically added during harvest"],["http://eol.org/schema/terms/SeedPerPound","seeds per pound","The number of seeds per pound in an average seed lot."],["http://eol.org/schema/terms/SeedPeriodBegin","seed period begin","Season in which the earliest fruit or seed of the fruit/seed period is visually obvious."],["http://eol.org/schema/terms/SeedPeriodEnd","seed period end","Season in which the latest fruit or seed of the fruit/seed period is visually obvious."],["http://eol.org/schema/terms/SeedSpreadRate","seed spread rate","The capability of the plant to spread through its seed production compared to other species with the same growth habit."],["http://eol.org/schema/terms/SeedlingSurvival","seedling survival","The expected seedling survival percentage of the plant compared to other species with the same growth habit."],["http://eol.org/schema/terms/SequenceInGenBank","sequences in GenBank?","this clade is represented by gene sequences in GenBank"],["http://eol.org/schema/terms/SexualSystem","sexual system","The organization of the system of organs involved with sexual reproduction, e.g., hermaphroditism, monoecy, dioecy/gonochory, gynodioecy, androdioecy, gynomonoecy, andromonoecy, polygamodioecy, polygamomonoecy, apomixis, etc."],["http://eol.org/schema/terms/ShadeTolerance","shade tolerance","The relative tolerance of the plant to shade conditions"],["http://eol.org/schema/terms/ShellHeightBivalve","shell height, bivalve","\r\nHeight (shorter dimension in the plane of the valve) of the shell of a Bivalve."],["http://eol.org/schema/terms/ShellLengthBivalve","shell length, bivalve","Length (longest dimension) of the shell of a Bivalve."],["http://eol.org/schema/terms/ShootRootRatio","shoot:root ratio (SRR)","The quotient of the dry weight of the shoots produced during a given growth period divided by the dry weight of the roots esp. for crop plants."],["http://eol.org/schema/terms/SkeletalDensity","skeletal density","mass density of skeletal elements of the organism"],["http://eol.org/schema/terms/SkeletalReinforcement","skeletal reinforcement","The nature of structural reinforcements of shells, leaves, scutes, or carapaces. Smooth shells and carapaces lack reinforcements."],["http://eol.org/schema/terms/SocialGroupSize","social group size","Number of individuals in a group that spends the majority of their time in a 24 hour cycle together where there is some indication that these individuals form a social cohesive unit."],["http://eol.org/schema/terms/SocialSystem","social system","Description of the relationships among individuals within a population of organisms, including reproductive relationships (mating system), relationships within each sex, adult – young interactions, helpers and cooperation (group living)."],["http://eol.org/schema/terms/SoilDepth","soil depth","The minimum depth of soil required for good growth. Plants that do not have roots such as rootless aquatic plants (floating or submerged) and epiphytes are assigned a minimum root depth value of zero."],["http://eol.org/schema/terms/SoilPH","soil pH","The soil pH, of the top 12 inches of soil, within the plant’s known geographical range. For cultivars, the geographical range is defined as the area to which the cultivar is well adapted rather than marginally adapted."],["http://eol.org/schema/terms/SoilRequirements","soil requirements","The soil requirements (texture, moisture, chemistry) needed for a plant to establish and grow."],["http://eol.org/schema/terms/SpecimensInGGBN","specimens in GGBN?","this clade is represented by specimens in the Global Genome Biodiversity Network (GGBN)"],["http://eol.org/schema/terms/StandardLength","standard length","refers to the length of a fish measured from the tip of the snout to the posterior end of the last vertebra or to the posterior end of the midlateral portion of the hypural plate. Simply put, this measurement excludes the length of the caudal fin."],["http://eol.org/schema/terms/SulcusType","sulcus type","One of two arrangements of the sulcus"],["http://eol.org/schema/terms/TarsometatarsusPlusMiddleToeLength","tarsometatarsus + middle toe length","Length of the tarsometatarsus + length of the middle toe."],["http://eol.org/schema/terms/TarsusLength","tarsus length","Length of the tarsus.  In birds length of the tarsometatarsus (fusion of ankle and foot bones).\r\n"],["http://eol.org/schema/terms/TemperateOcean","Temperate Ocean",""],["http://eol.org/schema/terms/TemperatureAtRangeMidpointLatitude","temperature at range midpoint latitude","The temperature at the range midpoint latitude of an organism."],["http://eol.org/schema/terms/TemperatureInRange","temperature in geographic range","Monthly temperature within the geographic range of a taxon.  "],["http://eol.org/schema/terms/TemperatureTolerance","low temperature tolerance","The minimum tolerable temperature is the lowest temperature recorded in the plant’s historical range. If this is not available, the record low January temperature recorded at climate stations within the current geographical range of the plant is used. This definition does not apply to summer annuals."],["http://eol.org/schema/terms/Territorial","territorial","In ethology, territory is the sociographical area that an animal of a particular species consistently defends against conspecifics (or, occasionally, animals of other species). Animals that defend territories in this way are referred to as territorial."],["http://eol.org/schema/terms/TestesMass","Testes Mass",""],["http://eol.org/schema/terms/TestisLocation","testis location","Anatomical location of testis; eg: internal, descended, scrotal, inguinal."],["http://eol.org/schema/terms/ThreatenedEndangeredStatus","threatened or endangered status","Indicates whether a taxon is listed on a global or regional list of threatened or endangered organisms."],["http://eol.org/schema/terms/Tocantins/Pindare_moist_forests","Pindare moist forests",""],["http://eol.org/schema/terms/TotalSpecies","total species (expert opinion)","total estimated number of species in this clade (known + undescribed + undiscovered) (estimate based on expert opinion) (Appeltans et al. 2012. The Magnitude of Global Marine Species Diversity. Current Biology 22, 2189–2202. http://dx.doi.org/10.1016/j.cub.2012.09.036)"],["http://eol.org/schema/terms/TotalUnknownSpeciesExpert","total unknown marine species","Total species unknown in this clade (undescribed + undiscovered) (estimate based on\r\nexpert opinion) (Appeltans et al. 2012. The Magnitude of Global Marine Species Diversity. Current Biology 22, 2189–2202. http://dx.doi.org/10.1016/j.cub.2012.09.036)\""],["http://eol.org/schema/terms/TotalUnknownSpeciesStatisticalModel","total unknown species (statistical model)","total species unknown in this clade (estimate based on a statistical model) (Appeltans et al. 2012. The Magnitude of Global Marine Species Diversity. Current Biology 22, 2189–2202. http://dx.doi.org/10.1016/j.cub.2012.09.036)"],["http://eol.org/schema/terms/ToxicEffect","toxic effect","A toxic effect has been observed in other organisms after consuming or contacting this organism"],["http://eol.org/schema/terms/TrophicGuild","trophic guild","A group of species that exploit the same food resources, and/or use the same feeding or foraging methods. http://en.wikipedia.org/wiki/Guild_(ecology)"],["http://eol.org/schema/terms/TropicalOcean","Tropical Ocean",""],["http://eol.org/schema/terms/TypeSpecimenRepository","type specimen repository","The institution that holds a type specimen for a given species.  The recommended best practice is to use the identifier in a collections registry such as the Biodiversity Collections Index (http://www.biodiversitycollectionsindex.org/)."],["http://eol.org/schema/terms/UndescribedSpeciesInMuseumCollections","undescribed marine species present in museum collections","\"marine species in this clade which are currently represented in specimen collections (estimate) (Appeltans et al. 2012. The Magnitude of Global Marine Species Diversity. Current Biology 22, 2189–2202. http://dx.doi.org/10.1016/j.cub.2012.09.036)\""],["http://eol.org/schema/terms/UndiscoveredMorphospecies","undiscovered marine morphospecies","unsampled and undiscovered marine morphospecies in this clade (estimate) (Appeltans et al. 2012. The Magnitude of Global Marine Species Diversity. Current Biology 22, 2189–2202. http://dx.doi.org/10.1016/j.cub.2012.09.036)"],["http://eol.org/schema/terms/UndiscoveredSpeciesMolecularCryptic","undiscovered species (molecular cryptic)","undiscovered molecular cryptic species in this clade (only distinguishable by molecular methods) (estimate) (Appeltans et al. 2012. The Magnitude of Global Marine Species Diversity. Current Biology 22, 2189–2202. http://dx.doi.org/10.1016/j.cub.2012.09.036)"],["http://eol.org/schema/terms/Uses","used for","The uses of the organism or products derived from the organism."],["http://eol.org/schema/terms/VegetativeSpreadRate","vegetative spread rate","The rate at which this plant can spread compared to other species with the same growth habit."],["http://eol.org/schema/terms/VocalizationBehavior","vocalization behavior","Sounds produced by organisms through the use of a larynx, syrinx, or other evolutionarily homologous organ located in the neck."],["http://eol.org/schema/terms/VoucheredSequence","vouchered sequence","Molecular sequence data vouchered by a physical specimen or photo voucher."],["http://eol.org/schema/terms/WaterTemperature","water temperature","temperature of water in marine or aquatic habitat, at a location where this organism has been observed or collected."],["http://eol.org/schema/terms/WeaningAge","weaning age","Age when primary nutritional dependency on the mother ends and independent foraging begins to make a major contribution to the offspring’s energy requirements."],["http://eol.org/schema/terms/ZooplanktonFeedingMode","zooplankton feeding mode","behavior by which zooplankton obtain food; ambush, feeding current, or cruising. (Barton, AD, Pershing, AJ, Litchman, E, Record, NR, Edwards, KF, Finkel, ZV, Kiørboe, T, Ward, BA. 2013. The biogeography of marine plankton traits. Ecology Letters (2013) 16: 522–534. DOI: 10.1111/ele.12063)"],["http://eol.org/schema/terms/acicular","acicular (needle-like)","Slender and pointed, needle-like"],["http://eol.org/schema/terms/acidicFreshwaterMiningLake","acidic freshwater mining lake",""],["http://eol.org/schema/terms/activeForaging","active forager","An organism which obtains food primarily by active searching."],["http://eol.org/schema/terms/activityCycleOther","nocturnal/crepuscular, cathemeral, crepuscular or diurnal/crepuscular","An organism that is nocturnal/crepuscular, cathemeral, crepuscular or diurnal/crepuscular"],["http://eol.org/schema/terms/adaptiveStrategy","adaptive strategy","mechanisms and responses used by organisms to reproduce, defend, survive, and compete on the landscape."],["http://eol.org/schema/terms/alternatingReproduction","alternation of generations","Organisms with a life cycle that features alternation of generations with sexual and asexual reproduction."],["http://eol.org/schema/terms/ambush","ambush predator","organisms that capture or trap prey by stealth or by strategy (typically not conscious strategy), rather than by speed or by strength. "],["http://eol.org/schema/terms/amphibious","amphibious","organism that is adapted to both life on land and in the water."],["http://eol.org/schema/terms/androviviparous","androviviparous","Having paternal care wherein eggs are incubated internally by the father, and young emerge post-hatching"],["http://eol.org/schema/terms/anemochory","anemochory","Seed dispersal by wind (with wind dispersal adaptations, such as pappus or wings).\r\n"],["http://eol.org/schema/terms/ante-isooctadecanoic_acid","ante-isooctadecanoic acid",""],["http://eol.org/schema/terms/anteisotetradecanoic_acid","ante-isotetradecanoic acid",""],["http://eol.org/schema/terms/aquatic","aquatic adapted","organism that is adapted to life in the water"],["http://eol.org/schema/terms/areaToMassRatio","Area/mass ratio","Quotient (or ratio) of surface area of a body/mass of the same body"],["http://eol.org/schema/terms/atLeastShortPersistentSeedBank","at least short-persistent","Of seed bank longevity.  Seed bank longevity is \u003e 1 and at least \u003c= 5 yr (could be longer but it is unknown)."],["http://eol.org/schema/terms/autochory","autochory","Seed dispersal by gravity, without the assistance of any dispersal vector (= unassisted dispersal)."],["http://eol.org/schema/terms/ballistichory","ballistichory","Dehiscence of fruit occurs as an explosion, launching seeds far away from the plant (= ballochory).\r\n"],["http://eol.org/schema/terms/benthic","benthic","Living at the bottom of a body of water."],["http://eol.org/schema/terms/bodyMassDry","dry body mass",""],["http://eol.org/schema/terms/bodyMassWet","wet body mass","Mass of one individual of this taxon, living or fresh, without desiccation"],["http://eol.org/schema/terms/breedingSeason","breeding season","The breeding season is the most suitable season, usually with favorable conditions and abundant food and water, for breeding. Abiotic factors such as the timing of seasonal rains and winds can also play an important role in breeding onset and success."],["http://eol.org/schema/terms/broadcastSpawner","broadcast spawner","Broadcast spawners scatter their eggs into the water; they spawn numerous small eggs that develop rapidly."],["http://eol.org/schema/terms/bromelicolous","bromeliads","bromeliad plants, used as a habitat or shelter"],["http://eol.org/schema/terms/browsing","browser","herbivore that eats parts of plants including high-growing shrubs and trees."],["http://eol.org/schema/terms/burl","burl","A burl (American English) or bur or burr (used in all non-US English speaking countries) is a tree growth in which the grain has grown in a deformed manner. It is commonly found in the form of a rounded outgrowth on a tree trunk or branch that is filled with small knots from dormant buds."],["http://eol.org/schema/terms/caespitose","caespitose","growing in clusters or tufts"],["http://eol.org/schema/terms/carnivorous_scavenger","carnivorous scavenger","organism that feeds on dead animal material"],["http://eol.org/schema/terms/chemosymbiotroph","chemosymbiotroph","A consumer that derives energy from a chemosynthetic symbiont"],["http://eol.org/schema/terms/ciliary_gliding","ciliary gliding","a type of locomotion in which an animal moves on a secreted layer of mucus, propelled by the beating of cilia. It is characteristic of small, soft-bodied invertebrates."],["http://eol.org/schema/terms/ciliary_mucus_feeder","ciliary-mucus feeder ","a consumer that feeds using rows of cilia carrying a mucus sheet across some structure while water is passed through or across it"],["http://eol.org/schema/terms/clearWater","clear water",""],["http://eol.org/schema/terms/cloud_forest","cloud forest",""],["http://eol.org/schema/terms/cnidaria_feeder","cnidaria feeder","a carnivore that feeds primarily on cnidarians"],["http://eol.org/schema/terms/colonyDensity","colony density","in a colonial organism, the number of individuals per area or per volume"],["http://eol.org/schema/terms/commerciallyHarvested","commercially harvested","This organism is either cultivated or harvested in whole or in part from the wild, for sale."],["http://eol.org/schema/terms/competitive","competitive","Competitors are species that thrive in areas of low intensity stress and disturbance and excel in biological competition. These species are able to outcompete others by most efficiently tapping into available resources. Competitors do this through a combination of favorable characteristics, including rapid growth rate, high productivity and high capacity for phenotypic plasticity."],["http://eol.org/schema/terms/cone","Cone","{definition missing}"],["http://eol.org/schema/terms/conePlusHalfSphere-40Percent","conePlusHalfSphere minus 40Percent",""],["http://eol.org/schema/terms/conservationDependent","conservation dependent","The category is part of the IUCN 1994 Categories \u0026 Criteria (version 2.3), which is no longer used in evaluation of taxa, but persists in the IUCN Red List for taxa evaluated prior to 2001. It was assigned to species or lower taxa which were dependent on conservation efforts to prevent the taxon becoming threatened with extinction. "],["http://eol.org/schema/terms/copepodid3","copepodid stage 3","The third post-naupliar life stage of a copepod. All copepodid stages are characterised by two pairs of unsegmented swimming appendages, and an unsegmented \"hind-body\" comprising the thorax and the abdomen. (http://en.wikipedia.org/wiki/Copepodid#Copepoda)"],["http://eol.org/schema/terms/copepodid4","copepodid stage 4","The fourth post-naupliar life stage of a copepod. All copepodid stages are characterised by two pairs of unsegmented swimming appendages, and an unsegmented \"hind-body\" comprising the thorax and the abdomen. (http://en.wikipedia.org/wiki/Copepodid#Copepoda)"],["http://eol.org/schema/terms/copepodid5","copepodid stage 5","The fifth post-naupliar life stage of a copepod. All copepodid stages are characterised by two pairs of unsegmented swimming appendages, and an unsegmented \"hind-body\" comprising the thorax and the abdomen. (http://en.wikipedia.org/wiki/Copepodid#Copepoda)"],["http://eol.org/schema/terms/coralliteWidth","corallite width","The width of a corallite (skeleton of a single coral polyp), typically measured in association with another trait (e.g., eggs per polyp)."],["http://eol.org/schema/terms/corymbose","corymbose","colonies which have horizontal interlocking branches and also have short upright branchlets, usually used for some Acropora species"],["http://eol.org/schema/terms/criticallyEndangered","critically endangered","A taxon is Critically Endangered when the best available evidence indicates that it meets \r\nany of the criteria A to E for Critically Endangered, and it is therefore considered to be facing an extremely high risk of extinction in the wild"],["http://eol.org/schema/terms/cruising","cruising feeder","An organism which obtains food by foraging while cruising."],["http://eol.org/schema/terms/crustose","crustose","crustlike, growing tight against the substrate"],["http://eol.org/schema/terms/cuneiform","cuneiform","wedge-shaped"],["http://eol.org/schema/terms/dahllite","dahllite",""],["http://eol.org/schema/terms/depositFeeder","deposit feeder","an organism that eats particulate organic material in or on sediments."],["http://eol.org/schema/terms/determinateGrowth","determinate growth","determinate growth stops once a genetically pre-determined structure has completely formed"],["http://eol.org/schema/terms/diandry","diandric","Two types of males, namely, primary males and secondary males coexist in diandric protogynous fishes. Secondary males are derived from females through sex change, i.e. they are protogynous hermaphrodites. In contrast, primary males are considered to be born males and do not change sex. Both young primary males (Initial Phase) and females may mature into Terminal Phase males, which have breeding priority."],["http://eol.org/schema/terms/dielVerticalMigration","diel vertical migration","A pattern of movement used by some organisms, such as Copepods, living in the ocean and in lakes. The migration occurs when organisms move up to the epipelagic zone at night and return to the mesopelagic zone of the oceans or to the hypolimnion zone of lakes during the day"],["http://eol.org/schema/terms/droughtSemiDeciduous","drought semi-deciduous","A plant that drops part of its leaves during the dry period (excluding species that exceptionally drop leaves in very dry periods).\r\n"],["http://eol.org/schema/terms/dryFruit","dry fruit","A fruit that lacks succulent tissue at maturity."],["http://eol.org/schema/terms/dryMass","Dry mass",""],["http://eol.org/schema/terms/dry_forest","dry forest",""],["http://eol.org/schema/terms/dwarfMales","dwarf males","sexual dimorphism where the body of the male is reduced- smaller than the female and sometimes simplified."],["http://eol.org/schema/terms/dystrophicMontaneFreshwaterLake","dystrophic montane freshwater lake",""],["http://eol.org/schema/terms/earlySpring","early spring","The early part of the season between the vernal equinox and the summer solstice."],["http://eol.org/schema/terms/earlySummer","early summer","The early part of the season between the summer solstice and the autumnal equinox."],["http://eol.org/schema/terms/echinoderm_feeder","echinoderm feeder","a carnivore that feeds primarily on echinoderms"],["http://eol.org/schema/terms/eggColor","egg color","Coloring or pigmentation of the eggs spawned by an organism."],["http://eol.org/schema/terms/eggDensity","egg density","number of eggs deposited per unit area"],["http://eol.org/schema/terms/eggYolky","egg yolky","Yolk is visible in the egg."],["http://eol.org/schema/terms/endangered","endangered","A taxon is Endangered when the best available evidence indicates that it meets any of the \r\ncriteria A to E for Endangered, and it is therefore considered to be facing a very high risk of extinction in the wild."],["http://eol.org/schema/terms/endozoochory","endozoochory","Seed dispersal via ingestion by vertebrate animals (mostly birds and mammals)."],["http://eol.org/schema/terms/epicormicBuds","epicormic buds","Epicormic buds lie dormant beneath the bark, their growth suppressed by hormones from active shoots higher up the plant. Under certain conditions, they develop into active shoots, such as when damage occurs to higher parts of the plant, or light levels are increased following removal of nearby plants. Epicormic buds and shoots occur in many woody species, but are absent from many others, such as most conifers."],["http://eol.org/schema/terms/epifauna_feeder","epifauna feeder","a carnivore that feeds primarily on epifauna, animals that live attached to surfaces"],["http://eol.org/schema/terms/epihydate","epihydate","a plant with leaves and/or stems floating on the surface of the water but not rising above the water, roots penetrating the substrate."],["http://eol.org/schema/terms/epizoochory","epizoochory","Seed dispersal by external animal transport (= exozoochory).\r\n"],["http://eol.org/schema/terms/eutrophicFreshwaterLake","eutrophic freshwater lake",""],["http://eol.org/schema/terms/excavating","excavator","An organism which obtains food by excavating"],["http://eol.org/schema/terms/explanate","explanate","colonies spread horizontally as branches fuse into a solid or near solid plate"],["http://eol.org/schema/terms/extinct","extinct","A taxon is Extinct when there is no reasonable doubt that the last individual has died. A \r\ntaxon is presumed Extinct when exhaustive surveys in known and/or expected habitat, \r\nat appropriate times (diurnal, seasonal, annual), throughout its historic range have failed \r\nto record an individual. Surveys should be over a time frame appropriate to the taxon’s \r\nlife cycle and life form."],["http://eol.org/schema/terms/extinctInTheWild","extinct in the wild","A taxon is Extinct in the Wild when it is known only to survive in cultivation, in captivity \r\nor as a naturalized population (or populations) well outside the past range. A taxon is \r\npresumed Extinct in the Wild when exhaustive surveys in known and/or expected habitat, \r\nat appropriate times (diurnal, seasonal, annual), throughout its historic range have failed \r\nto record an individual. Surveys should be over a time frame appropriate to the taxon’s \r\nlife cycle and life form. \r\n"],["http://eol.org/schema/terms/facultativeClimber","facultative climber",""],["http://eol.org/schema/terms/facultativeEpiphyte","facultative epiphyte",""],["http://eol.org/schema/terms/farming_symbiotroph","farming symbiotroph","A consumer that acquires nutrition by consuming an autotrophic symbiont growing on its body"],["http://eol.org/schema/terms/feedingCurrent","feeding current","An organism which obtains food by utilizing a feeding current."],["http://eol.org/schema/terms/fleshyFruit","fleshy fruit","A fruit with at least one tissue that is succulent at maturity."],["http://eol.org/schema/terms/foliose","foliose","leaflike, with flat sheets of tissue not tightly bound"],["http://eol.org/schema/terms/forestEdge","forest edge",""],["http://eol.org/schema/terms/fossilOccPBDB","number of fossil occurrences","The number of fossil occurrences in the Paleobiology Database (https://paleobiodb.org) that are identified as belonging to a particular taxon or any of its subtaxa."],["http://eol.org/schema/terms/fossorialOrGround","fossorial and/or ground dwelling","An organism that is adapted to terrestrial life below ground, on or near the ground.  "],["http://eol.org/schema/terms/fructose","fructose","free-standing branching tubes"],["http://eol.org/schema/terms/gonadRatioFemaleToMale","gonad ratio F/M","Ratio of female:male gonads in a hermaphroditic organism"],["http://eol.org/schema/terms/grayGreen","gray-green","Of green tinged with grey."],["http://eol.org/schema/terms/groundDwelling","fossorial and/or ground dwelling only","An organism that spends most of its time on the ground or underground."],["http://eol.org/schema/terms/growthHabit","growth habit","general growth form, including size and branching.  Some organisms have different growth habits depending on environment or location"],["http://eol.org/schema/terms/halfmax_growth_concentration_ammonium","halfmax growth concentration (ammonium)","ambient ammonium concentration at which specific growth rate equals half of maximum, if ammonium is limiting growth."],["http://eol.org/schema/terms/halfmax_growth_concentration_nitrate","halfmax growth concentration (nitrate)","ambient nitrate concentration at which specific growth rate equals half of maximum, if nitrate is limiting growth."],["http://eol.org/schema/terms/halfmax_growth_concentration_phosphate","halfmax growth concentration (phosphate)","ambient phosphate concentration at which specific growth rate equals half of maximum, if phosphate is limiting growth."],["http://eol.org/schema/terms/halfmax_uptake_concentration_ammonium","halfmax uptake concentration (ammonium)","ambient ammonium concentration at which uptake rate equals half of maximum"],["http://eol.org/schema/terms/halfmax_uptake_concentration_nitrate","halfmax uptake concentration (nitrate)","ambient nitrate concentration at which uptake rate equals half of maximum"],["http://eol.org/schema/terms/halfmax_uptake_concentration_phosphate","halfmax uptake concentration (phosphate)","ambient phosphate concentration at which uptake rate equals half of maximum"],["http://eol.org/schema/terms/hardSubstrateBoring","hard substrate boring","Organisms living in burrows bored into hard substrates such as rock, coral, or wood."],["http://eol.org/schema/terms/hemiepiphyte","hemiepiphyte","plants that spend part of their life cycle as epiphytes"],["http://eol.org/schema/terms/highArctic","high Arctic","Zones A, B and C, per the Circumpolar Arctic Vegetation Map (CAVM Team 2003)"],["http://eol.org/schema/terms/highCNRatio","high (\u003e59)","The percentage of organic carbon divided by the percentage of total nitrogen in organic material is higher than 59."],["http://eol.org/schema/terms/highNitrogenFixation","high N fixation","Plants with high nitrogen fixation. More than 160 lb nitrogen per acre per year fixed in monoculture."],["http://eol.org/schema/terms/hispidose","hispidose","(equivalent to ‘bottlebrush’) describes branching where sub-branches radiate in all directions from main branches and where corallites on sub-branches are generally elongate. Applied only to the genus Acropora"],["http://eol.org/schema/terms/hydrochory","hydrochory","Seed dispersal by water."],["http://eol.org/schema/terms/hyperhydate","hyperhydate","an emergent plant, with leaves and/or stems emerging well beyond the water surface, roots penetrating the substrate"],["http://eol.org/schema/terms/infauna_feeder","infauna feeder","a carnivore that feeds primarily on infauna, animals that live in benthic sediment"],["http://eol.org/schema/terms/inguinal","inguinal","Descended but ascrotal testes, a derived condition in mammals."],["http://eol.org/schema/terms/intermediateEpifaunal","intermediate-level epifaunal","Organism living on the surface of the substratum on rocks or biogenic substrates several centimeters above the seafloor."],["http://eol.org/schema/terms/invertivore","invertivore","An organism that feed on invertebrate animals (insects, crustaceans, molluscs, worms, etc.)"],["http://eol.org/schema/terms/lateSpring","late spring","The late part of the season between the vernal equinox and the summer solstice."],["http://eol.org/schema/terms/lateSummer","late summer","The late part of the season between the summer solstice and the autumnal equinox."],["http://eol.org/schema/terms/lateWinter","late winter","The late part of the season between the winter solstice and the vernal equinox."],["http://eol.org/schema/terms/lichenicole","lichenicole","An organism that lives on lichens, used most commonly for parasitic fungi."],["http://eol.org/schema/terms/lichenous","lichenous","Organism generally recognized as a single organism that consists of a fungus and an alga or cyanobacterium living in symbiotic association. Often attached to solid objects such as rocks or living or dead wood rather than soil."],["http://eol.org/schema/terms/lignotuber","lignotuber","A lignotuber is a woody swelling of the root crown possessed by some plants as a protection against destruction of the plant stem, such as by fire. The crown contains buds from which new stems may sprout, as well as stores of starch, that can support a period of growth in the absence of photosynthesis."],["http://eol.org/schema/terms/lignotuberOrBurl","lignotuber or burl","Woody swelling at or below ground level with unspecified origin (no distinction between lignotuber and burl is reported)."],["http://eol.org/schema/terms/littoralZone","littoral zone",""],["http://eol.org/schema/terms/longPersistentSeedBank","long-persistent","Of seed bank longevity. Seed bank longevity is at least \u003e 15 yr."],["http://eol.org/schema/terms/lowArctic","low Arctic","Zone D, per the Circumpolar Arctic Vegetation Map (CAVM Team 2003)"],["http://eol.org/schema/terms/lowCNRatio","low (\u003c23)","The percentage of organic carbon divided by the percentage of total nitrogen in organic material is lower than 23."],["http://eol.org/schema/terms/lowEpifaunal","low-level epifaunal","Organism living on the surface of the substratum in the immediate vicinity of the seafloor."],["http://eol.org/schema/terms/lowNitrogenFixation","low N fixation","Plants with low nitrogen fixation. Less than 85 lb nitrogen per acre per year fixed in monoculture."],["http://eol.org/schema/terms/mammalivore","mammalivore","carnivorous animal which eats primarily mammals"],["http://eol.org/schema/terms/max_cell_storage_ammonium","max cell storage (ammonium)","maximum cell content of ammonium under exponential growth with saturating nutrient supply"],["http://eol.org/schema/terms/max_cell_storage_nitrate","max cell storage (nitrate)","maximum cell content of nitrate under exponential growth with saturating nutrient supply"],["http://eol.org/schema/terms/max_cell_storage_phosphate","max cell storage (phosphate)","maximum cell content of phosphate under exponential growth with saturating nutrient supply"],["http://eol.org/schema/terms/max_growth_rate_ammonimum","max growth rate (ammonimum)","asymptotic maximum specific growth rate under unlimited ambient ammonium"],["http://eol.org/schema/terms/max_growth_rate_internal_ammonimum","max growth rate - infinite quota (ammonimum)","hypothetical asymptotic maximum specific growth rate at infinite internal cell concentration of ammonium"],["http://eol.org/schema/terms/max_growth_rate_internal_nitrate","max growth rate - infinite quota (nitrate)","hypothetical asymptotic maximum specific growth rate at infinite internal cell concentration of nitrate"],["http://eol.org/schema/terms/max_growth_rate_internal_phosphate","max growth rate - infinite quota (phosphate)","hypothetical asymptotic maximum specific growth rate at infinite internal cell concentration of phosphate"],["http://eol.org/schema/terms/max_growth_rate_nitrate","max growth rate (nitrate)","asymptotic maximum specific growth rate under unlimited ambient nitrate"],["http://eol.org/schema/terms/max_growth_rate_phosphate","max growth rate (phosphate)","asymptotic maximum specific growth rate under unlimited ambient phosphate"],["http://eol.org/schema/terms/max_uptake_rate_ammonium","max uptake rate (ammonium)","asymptotic maximum rate of ammonium uptake at infinite concentration"],["http://eol.org/schema/terms/max_uptake_rate_nitrate","max uptake rate (nitrate)","asymptotic maximum rate of nitrate uptake at infinite concentration"],["http://eol.org/schema/terms/max_uptake_rate_phosphate","max uptake rate (phosphate)","asymptotic maximum rate of phosphate uptake at infinite concentration"],["http://eol.org/schema/terms/mediumCNRatio","medium (23 – 59)","The percentage of organic carbon divided by the percentage of total nitrogen in organic material is 23–59."],["http://eol.org/schema/terms/mediumNitrogenFixation","medium  N fixation","Plants with medium nitrogen fixation. 85-160 lb nitrogen per acre per year fixed in monoculture."],["http://eol.org/schema/terms/mesotrophicFreshwaterLake","mesotrophic freshwater lake",""],["http://eol.org/schema/terms/microcarnivore","microcarnivore","carnivore that eats small invertebrates, e.g., microcrustaceans, mollusc and bryozoan larvae."],["http://eol.org/schema/terms/microphytobenthos","microphytobenthos","The community of microscopic, unicellular eukaryotic algae (Baccilariophyceae, Chlorophyceae and Dinophyceae) and the  prokaryotic Cyanobacteria which live on sediment surfaces. See Kiel, 2004. The microphytobenthos and its role in aquatic food webs. Dissertation zur Erlangung des Doktorgrades der Mathematisch-Naturwissenschaftlichen Fakultät der Christian-Albrechts-Universität zu Kiel http://epic.awi.de/11852/1/Abe2004e.pdf"],["http://eol.org/schema/terms/midPersistentSeedBank","mid-persistent","Of seed bank longevity.  Seed bank longevity is at least \u003e 5 yr (could be longer but it is unknown)."],["http://eol.org/schema/terms/midSpring","mid spring","The mid part of the season between the vernal equinox and the summer solstice."],["http://eol.org/schema/terms/midSummer","mid summer","The mid part of the season between the summer solstice and the autumnal equinox."],["http://eol.org/schema/terms/middleArcticDwarfShrubSubzone","middle Arctic dwarf shrub subzone","Zone C, per the Circumpolar Arctic Vegetation Map (CAVM Team 2003)"],["http://eol.org/schema/terms/migratory","migratory","makes regular daily or seasonal movements between different regions or habitats "],["http://eol.org/schema/terms/min_internal_ammonium_for_growth","min internal ammonium for growth","minimum cell content of ammonium at which growth ceases"],["http://eol.org/schema/terms/min_internal_nitrate_for_growth","min internal nitrate for growth","minimum cell content of nitrate at which growth ceases"],["http://eol.org/schema/terms/min_internal_phosphate_for_growth","min internal phosphate for growth","minimum cell content of phosphate at which growth ceases"],["http://eol.org/schema/terms/mixotrophy","mixotrophic","Deriving energy from more than one category of energy source. eg: light energy and organic matter."],["http://eol.org/schema/terms/moderateLifeSpan","moderate life span","A life span which is neither relatively low nor relatively high."],["http://eol.org/schema/terms/moderateRate","moderate","Moderate rate.  A rate which is neither relatively high nor low."],["http://eol.org/schema/terms/monandry","monandric","Protogynous hermaphrodites with only juvenile females, where a certain percentage of females changes into (terminal) males are termed monandric."],["http://eol.org/schema/terms/mucus_net_feeder","mucus net feeder","A consumer that uses patches or a sheet of mucus to capture food particles suspended in the water column"],["http://eol.org/schema/terms/myrmecochory","myrmecochory","Seed dispersal by ants."],["http://eol.org/schema/terms/nearThreatened","near threatened","A taxon is Near Threatened when it has been evaluated against the criteria but does not \r\nqualify for Critically Endangered, Endangered or Vulnerable now, but is close to qualifying \r\nfor or is likely to qualify for a threatened category in the near future."],["http://eol.org/schema/terms/nektobenthic","nektobenthic","Active swimming organisms that live near the bottom a body of water."],["http://eol.org/schema/terms/net_carbon_fixation_rate","Net Carbon Fixation Rate","net amount or mass of carbon converted from CO2 to organic compounds, per time"],["http://eol.org/schema/terms/no","no","This statement is false; the answer to this question is no."],["http://eol.org/schema/terms/noHarem","No Harem",""],["http://eol.org/schema/terms/noPaternalCare","no paternal care",""],["http://eol.org/schema/terms/noSocialGroupLiving","No Social Group Living",""],["http://eol.org/schema/terms/non-woodyEpipyte","non-woody epiphyte","Non-woody plants growing attached to external support without contact to the ground. Non-woody hemiepiphytes either germinate on other plants and then establish roots in the ground, or germinate on the ground and later disconnect from the soil"],["http://eol.org/schema/terms/northernArcticDwarfShrubSubzone","northern Arctic dwarf shrub subzone","Zone B, per the Circumpolar Arctic Vegetation Map (CAVM Team 2003)"],["http://eol.org/schema/terms/notMonogamous","Not Monogamous",""],["http://eol.org/schema/terms/obligateClimber","obligate climber",""],["http://eol.org/schema/terms/obligateEpiphyte","obligate epiphyte",""],["http://eol.org/schema/terms/oceanodromous","oceanodromous","An oceanodromous fish, like an anadromous or catadromous fish, is migratory. Unlike anadromous or catadromous fish, an oceanodromous fish spends its whole life in salt water."],["http://eol.org/schema/terms/oligotrophicFreshwaterLake","oligotrophic freshwater lake",""],["http://eol.org/schema/terms/otherBudSource","other","Bud sources other than epicormic buds, apex, root crown, lignotuber, burl, rhizome, roots or storage organs, including those not clearly specified (e.g., stump)."],["http://eol.org/schema/terms/pH","pH","Measured pH of water at a location where this organism has been observed or collected."],["http://eol.org/schema/terms/paternalCare","Paternal Care",""],["http://eol.org/schema/terms/pathogen_vector_parasite","pathogen vector parasite","a parasite that introduces a pathogen, eg: a bacterium, into the body of its host, and then feeds on the pathogen as it proliferates in or on the host."],["http://eol.org/schema/terms/persistentSeedBank","persistent","Of seed bank longevity. Seeds do not germinate in the first favourable season after dispersal. Generally seed bank longevity is \u003e 1 yr (could be longer but it is unknown)."],["http://eol.org/schema/terms/phagocytosis","phagocytosis feeder","a consumer that feeds primarily by phagocytosis, a cellular-level process that results in the engulfment of food particles outside the body, by specialized cells called phagocytes. Literally, \"eating by the cell\"."],["http://eol.org/schema/terms/photosymbiotroph","photosymbiotroph","A consumer that derives energy from a photosynthetic symbiont"],["http://eol.org/schema/terms/photosyntheticPathway","photosynthetic pathway","the biochemical pathway a plant uses to gain carbon for growth and reproduction. Plants have evolved three photosynthetic pathways, each in response to distinct environmental conditions, resulting in differences in their ecological patterns of growth and distribution."],["http://eol.org/schema/terms/photosyntheticStem","photosynthetic stem","Stem photosynthesis is similar to C3 leaf photosynthesis and occurs in species inhabiting a diversity of high-light sites"],["http://eol.org/schema/terms/phytoplanktivore","phytoplanktivore","A herbivorous organism feeding primarily on phytoplankton"],["http://eol.org/schema/terms/planktotrophic","planktotroph","Planktotrophic species generally have fairly long pelagic larval durations and feed while in the water column. Consequentially, they have the potential to disperse long distances."],["http://eol.org/schema/terms/pleustophyte","pleustophyte","a plant that is free-floating on the water surface, not attached to or penetrating the substrate, with some photosynthetic parts in contact with air."],["http://eol.org/schema/terms/population_trend","population trend","i.e., increasing, decreasing, stable, or unknown"],["http://eol.org/schema/terms/predatorScavenger","predator–scavenger","An organism which obtains food primarily by predation +scavenging. Reid WDK, Wigham BD, McGill RAR, Polunin NVC (2012) Elucidating trophic pathways in benthic deep-sea assemblages of the Mid-Atlantic Ridge north and south of the Charlie-Gibbs Fracture Zone. Mar Ecol Prog Ser 463:89-103. doi:10.3354/meps09863"],["http://eol.org/schema/terms/predatory_suspension_feeder","predatory suspension feeder","A predator that captures small or microscopic prey primarily by suspension feeding"],["http://eol.org/schema/terms/protozoa_feeder","protozoa feeder","a consumer that feeds primarily on protozoans"],["http://eol.org/schema/terms/rateOfDevelopment","rate of development","The rate of progress of an organism from the earliest life stage (zygote, for multicellular organisms) to the mature form. Usually described qualitatively."],["http://eol.org/schema/terms/rhizomesOrRoots","rhizomes or roots","Rhizomes, roots or both (specific bud source is unknown)"],["http://eol.org/schema/terms/riparianWetland","riparian wetland",""],["http://eol.org/schema/terms/rockyGrassland","rocky grassland",""],["http://eol.org/schema/terms/rootCrown","root crown","A root crown, also known as the root collar or root neck, is that part of a root system from which a stem arises."],["http://eol.org/schema/terms/sacSpawner","sac spawner","Sac spawners lay their eggs into an ovigerous sac. Sac spawners spawn few but relatively large eggs that develop slowly."],["http://eol.org/schema/terms/scaleLike","scale-like","A quality inhering in a bearer by virtue of the bearer's shape resemling a scale."],["http://eol.org/schema/terms/scraping","scraper","An organism which obtains food by scraping"],["http://eol.org/schema/terms/scrotal","scrotal","Testes are located outside of the body, suspended by the spermatic cord within the scrotum."],["http://eol.org/schema/terms/seedHoarding","seed hoarding","Seed dispersal via scattering and hoarding of propagules by animals (other than ants)."],["http://eol.org/schema/terms/self-supportingGrowthForm","self-supporting","an organism relying on its own supportive tissues rather than a climbing habit to achieve vertical growth"],["http://eol.org/schema/terms/semi-woody","semi-woody","partially woody; partially lignified"],["http://eol.org/schema/terms/semiInfaunal","semi-infaunal","Benthic organism whose body is partly within the substrate or may be covered by sediment during life."],["http://eol.org/schema/terms/semifossorial","semifossorial","organism that is adapted to digging and life underground but also spends a considerable amount of its life above ground."],["http://eol.org/schema/terms/shallowInfaunal","shallow infaunal","Benthic organism that lives within the upper layers of unlithified (soft) substrate."],["http://eol.org/schema/terms/sheltered","sheltered","not exposed"],["http://eol.org/schema/terms/shortPersistentSeedBank","short-persistent","Of seed bank longevity. Seed bank longevity is  \u003e 1 and \u003c= 5 yr."],["http://eol.org/schema/terms/skeletal_density ","skeletal density ","automatically added during harvest"],["http://eol.org/schema/terms/solitary","solitary","Solitary animals are those that spend a majority of their lives without others of their species, with possible exceptions for mating and raising their young. The antonym to a solitary animal is a social animal."],["http://eol.org/schema/terms/southernArcticDwarfShrubSubzone","southern Arctic dwarf shrub subzone","Zone D, per the Circumpolar Arctic Vegetation Map (CAVM Team 2003)"],["http://eol.org/schema/terms/sponge_feeder","sponge feeder","a carnivore that feeds primarily on sponges"],["http://eol.org/schema/terms/squamulose","squamulose","tightly clustered and slightly flattened pebble-like units"],["http://eol.org/schema/terms/stageAtFertilization","stage at fertilization","stage of nucleus at time of fertilization"],["http://eol.org/schema/terms/stomachCramps","stomach cramps","Involuntary contraction of abdominal muscles"],["http://eol.org/schema/terms/stressTolerant","stress-tolerant","Stress tolerant species live in areas of high intensity stress and low intensity disturbance. Species that have adapted this strategy generally have slow growth rates, high rates of nutrient retention, and low phenotypic plasticity. Stress tolerators respond to environmental stresses through physiological variability. These species are often found in stressful environments."],["http://eol.org/schema/terms/subalpineFreshwaterLake","subalpine freshwater lake",""],["http://eol.org/schema/terms/submassive","submassive","Dense, slow growing colonies which are not hemispherical, but have a more irregular or columnar shape"],["http://eol.org/schema/terms/subshrub","subshrub","Low-growing plant usually under 0.5 m (1.5 feet) tall, never exceeding 1 meter (3 feet) tall at maturity."],["http://eol.org/schema/terms/subsurfaceDepositFeeder","subsurface deposit feeder","An organism which obtains food primarily by subsurface deposit feeding. Reid WDK, Wigham BD, McGill RAR, Polunin NVC (2012) Elucidating trophic pathways in benthic deep-sea assemblages of the Mid-Atlantic Ridge north and south of the Charlie-Gibbs Fracture Zone. Mar Ecol Prog Ser 463:89-103. doi:10.3354/meps09863"],["http://eol.org/schema/terms/succulent","succulent","A fleshy, juicy, swollen plant or plant structure."],["http://eol.org/schema/terms/suddHydrophyte","sudd hydrophyte","an aquatic plant that grows rooted in sudd (an impenetrable mass of floating vegetable matter)."],["http://eol.org/schema/terms/suffrutescent","suffrutescent","of habit, a plant with a herbaceous upper part and woody lower part."],["http://eol.org/schema/terms/suspensionFeeder","suspension feeder","An organism which feeds on organisms and/or particles suspended in the water column."],["http://eol.org/schema/terms/symbiontInheritance","symbiont inheritance","Symbiont transmission maintains symbioses through host generations. In vertical transmission, the symbiont is inherited from the mother or, more rarely, from both parents."],["http://eol.org/schema/terms/symbiotroph","symbiotroph","A consumer that acquires nutrition from a symbiont"],["http://eol.org/schema/terms/tenagophyte","tenagophyte","an amphibious plant, the juvenile submerged or floating on water and the adult (reproductive) phase terrestrial."],["http://eol.org/schema/terms/terrestrialPlant","terrestrial plant","A terrestrial plant is a plant that grows on or in or from land. Other types of plants are aquatic (living in water), epiphytic (living on trees) and lithophytic (living in or on rocks)"],["http://eol.org/schema/terms/testicond","testicond","Undescended testicles, the ancestral condition in mammals."],["http://eol.org/schema/terms/thoraxLength","Thorax Length",""],["http://eol.org/schema/terms/trailing","trailing","Growing along the ground."],["http://eol.org/schema/terms/transientSeedBank","transient","Of seed bank longevity.   Seeds germinate in the first favourable season after dispersal. Generally, seed bank longevity is \u003c= 1 yr (no persistent seed bank)."],["http://eol.org/schema/terms/transverseDivision","transverse division","a common mode of asexual reproduction among \r\nskeletonless coelenterates and also in some skeletal anthozoans (division of the soft body must be associated with division of the skeleton)."],["http://eol.org/schema/terms/tropicalFreshwaterLake","tropical freshwater lake",""],["http://eol.org/schema/terms/turbidWater","turbid water","Turbidity is the cloudiness or haziness of a fluid caused by large numbers of individual particles that are generally invisible to the naked eye, similar to smoke in air. The measurement of turbidity is a key test of water quality."],["http://eol.org/schema/terms/ultraoligotrophicAlpineFreshwaterLake","ultraoligotrophic alpine freshwater lake",""],["http://eol.org/schema/terms/ultraoligotrophicFreshwaterLake","ultraoligotrophic freshwater lake",""],["http://eol.org/schema/terms/uncommon","uncommon","Common species and uncommon species are designations used in ecology to describe the population status of a species. Commonness is closely related to abundance. Abundance refers to the frequency with which a species is found in controlled samples; in contrast, species are defined as common or uncommon based on their overall presence in the environment. A species may be locally abundant without being common."],["http://eol.org/schema/terms/unknown","unknown","This statement may be true or false; the answer to this question is unknown."],["http://eol.org/schema/terms/upperEpifaunal","upper-level epifaunal","Organism living on the surface of the substratum on rocks or biogenic substrates a considerable distance above the seafloor."],["http://eol.org/schema/terms/vertivore","vertivore","carnivorous animal which eats primarily vertebrates"],["http://eol.org/schema/terms/veryLongPersistentSeedBank","very long-persistent","Of seed bank longevity. Seed bank longevity is at least \u003e= 30 yr."],["http://eol.org/schema/terms/vulnerable","vulnerable","A taxon is Vulnerable when the best available evidence indicates that it meets any of the \r\ncriteria A to E for Vulnerable, and it is therefore considered to be facing a high risk of extinction in the wild."],["http://eol.org/schema/terms/waveExposure","wave exposure","hydrodynamic exposure due to currents and tides"],["http://eol.org/schema/terms/weddelite","weddelite",""],["http://eol.org/schema/terms/wetMass","Wet mass",""],["http://eol.org/schema/terms/wet_forest","wet forest",""],["http://eol.org/schema/terms/whiteGrey","white-gray","A color between white and black colors, closer to white."],["http://eol.org/schema/terms/winterDeciduous","winter deciduous","A plant that drops all its leaves during the winter.\r\n"],["http://eol.org/schema/terms/winterSemiDeciduous","winter semi-deciduous","A plant that drops part of its leaves during the winter, maintaining some brownish leaves in the crown."],["http://eol.org/schema/terms/woodyEpipyte","woody epiphyte","Woody plants growing attached to external support without contact to the ground. Woody hemiepiphytes either germinate on other plants and then establish roots in the ground, or germinate on the ground and later disconnect from the soil"],["http://eol.org/schema/terms/yearRound","year round","An activity or period that continues throughout the entire year."],["http://eol.org/schema/terms/yes","yes","This statement is true; the answer to this question is yes."],["http://eol.org/schema/terms/zoochory","zoochory","Seed dispersal mediated by animals."],["http://eol.org/terms/endemic","endemic to","This organism is known to be endemic to this location or region"],["http://ncicb.nci.nih.gov/xml/owl/EVS/Thesaurus.owl#C25227","high","An elevated level or position or degree; greater than normal in degree or intensity or amount."],["http://ncicb.nci.nih.gov/xml/owl/EVS/Thesaurus.owl#C25285","diameter",""],["http://ncicb.nci.nih.gov/xml/owl/EVS/Thesaurus.owl#C49507","medium","Mid-way between small and large in number, quantity, magnitude or extent."],["http://ncicb.nci.nih.gov/xml/owl/EVS/Thesaurus.owl#C54166","variable","Marked by diversity or difference; liable to or capable of change."],["http://ncicb.nci.nih.gov/xml/owl/EVS/Thesaurus.owl#C54722","low","A minimum level or position or degree; less than normal in degree, intensity or amount."],["http://ncicb.nci.nih.gov/xml/owl/EVS/Thesaurus.owl#C61589","early","At or near the beginning of a period of time or course of events."],["http://ncicb.nci.nih.gov/xml/owl/EVS/Thesaurus.owl#C64998","late","Being or occurring at an advanced period of time or after a usual or expected time."],["http://polytraits.lifewatchgreece.eu/terms/BP_NO","no parental care",""],["http://polytraits.lifewatchgreece.eu/terms/BP_YES","parental care","this term applies to a species that provides any parental care to its offspring"],["http://polytraits.lifewatchgreece.eu/terms/CPLX","complex species",""],["http://polytraits.lifewatchgreece.eu/terms/DEV","developmental mechanism","The mechanism of the development of the embryo(s), inside or outside of the parental organism."],["http://polytraits.lifewatchgreece.eu/terms/DZ","depth zonation (benthos)",""],["http://polytraits.lifewatchgreece.eu/terms/DZP","depth zonation (pelagic)",""],["http://polytraits.lifewatchgreece.eu/terms/DZ_SUP","supralittoral zone","The zone of the shore immediately above the highest water leveland subjected to wetting by spray or wave splash"],["http://polytraits.lifewatchgreece.eu/terms/EGG","egg diameter","Diameter of the eggs spawned by an organism."],["http://polytraits.lifewatchgreece.eu/terms/EP","environmental position","Living location of the organism in relation to the water column, the sea floor and other organisms."],["http://polytraits.lifewatchgreece.eu/terms/EPKY","epitoky",""],["http://polytraits.lifewatchgreece.eu/terms/FAC","factors triggering reproduction",""],["http://polytraits.lifewatchgreece.eu/terms/FEED_NSD","non-selective deposit feeder","An organism that feeds on mud or sand and shows little discrimination in the size or type of particles eaten. The sediment is ingested and any digestible organic material is assimilated as it passes through the alimentary canal."],["http://polytraits.lifewatchgreece.eu/terms/FEED_SD","selective deposit feeder","Some deposit feeders do not ingest sediment haphazardly but use their palps or buccal organs to sort organic material from the sediment prior to ingestion. The method of sorting varies according to the types of palps present."],["http://polytraits.lifewatchgreece.eu/terms/FER","fertilization type",""],["http://polytraits.lifewatchgreece.eu/terms/FREQ","spawning frequency of the population",""],["http://polytraits.lifewatchgreece.eu/terms/HSET","habitat type of settlement / early development",""],["http://polytraits.lifewatchgreece.eu/terms/JMOB","juvenile mobility",""],["http://polytraits.lifewatchgreece.eu/terms/LDEV","larval development",""],["http://polytraits.lifewatchgreece.eu/terms/LM","larval mode of development",""],["http://polytraits.lifewatchgreece.eu/terms/MAT","age at first reproduction",""],["http://polytraits.lifewatchgreece.eu/terms/MOB_BUR","burrower","An organism that lives or moves in a burrow in soft sediments."],["http://polytraits.lifewatchgreece.eu/terms/PC","location of parental care",""],["http://polytraits.lifewatchgreece.eu/terms/PHF","physiographic feature",""],["http://polytraits.lifewatchgreece.eu/terms/RESORP","resorption of eggs",""],["http://polytraits.lifewatchgreece.eu/terms/RT","reproduction temperature",""],["http://polytraits.lifewatchgreece.eu/terms/RT_WARM","tropical waters (warm)",""],["http://polytraits.lifewatchgreece.eu/terms/RW","ecosystem engineering","directly or indirectly modulating the availability of resources to other species, by causing physical state changes in biotic or abiotic materials; modifying, maintaining and/or creating habitats"],["http://polytraits.lifewatchgreece.eu/terms/RW_BEV","blind-ended ventilator","Ventilation occurs when animals flush their burrows with overlying water for respiratory and feeding purposes. Blind-ended ventilation occurs when I-shaped burrows are flushed uni- or bidirectionally depending on the permeability of the sediment "],["http://polytraits.lifewatchgreece.eu/terms/RW_DC","downward conveyor","Downward conveyors exhibit a feeding strategy opposite to that of upward conveyors. Vertically oriented head-up feeders actively select and ingest particles at the surface and egest these non-locally as faeces in deeper sediment strata"],["http://polytraits.lifewatchgreece.eu/terms/RW_DIFF","biodiffusor","organisms with activities that usually result in a constant and random local sediment biomixing over short distances."],["http://polytraits.lifewatchgreece.eu/terms/RW_OEV","open-ended ventilator","In open-ended ventilation the burrows are U-shaped and can be flushed easily from one end to the other"],["http://polytraits.lifewatchgreece.eu/terms/RW_REG","regenerator","Regenerators are excavators that dig and continuously maintain burrows in the sediment and by doing so they mechanically transfer sediment from depth to the surface."],["http://polytraits.lifewatchgreece.eu/terms/RW_UC","upward conveyor","Upward conveyors are vertically oriented species that typically feed head-down at depth in the sediment. Vertically oriented head-down feeders actively select and ingest particles at the deeper sediments and egest these non-locally as faeces in the sediment surface"],["http://polytraits.lifewatchgreece.eu/terms/SETTL","substrate type of settlement",""],["http://polytraits.lifewatchgreece.eu/terms/SM","Sexual metamorphosis","Conspicuous change in the organism's body structure prior to reproduction"],["http://polytraits.lifewatchgreece.eu/terms/SM_YES","sexual metamorphosis",""],["http://polytraits.lifewatchgreece.eu/terms/SPERM","sperm type",""],["http://polytraits.lifewatchgreece.eu/terms/STRAT","reproductive strategy","timing of reproduction: one reproduction event, (semelparous) or multiple events (iteroparous)"],["http://polytraits.lifewatchgreece.eu/terms/STRUCT","feeding structure",""],["http://polytraits.lifewatchgreece.eu/terms/SUBST","substrate type",""],["http://polytraits.lifewatchgreece.eu/terms/SUBST_SM","sandy mud",""],["http://polytraits.lifewatchgreece.eu/terms/SYNC","synchronization of spawning",""],["http://polytraits.lifewatchgreece.eu/terms/TEMP","survival temperature",""],["http://polytraits.lifewatchgreece.eu/terms/TEMP_HOT","tropical waters (hot)",""],["http://polytraits.lifewatchgreece.eu/terms/TF_HAB","habitat-builder",""],["http://polytraits.lifewatchgreece.eu/terms/TOL","tolerance (AMBI index)",""],["http://polytraits.lifewatchgreece.eu/terms/TUBE","tube/ burrow material",""],["http://purl.allotrope.org/ontologies/property#AFX_0000939","is a component of","A physical object that is a component of a physical system."],["http://purl.bioontology.org/ontology/CSP/1138-4873","pattern of oogenesis",""],["http://purl.bioontology.org/ontology/CSP/2383-1863","animal population density","Number of animals in a population relative to space."],["http://purl.bioontology.org/ontology/CSP/2871-4249","body temperature","The degree of heat in the body of a living organism, temperature is measure of the average kinetic energy of the particles in a sample of matter, expressed in terms of units or degrees designated on a standard scale."],["http://purl.bioontology.org/ontology/MESH/D001831","body temperature","internal temperature of living individual"],["http://purl.bioontology.org/ontology/MESH/D009422","nervous system diseases",""],["http://purl.bioontology.org/ontology/MESH/D059646","genome size","The amount of DNA (or RNA) in one copy of a genome."],["http://purl.bioontology.org/ontology/MSH/D054712","survival salinity",""],["http://purl.bioontology.org/ontology/SNOMEDCT/165109007","basal metabolic rate","Basal metabolic rate (BMR) is the amount of energy expended daily by humans and other animals at rest. Rest is defined as existing in a neutrally temperate environment while in the post-absorptive state."],["http://purl.bioontology.org/ontology/SNOMEDCT/258262008","very large","[A qualitative descriptor of a size that is considerably more than typical.]"],["http://purl.bioontology.org/ontology/SNOMEDCT/260413007","none",""],["http://purl.bioontology.org/ontology/SNOMEDCT/260865002","growth rate","The rate of increase in the size of an organism per unit time."],["http://purl.bioontology.org/ontology/SNOMEDCT/271649006","systolic blood pressure",""],["http://purl.bioontology.org/ontology/SNOMEDCT/75367002","blood pressure","Blood pressure (BP), sometimes referred to as arterial blood pressure, is the pressure exerted by circulating blood upon the walls of blood vessels, and is one of the principal vital signs. When used without further specification, \"blood pressure\" usually refers to the arterial pressure of the systemic circulation. During each heartbeat, blood pressure varies between a maximum (systolic) and a minimum (diastolic) pressure."],["http://purl.dataone.org/odo/ECSO_00001143","carbon biomass","The amount of carbon present in biomass"],["http://purl.jp/bio/4/id/201306015586596728","benthic diatoms",""],["http://purl.obolibrary.org/obo/BSPO_0000055","anterior","An anatomical region that is the entire part of an anatomical structure anterior to a transverse plane or midpoint of body length"],["http://purl.obolibrary.org/obo/CEPH_0000036","brooding","Incubation of eggs by the parent."],["http://purl.obolibrary.org/obo/CHEBI_133326","barium sulfate","A metal sulfate with formula BaO4S. Virtually insoluble in water at room temperature, it is mostly used as a component in oil well drilling fluid it occurs naturally as the mineral barite"],["http://purl.obolibrary.org/obo/CHEBI_15379","oxygen","molecular oxygen, O2"],["http://purl.obolibrary.org/obo/CHEBI_15756","hexadecanoic acid",""],["http://purl.obolibrary.org/obo/CHEBI_17437","dimethyl sulfide","A methyl sulfide in which the sulfur atom is substituted by two methyl groups."],["http://purl.obolibrary.org/obo/CHEBI_18059","lipids","a loosely defined term for substances of biological origin that are soluble in nonpolar solvents. They consist of saponifiable lipids, such as glycerides (fats and oils) and phospholipids, as well as nonsaponifiable lipids, principally steroids"],["http://purl.obolibrary.org/obo/CHEBI_22984","calcium (Ca)",""],["http://purl.obolibrary.org/obo/CHEBI_25107","magnesium (Mg)",""],["http://purl.obolibrary.org/obo/CHEBI_26401","purines","A class of imidazopyrimidines that consists of purine and its substituted derivatives."],["http://purl.obolibrary.org/obo/CHEBI_27226","uric acid","An oxopurine that is the final oxidation product of purine metabolism."],["http://purl.obolibrary.org/obo/CHEBI_27732","caffeine","A trimethylxanthine in which the three methyl groups are located at positions 1, 3, and 7. A purine alkaloid that occurs naturally in some organisms, including tea and coffee."],["http://purl.obolibrary.org/obo/CHEBI_28822","eicosanoic acid",""],["http://purl.obolibrary.org/obo/CHEBI_28842","octadecanoic acid",""],["http://purl.obolibrary.org/obo/CHEBI_28866","tetracosanoic acid",""],["http://purl.obolibrary.org/obo/CHEBI_28875","tetradecanoic acid",""],["http://purl.obolibrary.org/obo/CHEBI_28941","docosanoic acid",""],["http://purl.obolibrary.org/obo/CHEBI_30805","dodecanoic acid",""],["http://purl.obolibrary.org/obo/CHEBI_30813","decanoic acid",""],["http://purl.obolibrary.org/obo/CHEBI_31009","hexacosanoic acid",""],["http://purl.obolibrary.org/obo/CHEBI_32365","heptadecanoic acid",""],["http://purl.obolibrary.org/obo/CHEBI_32368","undecanoic acid",""],["http://purl.obolibrary.org/obo/CHEBI_32583","calcium sulfate dihydrate","CaH4O6S"],["http://purl.obolibrary.org/obo/CHEBI_32584","calcium sulfate hemihydrate","Ca2H2S2O9"],["http://purl.obolibrary.org/obo/CHEBI_3311","calcium carbonate","A carbonate salt that has formula CO3Ca"],["http://purl.obolibrary.org/obo/CHEBI_33292","fuel","An energy-rich substance that can be transformed with release of usable energy."],["http://purl.obolibrary.org/obo/CHEBI_37958","dye","colorant, tincture. Product meant for imparting color"],["http://purl.obolibrary.org/obo/CHEBI_39246","nonadecanoic acid",""],["http://purl.obolibrary.org/obo/CHEBI_42504","pentadecanoic acid",""],["http://purl.obolibrary.org/obo/CHEBI_43722","isotetradecanoic acid",""],["http://purl.obolibrary.org/obo/CHEBI_45919","tridecanoic acid",""],["http://purl.obolibrary.org/obo/CHEBI_46713","fluorite",""],["http://purl.obolibrary.org/obo/CHEBI_46719","calcite","Calcium carbonate (CO3Ca), calcite structure"],["http://purl.obolibrary.org/obo/CHEBI_52239","aragonite","Calcium carbonate (CO3Ca), aragonite structure"],["http://purl.obolibrary.org/obo/CHEBI_52241","vaterite",""],["http://purl.obolibrary.org/obo/CHEBI_52254","apatite","A phosphate mineral with the general formula Ca5(PO4)3X where X = OH, F or Cl"],["http://purl.obolibrary.org/obo/CHEBI_52255","hydroxylapatite","A phosphate mineral with the formula Ca5(PO4)3(OH)."],["http://purl.obolibrary.org/obo/CHEBI_64389","biogenic silica","A biogenic mineral comprised of hydrated silica"],["http://purl.obolibrary.org/obo/CHEBI_64857","cosmetics","The role played by a substance in enhancing the appearance or odour of the human body; a name given to the substance itself or to a component of it."],["http://purl.obolibrary.org/obo/CHEBI_77635","calcium phosphate","A calcium salt composed of calcium and phosphate/diphosohate ions; present in milk and used for the mineralisation of calcified tissues."],["http://purl.obolibrary.org/obo/CHEBI_84890","isohexadecanoic acid",""],["http://purl.obolibrary.org/obo/CMO_0000013","body length","A measurement of the longest dimension of a body, typically between two distinct ends of the body. "],["http://purl.obolibrary.org/obo/CMO_0000078","body length, nose to tail","The distance between the tip of the nose to the very end of the appendage extending from the end of the trunk of an organism"],["http://purl.obolibrary.org/obo/CMO_0000445","teat number","The number of teats, protuberances on the mammary glands, breasts or udders of female mammals through which milk is excreted."],["http://purl.obolibrary.org/obo/CMO_0000790","milk solids",""],["http://purl.obolibrary.org/obo/CMO_0000826","milk lipids",""],["http://purl.obolibrary.org/obo/ECOCORE_00000078","crepuscular","active primarily during dawn and dusk"],["http://purl.obolibrary.org/obo/ECOCORE_00000130","photoautotroph","An autotroph which is capable of transforming light into chemical energy."],["http://purl.obolibrary.org/obo/ECOCORE_00000131","photoheterotroph","A heterotroph which is capable of transforming light into chemical energy."],["http://purl.obolibrary.org/obo/ENVO_00000002","anthropogenic","a geographic feature resulting from the influence of human beings on nature."],["http://purl.obolibrary.org/obo/ENVO_00000013","cave system","A collection of caves interconnected by enterable passages or linked hydrologically or a cave with an extensive complex of chambers and passages."],["http://purl.obolibrary.org/obo/ENVO_00000014","canal","Artificial watercourse with no flow or a controlled flow used for navigation, drainage or irrigation."],["http://purl.obolibrary.org/obo/ENVO_00000016","sea","A large expanse of saline water usually connected with an ocean."],["http://purl.obolibrary.org/obo/ENVO_00000018","dry river","A river that has either permanently or temporally lost its water."],["http://purl.obolibrary.org/obo/ENVO_00000019","saline lake","A lake whose water contains a considerable concentration of dissolved salts."],["http://purl.obolibrary.org/obo/ENVO_00000025","reservoir","An artificial body of water, often contained by a dam, constructed for the purpose of water storage."],["http://purl.obolibrary.org/obo/ENVO_00000026","well","A cylindrical hole, pit, or tunnel drilled or dug down to a depth from which water, oil, or gas can be pumped or brought to the surface."],["http://purl.obolibrary.org/obo/ENVO_00000028","sand pit quarry","A quarry from which sand is extracted."],["http://purl.obolibrary.org/obo/ENVO_00000031","wadi","A valley or ravine, bounded by relatively steep banks, which in the rainy season becomes a watercourse."],["http://purl.obolibrary.org/obo/ENVO_00000032","bay","An area of water bordered by land on three sides."],["http://purl.obolibrary.org/obo/ENVO_00000033","pond","A body of water, usually of smaller size than a lake."],["http://purl.obolibrary.org/obo/ENVO_00000034","rapids","An area of broken, fast flowing water in a stream, where the slope of the bed increases (but without a prominent break of slope which might result in a waterfall), or where a gently dipping bar of harder rock outcrops."],["http://purl.obolibrary.org/obo/ENVO_00000035","marsh","A wetland, featuring grasses, rushes, reeds, typhas, sedges, and other herbaceous plants (possibly with low-growing woody plants) in a context of shallow water."],["http://purl.obolibrary.org/obo/ENVO_00000036","irrigation canal","Artificial watercourse with no flow or a controlled flow used irrigation."],["http://purl.obolibrary.org/obo/ENVO_00000037","ditch","A small artificial watercourse dug for draining or irrigating the land."],["http://purl.obolibrary.org/obo/ENVO_00000038","lagoon","A sheet of saline water separated from the open sea by sand or shingle banks. The sheet of water between an offshore reef, especially of coral and mainland. The sheet of water within a ring or horseshoe shaped atoll."],["http://purl.obolibrary.org/obo/ENVO_00000039","fjord","A long and narrow sea inlet with high steeply sloped walled sides. A fjord is a landform created during a period of glaciation."],["http://purl.obolibrary.org/obo/ENVO_00000040","waterfall","A sudden descent of water over a step or ledge in the bed of a river."],["http://purl.obolibrary.org/obo/ENVO_00000041","tidal creek","A tidal water channel. Creeks may often dry to a muddy channel with little or no flow at low tide, but often with significant depth of water at high tide."],["http://purl.obolibrary.org/obo/ENVO_00000042","drainage canal","Artificial watercourse with no flow or a controlled flow used drainage."],["http://purl.obolibrary.org/obo/ENVO_00000043","wetland","An area that is inundated or saturated by surface or ground water at a frequency and duration sufficient to support, and that under normal circumstances do support, a prevalence of vegetation typically adapted for life in saturated soil conditions."],["http://purl.obolibrary.org/obo/ENVO_00000044","peatland","A wetland type that accumulates acidic peat, a deposit of dead plant material."],["http://purl.obolibrary.org/obo/ENVO_00000046","hedge","A dense growth of shrubbery planted as a fence or boundary."],["http://purl.obolibrary.org/obo/ENVO_00000051","hot spring","A spring that is produced by the emergence of geothermally-heated groundwater from the Earth's crust."],["http://purl.obolibrary.org/obo/ENVO_00000052","crater lake","A lake contained within a volcanic crater."],["http://purl.obolibrary.org/obo/ENVO_00000053","freshwater marsh","A marsh associated with water that contains low concentrations of salts."],["http://purl.obolibrary.org/obo/ENVO_00000055","saline evaporation pond","A shallow man-made pond designed to produce salt from sea water. The seawater is fed into large ponds and water is drawn out through natural evaporation which allows the salt to be subsequently harvested."],["http://purl.obolibrary.org/obo/ENVO_00000058","underground lake","A lake which is formed under the surface of the Earth. Such a lake may be associated with caves and aquifers and springs."],["http://purl.obolibrary.org/obo/ENVO_00000059","underground river","A river that is under the surface of the Earth."],["http://purl.obolibrary.org/obo/ENVO_00000060","underground stream","A stream that is under the surface of the Earth."],["http://purl.obolibrary.org/obo/ENVO_00000061","underground water body","A geographical feature associated with water that is under the surface of the earth."],["http://purl.obolibrary.org/obo/ENVO_00000065","railway","A permanent way having one or more rails which provides a track for cars."],["http://purl.obolibrary.org/obo/ENVO_00000067","cave","Naturally formed, subterranean open area or chamber."],["http://purl.obolibrary.org/obo/ENVO_00000068","tunnel","An underground or underwater passage."],["http://purl.obolibrary.org/obo/ENVO_00000069","distributary","A stream that branches off and flows away from a main stream channel. They are a common feature of river deltas."],["http://purl.obolibrary.org/obo/ENVO_00000072","aquaduct","Structure designed to transport water from a remote source, usually by gravity."],["http://purl.obolibrary.org/obo/ENVO_00000073","building","A permanent walled and roofed construction."],["http://purl.obolibrary.org/obo/ENVO_00000077","agricultural",""],["http://purl.obolibrary.org/obo/ENVO_00000078","farm","A tract of crop or grazing land, as well as the group of buildings with and often surrounding a farmhouse, including barns, sheds, and other outbuildings, used for agricultural production."],["http://purl.obolibrary.org/obo/ENVO_00000079","flume","An open artificial water channel, that leads water from a diversion dam or weir completely aside a natural flow, often an elevated box structure (typically wood) that follows the natural contours of the land."],["http://purl.obolibrary.org/obo/ENVO_00000080","mountain range","A series of connected and aligned mountains or mountain ridges."],["http://purl.obolibrary.org/obo/ENVO_00000081","mountain","A landform that extends above the surrounding terrain in a limited area. A mountain is generally steeper than a hill, but there is no universally accepted standard definition for the height of a mountain or a hill although a mountain usually has an identifiable summit and a local relief of more than 300m."],["http://purl.obolibrary.org/obo/ENVO_00000082","hill range","A group of hills bordered by lowlands."],["http://purl.obolibrary.org/obo/ENVO_00000083","hill","A rounded elevation of limited extent rising above the surrounding land with local relief of less than 300m."],["http://purl.obolibrary.org/obo/ENVO_00000084","mountain pass","A lower point that allows easier access through a mountain range. A pass has the general form of a saddle between two mountains."],["http://purl.obolibrary.org/obo/ENVO_00000085","alpine glacier","A glacier found in mountain terrain."],["http://purl.obolibrary.org/obo/ENVO_00000087","cliff","A high, steep, or overhanging face of rock."],["http://purl.obolibrary.org/obo/ENVO_00000088","sea cliff","A cliff that is a margin of a sea or ocean."],["http://purl.obolibrary.org/obo/ENVO_00000089","inland cliff",""],["http://purl.obolibrary.org/obo/ENVO_00000090","coastal plain","An area of flat, low-lying land adjacent to a seacoast and separated from the interior by other features."],["http://purl.obolibrary.org/obo/ENVO_00000091","beach","A landform consisting of loose rock particles such as sand, gravel, shingle, pebbles, cobble, or even shell fragments along the shoreline of a body of water."],["http://purl.obolibrary.org/obo/ENVO_00000095","lava field","A feature formed by cooled lava, the molten rock that is expelled by a volcano during an eruption."],["http://purl.obolibrary.org/obo/ENVO_00000096","caldera","A feature formed by the collapse of land following a volcanic eruption."],["http://purl.obolibrary.org/obo/ENVO_00000100","valley","A depression caused by erosion by water or ice. Low-lying land bordered by higher ground; especially elongate, relatively large gently sloping depressions of the Earth's surface, commonly situated between two mountains or between ranges of hills or mountains, and often containing a stream with an outlet."],["http://purl.obolibrary.org/obo/ENVO_00000101","delta","A tract of alluvium formed at the mouth of a river where the deposition ofsome of its load exceeds its rate of removal, crossed by the divergent channels (distributaries) of the river."],["http://purl.obolibrary.org/obo/ENVO_00000102","cave entrance",""],["http://purl.obolibrary.org/obo/ENVO_00000105","lake surface",""],["http://purl.obolibrary.org/obo/ENVO_00000107","heath","An upland moor or sandy area dominated by low shrubby vegetation including heather."],["http://purl.obolibrary.org/obo/ENVO_00000108","meadow","A habitat of rolling or flat terrain where grasses predominate. Typically, what is called a meadow has more biodiversity than a grassland as the former contains not only grasses but a significant variety of annual, biennial and perennial plants."],["http://purl.obolibrary.org/obo/ENVO_00000110","lava tunnel","A tunnel formed by the flow of molten lava, which has subsequently drained out."],["http://purl.obolibrary.org/obo/ENVO_00000115","orchard","An intentional planting of trees or shrubs maintained for food, typically fruit, production."],["http://purl.obolibrary.org/obo/ENVO_00000116","vineyard","A place where grapes are grown for making wine, raisins or table grapes."],["http://purl.obolibrary.org/obo/ENVO_00000117","plantation","An intentional planting of a crop, on a large scale, usually for uses other than cereal production or pasture. The term is currently most often used for plantings of trees and shrubs. The term tends also to be used for plantings maintained on economic bases other than that of subsistence farming."],["http://purl.obolibrary.org/obo/ENVO_00000118","coconut plantation",""],["http://purl.obolibrary.org/obo/ENVO_00000119","planted forest","A forest that has been intentionally established by human intervention."],["http://purl.obolibrary.org/obo/ENVO_00000120","oil palm plantation",""],["http://purl.obolibrary.org/obo/ENVO_00000125","mineral spring","A spring whose water contains a significant amount of dissolved minerals, that derive from the rocks through which the water flows."],["http://purl.obolibrary.org/obo/ENVO_00000126","sulfur spring","A spring whose water contains a significant amount of dissolved derivatives of sulfur."],["http://purl.obolibrary.org/obo/ENVO_00000127","badland","An arid terrain with clay-rich soil that has been extensively eroded by wind and water."],["http://purl.obolibrary.org/obo/ENVO_00000128","dry valley","A valley that no longer has a surface flow of water. Typically found in either Karst (limestone) or chalk terrain."],["http://purl.obolibrary.org/obo/ENVO_00000129","stream valley","A valley that contains, and has been formed by, a stream."],["http://purl.obolibrary.org/obo/ENVO_00000132","ice sheet","A mass of glacier ice that covers surrounding terrain and is greater than 50,000 km2."],["http://purl.obolibrary.org/obo/ENVO_00000133","glacier","A large, slow moving river of ice, formed from compacted layers of snow, that slowly deforms and flows in response to gravity."],["http://purl.obolibrary.org/obo/ENVO_00000137","coastal inlet","An opening of the sea into the land."],["http://purl.obolibrary.org/obo/ENVO_00000139","irrigation ditch","A ditch that supplies water to surrounding land."],["http://purl.obolibrary.org/obo/ENVO_00000140","drainage ditch","A ditch that collects water from the surrounding land."],["http://purl.obolibrary.org/obo/ENVO_00000142","stream bank","The sloping margin of a stream, serving to confine it to its natural channel."],["http://purl.obolibrary.org/obo/ENVO_00000143","river bank","The sloping margin of a river, serving to confine it to its natural channel."],["http://purl.obolibrary.org/obo/ENVO_00000145","ice cap","A dome-shaped ice mass that covers less than 50,000 km2 of land area (usually covering a highland area)."],["http://purl.obolibrary.org/obo/ENVO_00000146","snow field","A region of permanent snow in mountainous areas or high latitudes."],["http://purl.obolibrary.org/obo/ENVO_00000148","riffle","A shallow stretch of a river or stream, where the current is above the average stream velocity and where the water forms small rippled waves as a result. It often consists of a rocky bed of gravels or other small stones."],["http://purl.obolibrary.org/obo/ENVO_00000151","sabkha","An alkaline flat, in the context of a marine environment."],["http://purl.obolibrary.org/obo/ENVO_00000152","anabranch","A section of a river or stream that diverts from the main course and rejoins later."],["http://purl.obolibrary.org/obo/ENVO_00000153","headwater","The upper part of a river system, denoting the upper basin and source streams of a river."],["http://purl.obolibrary.org/obo/ENVO_00000154","flood meadow","An area of grassland or pasture beside a river, subject to seasonal flooding."],["http://purl.obolibrary.org/obo/ENVO_00000155","cirque","A deep natural hollow near the crest of a mountain, usually formed by a glacier."],["http://purl.obolibrary.org/obo/ENVO_00000156","desert oasis","A small, isolated, fertile or green area in a desert region, usually having a spring or well."],["http://purl.obolibrary.org/obo/ENVO_00000157","peat cut","An artificial working of peatland to remove the peat."],["http://purl.obolibrary.org/obo/ENVO_00000159","sugar plantation",""],["http://purl.obolibrary.org/obo/ENVO_00000161","banana plantation",""],["http://purl.obolibrary.org/obo/ENVO_00000162","tea plantation",""],["http://purl.obolibrary.org/obo/ENVO_00000163","coffee plantation",""],["http://purl.obolibrary.org/obo/ENVO_00000164","rubber plantation",""],["http://purl.obolibrary.org/obo/ENVO_00000166","atoll","An oceanic island, often having a characteristic ring-like shape surrounding a lagoon. Atolls are formed when coral reef grows around a volcanic island that later subsides into the ocean."],["http://purl.obolibrary.org/obo/ENVO_00000167","bar","A linear shoaling landform feature within a body of water. Bars tend to be long and narrow (linear) and develop where a current (or waves) promote deposition of granular material, resulting in localized shallowing (shoaling) of the water. Bars can appear in the sea, in a lake, or in a river. They are typically composed of sand, although could be of any granular matter that the moving water has access to and is capable of shifting around (for example, soil, silt, gravel, cobble, shingle, or even boulders). The grain size of the material comprising a bar is related: to the size of the waves or the strength of the currents moving the material, but the availability of material to be worked by waves and currents is also important."],["http://purl.obolibrary.org/obo/ENVO_00000169","canyon","Relatively narrow, deep depression with steep sides, the bottom of which generally has a continuous slope."],["http://purl.obolibrary.org/obo/ENVO_00000170","dune","A hill of sand built by eolian processes."],["http://purl.obolibrary.org/obo/ENVO_00000171","river valley","A valley that contains, and has been formed by, a river."],["http://purl.obolibrary.org/obo/ENVO_00000172","sandy desert",""],["http://purl.obolibrary.org/obo/ENVO_00000173","rocky desert",""],["http://purl.obolibrary.org/obo/ENVO_00000175","karst","A feature shaped by the dissolution of a soluble layer or layers of bedrock, usually carbonate rock such as limestone or dolomite. These landscapes display distinctive surface features and underground drainages, and in some examples there may be little or no surface drainage."],["http://purl.obolibrary.org/obo/ENVO_00000176","elevated","A landform elevated above the surrounding area."],["http://purl.obolibrary.org/obo/ENVO_00000177","moraine","An accumulation of boulders, stones, or other debris carried and deposited by a glacier."],["http://purl.obolibrary.org/obo/ENVO_00000179","mesa","An elevated area of land with a flat top and sides that are usually steep cliffs. Mesas form in areas where horizontally layered rocks are uplifted by tectonic activity."],["http://purl.obolibrary.org/obo/ENVO_00000181","nunatak","The exposed summit of a ridge, mountain, or peak not covered with ice or snow within an ice field or glacier. The term is typically used in areas where a permanent ice mass is present."],["http://purl.obolibrary.org/obo/ENVO_00000182","plateau","An elevated and comparatively level expanse of land."],["http://purl.obolibrary.org/obo/ENVO_00000183","stony desert","A desert plain characterized by a surface veneer of gravel or stones."],["http://purl.obolibrary.org/obo/ENVO_00000184","hanging valley","A tributary valley with the floor at a higher relief than the main channel into which it flows. They are most commonly associated with U-shaped valleys when a tributary glacier flows into a glacier of larger volume."],["http://purl.obolibrary.org/obo/ENVO_00000185","raised mire","Rain-fed, potentially deep peatlands occurring principally in lowland areas across much of Northern Europe, as well as in the former USSR, North America and parts of the southern hemisphere."],["http://purl.obolibrary.org/obo/ENVO_00000186","string mire","Flat or concave peatlands with a string-like pattern of hummocks (hence the name), found principally in northern Scandinavia but occurring in the western parts of the former USSR and in North America. A few examples exist in northern Britain."],["http://purl.obolibrary.org/obo/ENVO_00000189","peat swamp","Forested peatlands including both rain- and groundwater-fed types, commonly recorded in tropical regions with high rainfall. This type of peatland covers around 350,000 km2, primarily in south-east Asia but also occurring in the Everglades in Florida."],["http://purl.obolibrary.org/obo/ENVO_00000192","mudflat","A wetland that forms when mud is deposited by the tides, rivers, sea or oceans."],["http://purl.obolibrary.org/obo/ENVO_00000193","olive grove",""],["http://purl.obolibrary.org/obo/ENVO_00000194","scree","Broken rock that appears at the bottom of crags, mountain cliffs or valley shoulders."],["http://purl.obolibrary.org/obo/ENVO_00000195","sinkhole","A natural depression or hole in the surface topography caused by the removal of soil or bedrock, often both, by water. Sinkholes may vary in size from less than a meter to several hundred meters both in diameter and depth, and vary in form from soil-lined bowls to bedrock-edged chasms."],["http://purl.obolibrary.org/obo/ENVO_00000196","alkaline flat","A dry lakebead consisting of fine-grained sediments infused with alkali salts. Generally the shore or bed of an endorheic lake."],["http://purl.obolibrary.org/obo/ENVO_00000199","meromictic lake","A lake which has layers of water which do not intermix. The deepest layer of water in such a lake does not contain any dissolved oxygen. The layers of sediment at the bottom of a meromictic lake remain relatively undisturbed because there are no living organisms to stir them up."],["http://purl.obolibrary.org/obo/ENVO_00000202","oxbow lake","A lake which is formed when a wide meander from a stream or a river is cut off to form a lake. They are called oxbow lakes due to the distinctive curved shape that results from this process."],["http://purl.obolibrary.org/obo/ENVO_00000203","rift lake","A lake which forms as a result of subsidence along a geological fault in the Earth's tectonic plates."],["http://purl.obolibrary.org/obo/ENVO_00000205","permanent spring","A spring whose flow is continuous."],["http://purl.obolibrary.org/obo/ENVO_00000206","neritic zone","The water mass of an ocean directly above a continental shelf."],["http://purl.obolibrary.org/obo/ENVO_00000207","oceanic zone","The water mass of an ocean that is not above a continental shelf."],["http://purl.obolibrary.org/obo/ENVO_00000208","pelagic zone","An open ocean region."],["http://purl.obolibrary.org/obo/ENVO_00000209","photic zone","The zone of an ocean from the surface to 200m where photosynthesis can occur, due to the penetration of light."],["http://purl.obolibrary.org/obo/ENVO_00000211","bathypelagic zone","The one of an ocean below the 10degC thermocline down to a temperature of 4degC."],["http://purl.obolibrary.org/obo/ENVO_00000212","abyssalpelagic zone","The zone of the ocean below the bathypelagic zone, with its lowest boundary at about 6000m."],["http://purl.obolibrary.org/obo/ENVO_00000213","mesopelagic zone","The zone of an ocean immediately below the photic zone down to a depth where the water temperature is 10degC (the thermocline)."],["http://purl.obolibrary.org/obo/ENVO_00000216","fumarole","A hole in the Earth's crust from which steam and gases are emitted."],["http://purl.obolibrary.org/obo/ENVO_00000217","solfatara","A fumarole that emits sulfurous gases."],["http://purl.obolibrary.org/obo/ENVO_00000219","landlocked sea","A sea that is not connected with an ocean."],["http://purl.obolibrary.org/obo/ENVO_00000221","continental island","An island that lies on a continental shelf."],["http://purl.obolibrary.org/obo/ENVO_00000222","oceanic island","An island that does not sit on a continental shelf, and is of volcanic origin."],["http://purl.obolibrary.org/obo/ENVO_00000230","coastal wetland","A wetland associated with the part of the land adjoining or near a sea or ocean."],["http://purl.obolibrary.org/obo/ENVO_00000231","moor","A wetland found in upland areas, characterised by acidic soils."],["http://purl.obolibrary.org/obo/ENVO_00000232","fen","A freshwater peat land with chemically basic (which roughly means alkaline) ground water."],["http://purl.obolibrary.org/obo/ENVO_00000233","swamp","A wetland that features permanent inundation of large areas of land by shallow bodies of water, generally with a substantial number of hummocks, or dry-land protrusions."],["http://purl.obolibrary.org/obo/ENVO_00000234","bayou","A small, slow-moving stream or creek; usually located in low-lying areas."],["http://purl.obolibrary.org/obo/ENVO_00000235","carr","A fen which has developed to the point where it supports trees."],["http://purl.obolibrary.org/obo/ENVO_00000236","dambo","A class of complex shallow wetlands in central, southern and eastern Africa, particularly in Zambia and Zimbabwe. They are generally found in higher rainfall flat plateau areas, and have river-like branching forms which may be nowhere very large, but common enough to add up to a large area."],["http://purl.obolibrary.org/obo/ENVO_00000243","freshwater wetland","A wetland whose water that contains low concentrations of salts."],["http://purl.obolibrary.org/obo/ENVO_00000245","maar","A broad, low relief crater that results from a phreatic eruption or explosion caused by groundwater contact with hot lava or magma. The maar typically fills with water to form a relatively shallow crater lake."],["http://purl.obolibrary.org/obo/ENVO_00000246","volcanic crater","A crater formed by a volcano, within which occurs a vent (or vents) from which magma erupts as gases, lava, and ejecta."],["http://purl.obolibrary.org/obo/ENVO_00000247","volcano","An opening, or rupture, in the Earth's surface or crust, which allows hot, molten rock, ash and gases to escape from deep below the surface."],["http://purl.obolibrary.org/obo/ENVO_00000248","glacial valley","A valley that contains, or contained, a glacier and was formed by glacial activity. Typically U-shaped in cross-section."],["http://purl.obolibrary.org/obo/ENVO_00000249","lateral moraine","The parallel ridges of till deposited along the sides of an alglacier. The unconsolidated debris is deposited on top of the glacier by frost shattering of the valley walls and from tributary streams flowing into the valley. The till is carried along the glacial margin until the glacier melts."],["http://purl.obolibrary.org/obo/ENVO_00000252","terminal moraine","Ridges of unconsolidated debris deposited at the snout or end of the glacier. They usually reflect the shape of the glacier's terminus."],["http://purl.obolibrary.org/obo/ENVO_00000255","flood plain","An area which is subject to periodic flooding."],["http://purl.obolibrary.org/obo/ENVO_00000256","floodway","The stream channel and adjacent areas that carry flood flows in a flood plain."],["http://purl.obolibrary.org/obo/ENVO_00000258","alluvial plain","A relatively flat and gently sloping landform found at the base of a range of hills or mountains, formed by the deposition of alluvial soil over a long period of time by one or more streams coming from the mountains."],["http://purl.obolibrary.org/obo/ENVO_00000260","prairie","An area of land of low topographic relief that historically supported grasses and herbs, with few trees, and having generally a mesic (moderate or temperate) climate. Dominated by tall grasses (contrast steppe)."],["http://purl.obolibrary.org/obo/ENVO_00000262","steppe","A plain without trees (apart from those near rivers and lakes); it is similar to a prairie, although a prairie is generally considered as being dominated by tall grasses, while short grasses are said to be normal in the steppe. It may be semi-desert, or covered with grass or shrubs or both, depending on the season and latitude."],["http://purl.obolibrary.org/obo/ENVO_00000263","fissure cave","A narrow, verical cave passage, often developed along a joint but not necessarily so. Usually due to solution but sometimes to tension."],["http://purl.obolibrary.org/obo/ENVO_00000264","seamount","A mountain rising from the ocean seafloor that does not reach to the water's surface (sea level), and thus is not an island. Typically formed from volcanoes that rise abruptly and are usually found rising from a seafloor of 1,000 - 4,000 meters depth."],["http://purl.obolibrary.org/obo/ENVO_00000265","guyot","A flat-topped seamount."],["http://purl.obolibrary.org/obo/ENVO_00000266","pasture","Grassland used for grazing of ungulate livestock as part of a farm or ranch."],["http://purl.obolibrary.org/obo/ENVO_00000267","submarine canyon","A steep-sided valley on the sea floor of the continental slope. Many submarine canyons are found as extensions to large rivers; however there are many that have no such association. Canyons cutting the continental slopes have been found at depths greater than 2 km below sea level. Many submarine canyons continue as submarine channels across continental rise areas and may extend for hundreds of kilometers."],["http://purl.obolibrary.org/obo/ENVO_00000268","lake bed","The ground surface that lies beneath a lake."],["http://purl.obolibrary.org/obo/ENVO_00000270","beaver pond","A pond that has formed as a consequence of the activities of beavers, building a beaver dam."],["http://purl.obolibrary.org/obo/ENVO_00000271","chott","A dry (salt) lake in the Saharan area of Africa that stays dry in the summer, but receive some water in the winter. This water may come as a groundwater discharge."],["http://purl.obolibrary.org/obo/ENVO_00000277","dry lake","A lake that has either permanently or temporally lost its water."],["http://purl.obolibrary.org/obo/ENVO_00000278","dry stream","A stream that has either permanently or temporally lost its water."],["http://purl.obolibrary.org/obo/ENVO_00000279","saline pan","A flat expanse of ground covered with salt and other minerals, usually shining white under the sun. A salt pan is formed where water pools. A saline pan would be a lake or a pond if it were located in a climate where the rate of water evaporation were not faster than the rate of water precipitation, i.e., if it were not in a desert. If the water is unable to drain into the ground, it remains on the surface until it evaporates, leaving behind whatever minerals were dissolved. Over thousands of years, the minerals (usually salts) accumulate on the surface."],["http://purl.obolibrary.org/obo/ENVO_00000280","escarpment","A transition zone between different physiogeographic provinces that involves an elevation differential, often involving high cliffs. Most commonly a transition from one series of sedimentary rocks to another series of a different age and composition. In such cases, the escarpment usually represents the line of erosional loss of the newer rock over the older."],["http://purl.obolibrary.org/obo/ENVO_00000282","esker","A long, winding ridge of stratified sand and gravel which occur in glaciated and formerly glaciated regions of Europe and North America."],["http://purl.obolibrary.org/obo/ENVO_00000283","ridge","A long and narrow upland with steep sides."],["http://purl.obolibrary.org/obo/ENVO_00000284","quarry","An open-pit mine from which rock or minerals are extracted."],["http://purl.obolibrary.org/obo/ENVO_00000287","butte","An isolated hill with steep sides and a small flat top, smaller than mesas and plateaus. Buttes are formed by erosion when a cap of hard rock, usually of volcanic origin, covers a layer of softer rock that is easily worn away. This hard rock avoids erosion while the rock around it wears down."],["http://purl.obolibrary.org/obo/ENVO_00000288","cotton plantation",""],["http://purl.obolibrary.org/obo/ENVO_00000290","graben","A depressed block of land bordered by parallel faults. A graben is the result of a block of land being downthrown producing a valley with a distinct scarp on each side. Grabens often occur side-by-side with horsts. Horst and graben structures are indicative of tensional forces and crustal stretching."],["http://purl.obolibrary.org/obo/ENVO_00000296","rice field","A paddy field for the cultivation of rice."],["http://purl.obolibrary.org/obo/ENVO_00000297","paddy field","A flooded parcel of arable land used for growing rice and other semiaquatic crops."],["http://purl.obolibrary.org/obo/ENVO_00000298","iceberg","A large mass of detached land ice in the sea or stranded in shallow water."],["http://purl.obolibrary.org/obo/ENVO_00000300","scrubland","Area covered with low-growing or stunted perennial vegetation and usually not mixed with trees."],["http://purl.obolibrary.org/obo/ENVO_00000301","chaparral","A shrubland area found primarily in regions with a Mediterranean climate (mid, wet winters and hot dry summers) often shaped by wildfires."],["http://purl.obolibrary.org/obo/ENVO_00000303","coastal land","The general region of indefinite width that extends from the sea inland to the first major change in terrain features."],["http://purl.obolibrary.org/obo/ENVO_00000308","dune slack","A valley or trough between two dunes."],["http://purl.obolibrary.org/obo/ENVO_00000310","impact crater","A crater caused by the impact of a meteor."],["http://purl.obolibrary.org/obo/ENVO_00000313","blowout","A sandy depression in a sand dune ecosystem (psammosere) caused by the removal of sediments by wind."],["http://purl.obolibrary.org/obo/ENVO_00000316","intertidal zone","The area of the foreshore and seabed that is exposed to the air at low tide and submerged at high tide, i.e., the area between tide marks."],["http://purl.obolibrary.org/obo/ENVO_00000317","tidal pool","Pools formed as a high tide comes in over a rocky shore. Water fills depressions in the ground, which turn into isolated pools as the tide retreats."],["http://purl.obolibrary.org/obo/ENVO_00000319","low tide zone","The tidal zone that is mostly submerged, only being exposed at the point of low tide and for a longer period of time during extremely low tides."],["http://purl.obolibrary.org/obo/ENVO_00000322","lava cave","A cave in a lava flow."],["http://purl.obolibrary.org/obo/ENVO_00000325","polje","A large closed depression draining underground, witha flat floor across which there may be an intermittent or perennial stream and which may be liable to flood and become a lake. The floor makes a sharp break with parts of surrounding slopes."],["http://purl.obolibrary.org/obo/ENVO_00000326","sea cave","A cave in present-day or emerged sea cliffs, formed by wave attack or solution."],["http://purl.obolibrary.org/obo/ENVO_00000327","speleothem","A secondary mineral deposit formed in caves, most commonly calcite."],["http://purl.obolibrary.org/obo/ENVO_00000329","phreatic zone","Zone where voids in the rock are completely filled."],["http://purl.obolibrary.org/obo/ENVO_00000332","doline","A closed depression draining underground in karst, ofsimple but variable form, e.g. cylindrical, conical, bowl- or dish-shaped. From a few to many hundreds of metres in dimensions."],["http://purl.obolibrary.org/obo/ENVO_00000351","volcanic arc","A chain of volcanic islands or mountains formed by plate tectonics as an oceanic tectonic plate subducts under another tectonic plate and produces magma."],["http://purl.obolibrary.org/obo/ENVO_00000354","volcanic field","A region of the earth's crust that is prone to localized volcanic activity."],["http://purl.obolibrary.org/obo/ENVO_00000362","marine park","A protected area of the sea usually established to preserve a specific habitat and ensure the ecosystem is sustained for the organisms that exist there. Most marine parks are designated by governments, and organized like watery national parks."],["http://purl.obolibrary.org/obo/ENVO_00000365","ramsar site","A wetland protected by the terms of the Ramsar Convention (The Convention on Wetlands of International Importance, especially as Waterfowl Habitat)."],["http://purl.obolibrary.org/obo/ENVO_00000370","tuya","A distinctive, flat-topped, steep-sided volcano formed when lava erupts through a thick glacier or ice sheet."],["http://purl.obolibrary.org/obo/ENVO_00000380","ice shelf","A thick, floating platform of ice that forms where a glacier or ice mass flows down to a coastline and onto the ocean surface."],["http://purl.obolibrary.org/obo/ENVO_00000381","massif","A section of the Earths's crust that is demarcated by faults or flexures. In the movement of the crust, a massif tends to retain its internal structure while being displaced as a whole."],["http://purl.obolibrary.org/obo/ENVO_00000382","lake shore","That part of the land in immediate contact with a lake."],["http://purl.obolibrary.org/obo/ENVO_00000383","stream bed","The channel bottom of a stream; the physical confine of the normal water flow."],["http://purl.obolibrary.org/obo/ENVO_00000384","river bed","The channel bottom of a river; the physical confine of the normal water flow."],["http://purl.obolibrary.org/obo/ENVO_00000385","stream mouth","The place where a stream discharges into a lagoon, lake, or the sea."],["http://purl.obolibrary.org/obo/ENVO_00000386","river mouth","The end of a stream where it enters a standing water body such as a lake, sea or ocean."],["http://purl.obolibrary.org/obo/ENVO_00000387","intermittent lake","A lake that is not permanently filled with water, at times being dry."],["http://purl.obolibrary.org/obo/ENVO_00000389","intermittent wetland","An area that is sometimes inundated or saturated by surface or ground water sufficient to support, and that under normal circumstances do support, a prevalence of vegetation typically adapted for life in saturated soil conditions."],["http://purl.obolibrary.org/obo/ENVO_00000392","ice tongue","A long and narrow sheet of ice projecting out from the coastline. An ice tongue forms when a valley glacier moves very rapidly out into the ocean or a lake."],["http://purl.obolibrary.org/obo/ENVO_00000395","channel","The physical confine of a river, slough or ocean strait consisting of a bed and banks."],["http://purl.obolibrary.org/obo/ENVO_00000398","volcanic cone","Built by fragments (called ejecta) thrown up (ejected) from a volcanic vent, piling up around the vent in the shape of a cone with a central crater."],["http://purl.obolibrary.org/obo/ENVO_00000400","cinder cone","A cone built almost entirely of loose volcanic fragments called cinders (pumice, pyroclastics, or tephra). They are built from particles and blobs of congealed lava ejected from a single vent. As the gas-charged lava is blown violently into the air, it breaks into small fragments that solidify and fall as cinders around the vent to form a circular or oval cone. Most cinder cones have a bowl-shaped crater at the summit."],["http://purl.obolibrary.org/obo/ENVO_00000402","mud volcano","A volcano created by geologically excreted liquids and gases, although there are several different processes which may cause such activity. Temperatures are much cooler than igneous processes."],["http://purl.obolibrary.org/obo/ENVO_00000406","mid-ocean ridge","An underwater mountain range, formed by plate tectonics. This uplifting of the ocean floor occurs when convection currents rise in the mantle beneath the oceanic crust and create magma where two tectonic plates meet at a divergent boundary. The mid-ocean ridges of the world are connected and form a single global mid-oceanic ridge system that is part of every ocean."],["http://purl.obolibrary.org/obo/ENVO_00000410","kipuka","An elevated area such as a hill, ridge or old lava dome inside or downslope from an area of active volcanism. New lava flows will cover the surrounding land, isolating the kipuka so that it appears as a (usually) forested island in a barren lava flow."],["http://purl.obolibrary.org/obo/ENVO_00000413","pingo","A mound of earth-covered ice found in the Arctic, subarctic, and Antarctica that can reach up to 70 metres in height and up to 2 kilometres in diameter."],["http://purl.obolibrary.org/obo/ENVO_00000415","raised beach","A beach or wave cut platform raised above the shore line by a relative fall in the sea level."],["http://purl.obolibrary.org/obo/ENVO_00000416","coastal dune",""],["http://purl.obolibrary.org/obo/ENVO_00000417","machair","A fertile low-lying raised beach found on the some of the coastlines of Ireland and Scotland, in particular in the Outer Hebrides."],["http://purl.obolibrary.org/obo/ENVO_00000418","ria","A submergent coastal landform that forms where sea levels rise relative to the land either as a result of eustatic sea level change; where the global sea levels rise or isostatic sea level change; where the land sinks. When this happens valleys which were previously at sea level become submerged."],["http://purl.obolibrary.org/obo/ENVO_00000422","limestone pavement","A natural karst landform consisting of a flat, incised surface of exposed limestone that resembles artificial pavement."],["http://purl.obolibrary.org/obo/ENVO_00000423","river island","An island that lies in a river."],["http://purl.obolibrary.org/obo/ENVO_00000425","cold seep","An area of the ocean floor where hydrogen sulfide, methane and other hydrocarbon-rich fluid seepage occurs. Cold seeps are distinct from hydrothermal vents: the former's emissions are of the same temperature as the surrounding seawater, whereas the latter's emissions are super-heated."],["http://purl.obolibrary.org/obo/ENVO_00000429","arete","A thin, almost knife-like, ridge of rock which is typically formed when two glaciers erode parallel U-shaped valleys. The arte is a thin ridge of rock that is left separating the two valleys. Artes can also form when two glacial cirques erode towards one another, although frequently this results in a saddle-shaped pass, called a col."],["http://purl.obolibrary.org/obo/ENVO_00000432","monadnock","An isolated hill, knob, ridge, or small mountain that rises abruptly from a gently sloping or virtually level surrounding plain."],["http://purl.obolibrary.org/obo/ENVO_00000434","outwash fan","A fan-shaped body of sediments deposited by braided streams from a melting glacier."],["http://purl.obolibrary.org/obo/ENVO_00000435","proglacial lake","A lake formed either by the damming action of a moraine or ice dam during the retreat of a melting glacier, or one formed by meltwater trapped against an ice mass due to isostatic depression of the crust around the ice."],["http://purl.obolibrary.org/obo/ENVO_00000439","dell","A small wooded valley, either U- or V-shaped."],["http://purl.obolibrary.org/obo/ENVO_00000440","rockhouse","A shallow cave-like opening at the base of a bluff or cliff."],["http://purl.obolibrary.org/obo/ENVO_00000444","clearing","An open area in a forest."],["http://purl.obolibrary.org/obo/ENVO_00000446","terrestrial","A biome that applies to the terrestrial realm."],["http://purl.obolibrary.org/obo/ENVO_00000447","marine","An aquatic biome that comprises systems of open-ocean and unprotected coastal habitats, characterized by exposure to wave action, tidal fluctuation, and ocean currents as well as systems that largely resemble these. Water in the marine biome is generally within the salinity range of seawater: 30 to 38 ppt."],["http://purl.obolibrary.org/obo/ENVO_00000448","hydroelectric reservoir","A reservoir constructed for the purpose of generating electricity."],["http://purl.obolibrary.org/obo/ENVO_00000450","irrigation reservoir","A reservoir constructed for the purpose of providing water for irrigation."],["http://purl.obolibrary.org/obo/ENVO_00000453","liman","A lake or estuary that is formed at the mouth of a river where flow is blocked by a bar of sediments. It can be maritime (the bar being created by the current of a sea) or fluvial (the bar being created by the flow of a bigger river at the confluence)."],["http://purl.obolibrary.org/obo/ENVO_00000454","turlough","An intermittent lake unique to the limestone areas of Ireland, mostly west of the River Shannon. Most turloughs flood in the autumn, usually some time in October, and then dry up some time between April and July."],["http://purl.obolibrary.org/obo/ENVO_00000455","tarn","A mountain lake that is formed in a cirque excavated by a glacier. A moraine may form a natural dam below a tarn."],["http://purl.obolibrary.org/obo/ENVO_00000456","tidewater glacier","A glacier that flows into the sea."],["http://purl.obolibrary.org/obo/ENVO_00000458","valley glacier","A glacier that forms in a mountain valley."],["http://purl.obolibrary.org/obo/ENVO_00000463","harbor","A place where ships may shelter from the weather or are stored."],["http://purl.obolibrary.org/obo/ENVO_00000465","natural harbor","A harbor which is formed by a natural landform where a part of a body of water is protected and deep enough to furnish anchorage."],["http://purl.obolibrary.org/obo/ENVO_00000470","irrigation dam","A dam constructed for the purpose of holding water in a reservoir for irrigation."],["http://purl.obolibrary.org/obo/ENVO_00000472","backwater","An area of calm water unaffected by the current of a stream."],["http://purl.obolibrary.org/obo/ENVO_00000473","gravel pit","A quarry from which gravel is extracted."],["http://purl.obolibrary.org/obo/ENVO_00000475","inlet","An opening of the sea into the land, or of a lake into its shore."],["http://purl.obolibrary.org/obo/ENVO_00000476","lake inlet","An opening of a lake into its shore."],["http://purl.obolibrary.org/obo/ENVO_00000483","plunge pool","A hollow eroded by the force of the falling water at the base of a waterfall, particularly by the eddying effect."],["http://purl.obolibrary.org/obo/ENVO_00000484","polynya","Any enclosed water area in pack ice other than a lead, not large enough to be called open water. When frozen over, a polyna becomes an ice skylight from the point of view of the submariner."],["http://purl.obolibrary.org/obo/ENVO_00000485","sea shore","That part of the land in immediate contact with a sea, including the intertidal zone."],["http://purl.obolibrary.org/obo/ENVO_00000488","glacial lake","A lake associated with a glacier."],["http://purl.obolibrary.org/obo/ENVO_00000489","palsa","A low oval elevation in areas with permafrost, frequently peat bogs, where a perennial ice lens has developed within the soil. A palsa consists, similarly to a pingo, of an ice core and overlying soil materials, in case of a palsa usually boggy soil. Palsas are characteristically found in areas with discontinuous permafrost and in such areas bay be the only reliable surface evidence of permafrost. A palsa needs large quantities of water for the formation of its ice core (i.e. ice lens), which is why they frequently emerge from and are bound by boggy soils, which can store enormous quantities of water in their pores. Palsas develop particularly in moorlands and are therefore also named palsamoors."],["http://purl.obolibrary.org/obo/ENVO_00000495","tributary","A stream or river which flows into another river (a parent river) or body of water but which may not flow directly into the sea."],["http://purl.obolibrary.org/obo/ENVO_00000496","rill","A narrow and shallow incision into soil resulting from erosion by overland flow that has been focused into a thin thread by soil surface roughness. Rilling, the process of rill formation, is common on agricultural land and unvegetated ground."],["http://purl.obolibrary.org/obo/ENVO_00000497","rincon","An incised meander on a river."],["http://purl.obolibrary.org/obo/ENVO_00000500","beaver dam","An obstruction in a stream constructed by a beaver."],["http://purl.obolibrary.org/obo/ENVO_00000502","intermittent saline lake","A saline lake that is not permanently filled with water, at times being dry."],["http://purl.obolibrary.org/obo/ENVO_00000504","intermittent pond","A pond that is not permanently filled with water, at times being dry."],["http://purl.obolibrary.org/obo/ENVO_00000508","terrace","A step-like feature between higher and lower ground: a relatively flat or gently inclined shelf of earth, backed and fronted by steep slopes or manmade detaining walls."],["http://purl.obolibrary.org/obo/ENVO_00000511","blanket bog","A peatland whose development is mostly independent of basins or topographical features where water collects; it simply covers the landscape like a blanket. Peat develops due to a continuous supply of water from rainfall, maintaining waterlogged conditions on the ground. Blanket bogs are ombrotrophic or rain fed, and as a result their pH lies between 3.5 and 4.2."],["http://purl.obolibrary.org/obo/ENVO_00000512","pond bed","The ground surface that lies beneath a pond."],["http://purl.obolibrary.org/obo/ENVO_00000516","hammock","A patch of ground, distinct from and slightly above the surrounding plain or wetland. Often occurs in groups."],["http://purl.obolibrary.org/obo/ENVO_00000517","lost stream","A surface stream that disappears into an underground channel, or dries up in an arid area."],["http://purl.obolibrary.org/obo/ENVO_00000519","agricultural terrace",""],["http://purl.obolibrary.org/obo/ENVO_00000520","landslide","A mound of earth material, at the base of a slope and the associated scoured area."],["http://purl.obolibrary.org/obo/ENVO_00000521","rockfall","An irregular mass of fallen rock at the base of a cliff or steep slope."],["http://purl.obolibrary.org/obo/ENVO_00000527","interfluve","A relatively undissected upland between adjacent stream valleys."],["http://purl.obolibrary.org/obo/ENVO_00000529","beach ridge","A ridge of sand just inland and parallel to the beach, usually in series."],["http://purl.obolibrary.org/obo/ENVO_00000534","pothole",""],["http://purl.obolibrary.org/obo/ENVO_00000535","weir","A low obstruction built across the path of s stream to raise its level."],["http://purl.obolibrary.org/obo/ENVO_00000537","boulder field","A high altitude or high latitude bare, flat area covered with large angular rocks."],["http://purl.obolibrary.org/obo/ENVO_00000540","brackish lake",""],["http://purl.obolibrary.org/obo/ENVO_00000541","brackish pond",""],["http://purl.obolibrary.org/obo/ENVO_00000544","leat","A man-made watercourse, or makeshift aqueduct, often an artificial channel which supplies water to a watermill or its mill pond, collecting water from upstream of the mill so that the natural level of the driving water is above the level of the stream at the mill. Alternatively to may deliver water for mineral washing and concentration, irrigation or to a dye works."],["http://purl.obolibrary.org/obo/ENVO_00000545","shingle beach","A beach which is armoured with pebbles or small to medium sized cobbles."],["http://purl.obolibrary.org/obo/ENVO_00000546","lake sediment",""],["http://purl.obolibrary.org/obo/ENVO_00000548","gravel field",""],["http://purl.obolibrary.org/obo/ENVO_00000551","endorheic basin","A drainage basin from which there is no outflow of water, either on the surface as rivers, or underground by flow or diffusion through rock or permeable material."],["http://purl.obolibrary.org/obo/ENVO_00000553","multipurpose dam","A dam constructed for more than one purpose."],["http://purl.obolibrary.org/obo/ENVO_00000563","pier","A raised walkway over water, supported by piles or pillars."],["http://purl.obolibrary.org/obo/ENVO_00000567","calanque","A deep valley with steep sides, typically of limestone, in part submerged by the sea."],["http://purl.obolibrary.org/obo/ENVO_00000568","aerial environment","An environment that is solely in the air."],["http://purl.obolibrary.org/obo/ENVO_00000571","arboreal habitat","A habitat in or on trees."],["http://purl.obolibrary.org/obo/ENVO_00000572","subterrestrial","A habitat that is below the surface of the earth."],["http://purl.obolibrary.org/obo/ENVO_00000856","city","Incorporated populated place."],["http://purl.obolibrary.org/obo/ENVO_00000873","freshwater","A biome that applies to the freshwater realm."],["http://purl.obolibrary.org/obo/ENVO_00000879","Tropical and subtropical moist broadleaf forest",""],["http://purl.obolibrary.org/obo/ENVO_00000883","desert and xeric shrubland",""],["http://purl.obolibrary.org/obo/ENVO_00000886","endolithic habitat","A biome consisting of the spaces within rocks, such as pores between aggregate grains. Inhabited by endolithic organisms."],["http://purl.obolibrary.org/obo/ENVO_00000887","large river",""],["http://purl.obolibrary.org/obo/ENVO_00000889","large river delta",""],["http://purl.obolibrary.org/obo/ENVO_00000890","small river",""],["http://purl.obolibrary.org/obo/ENVO_00000891","large lake",""],["http://purl.obolibrary.org/obo/ENVO_00000892","small lake",""],["http://purl.obolibrary.org/obo/ENVO_00001995","rock","A mass of the mineral material of the crust of the Earth."],["http://purl.obolibrary.org/obo/ENVO_00001997","acid mine drainage","A mine drainage with an acidic pH."],["http://purl.obolibrary.org/obo/ENVO_00001998","soil","Any material within 2 m from the Earth's surface that is in contact with the atmosphere, with the exclusion of living organisms, areas with continuous ice not covered by other material, and water bodies deeper than 2 m."],["http://purl.obolibrary.org/obo/ENVO_00002007","sediment","Sediment is an environmental substance comprised of any particulate matter that can be transported by fluid flow and which eventually is deposited as a layer of solid particles on the bedor bottom of a body of water or other liquid."],["http://purl.obolibrary.org/obo/ENVO_00002008","dust","Minute solid particles with diameters less than 500 micrometers. Occurs in and may be deposited from, the atmosphere."],["http://purl.obolibrary.org/obo/ENVO_00002010","saline water",""],["http://purl.obolibrary.org/obo/ENVO_00002012","hypersaline water",""],["http://purl.obolibrary.org/obo/ENVO_00002013","igneous rock","Rock formed from molten magma."],["http://purl.obolibrary.org/obo/ENVO_00002015","volcanic rock","An igneous rock that results from magma reaching the surface either as lava or fragmental ejecta."],["http://purl.obolibrary.org/obo/ENVO_00002017","metamorphic rock","A rock formed by subjecting any rock type (including previously-formed metamorphic rock) to different temperature and pressure conditions than those in which the original rock was formed. These temperatures and pressures are always higher than those at the Earth's surface and must be sufficiently high so as to change the original minerals into other mineral types or else into other forms of the same minerals (e.g. by recrystallisation)."],["http://purl.obolibrary.org/obo/ENVO_00002019","brackish water",""],["http://purl.obolibrary.org/obo/ENVO_00002022","alkaline habitat","A biome in which the pH is \u003epH9. Inhabited by alkaliphilic organisms."],["http://purl.obolibrary.org/obo/ENVO_00002024","haline habitat","A biome characterized by a concentration of salt at least 2M. Inhabited by halophilic organisms."],["http://purl.obolibrary.org/obo/ENVO_00002030","aquatic","A habitat that is in or on water"],["http://purl.obolibrary.org/obo/ENVO_00002033","carcass","The dead body of an animal."],["http://purl.obolibrary.org/obo/ENVO_00002034","biofilm","A complex aggregation of microorganisms marked by the excretion of a protective and adhesive matrix; usually adhering to a substratum."],["http://purl.obolibrary.org/obo/ENVO_00002040","wood",""],["http://purl.obolibrary.org/obo/ENVO_00002045","anaerobic sediment","Sediment characterised by the absence of oxygen."],["http://purl.obolibrary.org/obo/ENVO_00002053","limestone","A sedimentary rock composed largely of the mineral calcite."],["http://purl.obolibrary.org/obo/ENVO_00002054","chalk","A soft, white, porous limestone."],["http://purl.obolibrary.org/obo/ENVO_00002063","hydrocarbon seep","The result of the release of natural hydrocarbons to the surface of the earth, including beneath the sea, by natural geological processes."],["http://purl.obolibrary.org/obo/ENVO_00002113","deep marine sediment","sediment that accumulates in the flat or very gently sloping areas of the deep ocean basin floor. The three main types are siliceous oozes, calcareous oozes, and red clays."],["http://purl.obolibrary.org/obo/ENVO_00002119","alkaline hot spring","A hot spring whose water has an alkaline pH."],["http://purl.obolibrary.org/obo/ENVO_00002120","acid hot spring","A hot spring whose water has an acidic pH."],["http://purl.obolibrary.org/obo/ENVO_00002127","stream sediment",""],["http://purl.obolibrary.org/obo/ENVO_00002130","hypolimnion","The dense, bottom layer of water in a thermally-stratified lake. It is the layer that lies below the thermocline."],["http://purl.obolibrary.org/obo/ENVO_00002133","anaerobic mud",""],["http://purl.obolibrary.org/obo/ENVO_00002138","beach sand",""],["http://purl.obolibrary.org/obo/ENVO_00002140","cobble","A rock or rock fragment with a particle size between 64 and 256 mm."],["http://purl.obolibrary.org/obo/ENVO_00002141","leachate","The liquid produced when water percolates through any permeable material. It can contain either dissolved or suspended material, or usually both."],["http://purl.obolibrary.org/obo/ENVO_00002144","cave wall",""],["http://purl.obolibrary.org/obo/ENVO_00002150","coastal water",""],["http://purl.obolibrary.org/obo/ENVO_00002160","estuarine mud",""],["http://purl.obolibrary.org/obo/ENVO_00002173","hospital",""],["http://purl.obolibrary.org/obo/ENVO_00002179","intertidal sediment",""],["http://purl.obolibrary.org/obo/ENVO_00002199","sandy beach",""],["http://purl.obolibrary.org/obo/ENVO_00002223","oligotrophic water","Water with a very low nutrient level."],["http://purl.obolibrary.org/obo/ENVO_00002224","eutrophic water","Water with a high nutrient level."],["http://purl.obolibrary.org/obo/ENVO_00002225","mesotrophic water","Water with a nutrient level intermediate between eutrophic and oligotrophic."],["http://purl.obolibrary.org/obo/ENVO_00002226","borehole",""],["http://purl.obolibrary.org/obo/ENVO_00002228","pond water",""],["http://purl.obolibrary.org/obo/ENVO_00002229","sandy soil","Arenosols are sandy soils, including both soils developed in residual sands after in situ weathering of usually quartz-rich sediments or rock, and soils developed in recently deposited sands such as dunes in deserts and beach lands."],["http://purl.obolibrary.org/obo/ENVO_00002235","cambisol","Cambisols combine soils with at least an incipient subsurface soil formation. Transformation of parent material is evident from structure formation and mostly brownish discoloration, increasing clay percentage, and/or carbonate removal."],["http://purl.obolibrary.org/obo/ENVO_00002236","cryosol","Cryosols comprise mineral soils formed in a permafrost environment. Where water is present, it occurs primarily in the form of ice. Cryogenic processes are the dominant soil-forming processes."],["http://purl.obolibrary.org/obo/ENVO_00002237","chernozem","Chernozems are soils with a thick black surface layer that is rich in organic matter."],["http://purl.obolibrary.org/obo/ENVO_00002241","leptosol","Leptosols are very shallow soils over continuous rock and soils that are extremely gravelly and/or stony. Leptosols are azonal soils and particularly common in mountainous regions."],["http://purl.obolibrary.org/obo/ENVO_00002243","histosol","Histosols comprise soils formed in organic material. These vary from soils developed in predominantly moss peat in boreal, arctic and subarctic regions, via moss peat, reeds/ sedge peat (fen) and forest peat in temperate regions to mangrove peat and swamp forest peat in the humid tropics. Histosols are found at all altitudes, but the vast majority occurs in lowlands."],["http://purl.obolibrary.org/obo/ENVO_00002244","gleysol","Gleysols are wetland soils that, unless drained, are saturated with groundwater for long enough periods to develop a characteristic gleyic colour pattern. This pattern is essentially made up of reddish, brownish or yellowish colours at ped surfaces and/or in the upper soil layer or layers, in combination with greyish/bluish colours inside the peds and/or deeper in the soil."],["http://purl.obolibrary.org/obo/ENVO_00002246","ferralsol","Ferralsols represent the classical, deeply weathered, red or yellow soils of the humid tropics. These soils have diffuse horizon boundaries, a clay assemblage dominated by low-activity clays (mainly kaolinite) and a high content of sesquioxides."],["http://purl.obolibrary.org/obo/ENVO_00002248","luvisol","Luvisols are soils that have a higher clay content in the subsoil than in the topsoil as a result of pedogenetic processes (especially clay migration) leading to an argic subsoil horizon. Luvisols have high-activity clays throughout the argic horizon and a high base saturation at certain depths."],["http://purl.obolibrary.org/obo/ENVO_00002252","solonchak","Solonchaks are soils that have a high concentration of soluble salts at some time in the year. Solonchaks are largely confined to the arid and semi-arid climate zones and to coastal regions in all climates."],["http://purl.obolibrary.org/obo/ENVO_00002253","umbrisol","Umbrisols are soils in which organic matter has accumulated within the mineral surface soil (in most cases with low base saturation) to the extent that it significantly affects the behaviour and utilization of the soil."],["http://purl.obolibrary.org/obo/ENVO_00002254","vertisol","A soil in which there is a high content of expansive clay known as montmorillonite that forms deep cracks in drier seasons or years. Alternate shrinking and swelling causes self-mulching, where the soil material consistently mixes itself, causing vertisols to have an extremely deep A horizon and no B horizon."],["http://purl.obolibrary.org/obo/ENVO_00002255","solonetz","Solonetz are soils with a dense, strongly structured, clayey subsurface horizon that has a high proportion of adsorbed Na and/or Mg ions. Solonetz that contain free soda (Na2CO3) are strongly alkaline (field pH \u003e 8.5)."],["http://purl.obolibrary.org/obo/ENVO_00002256","regosol","Regosols form a taxonomic remnant group containing all soils that could not be accommodated in any of the other RSGs. In practice, Regosols are very weakly developed mineral soils in unconsolidated materials that do not have a mollic or umbric horizon, are not very shallow or very rich in gravels (Leptosols), sandy (Arenosols) or with fluvic materials (Fluvisols). Regosols are extensive in eroding lands, particularly in arid and semi-arid areas and in mountainous terrain."],["http://purl.obolibrary.org/obo/ENVO_00002257","podzol","Podzols are soils with a typically ash-grey upper subsurface horizon, bleached by loss of organic matter and iron oxides, on top of a dark accumulation horizon with brown, reddish or black illuviated humus and/or reddish Fe compounds. Podzols occur in humid areas in the boreal and temperate zones and locally also in the tropics."],["http://purl.obolibrary.org/obo/ENVO_00002258","loam","A soil composed of sand, silt, and clay in relatively even concentration (about 40-40-20% concentration respectively)."],["http://purl.obolibrary.org/obo/ENVO_00002259","agricultural soil",""],["http://purl.obolibrary.org/obo/ENVO_00002261","forest soil",""],["http://purl.obolibrary.org/obo/ENVO_00002262","clay soil",""],["http://purl.obolibrary.org/obo/ENVO_00002263","garden soil",""],["http://purl.obolibrary.org/obo/ENVO_00002265","agricultural waste","Wastewater produced in the course of agricultural activities"],["http://purl.obolibrary.org/obo/ENVO_00002268","sphagnum bog","A peatland dominated by species of the Bryophyte Sphagnum."],["http://purl.obolibrary.org/obo/ENVO_00002269","thermocline","A layer within a water body where the temperature changes rapidly with depth."],["http://purl.obolibrary.org/obo/ENVO_00002273","fluvisol","Fluvisols accommodate genetically young, azonal soils in alluvial deposits."],["http://purl.obolibrary.org/obo/ENVO_00002870","adobe soil",""],["http://purl.obolibrary.org/obo/ENVO_00002871","alluvial soil",""],["http://purl.obolibrary.org/obo/ENVO_00002872","bagasse","The biomass remaining after sugarcane stalks are crushed to extract their juice."],["http://purl.obolibrary.org/obo/ENVO_00002873","organic waste",""],["http://purl.obolibrary.org/obo/ENVO_00002982","clay","A group of hydrous aluminium phyllosilicate (phyllosilicates being a subgroup of silicate minerals) minerals (see clay minerals), that are typically less than 2micrometres in diameter. Clay consists of a variety of phyllosilicate minerals rich in silicon and aluminium oxides and hydroxides which include variable amounts of structural water."],["http://purl.obolibrary.org/obo/ENVO_00002993","tropical humid forests",""],["http://purl.obolibrary.org/obo/ENVO_00003033","mushroom compost",""],["http://purl.obolibrary.org/obo/ENVO_00003041","cow shed",""],["http://purl.obolibrary.org/obo/ENVO_00003042","piggery",""],["http://purl.obolibrary.org/obo/ENVO_00003082","enriched soil",""],["http://purl.obolibrary.org/obo/ENVO_00003097","bore hole water",""],["http://purl.obolibrary.org/obo/ENVO_00003862","dairy (microbial habitat)",""],["http://purl.obolibrary.org/obo/ENVO_00003914","chalk soil",""],["http://purl.obolibrary.org/obo/ENVO_00003982","travertine","A natural chemical precipitate of carbonate minerals; typically aragonite, but often recrystallized to or primarily calcite; which is deposited from the water of mineral springs (especially hot springs) or streams saturated with calcium carbonate."],["http://purl.obolibrary.org/obo/ENVO_00005739","sea foam",""],["http://purl.obolibrary.org/obo/ENVO_00005740","paddy field soil",""],["http://purl.obolibrary.org/obo/ENVO_00005741","alpine soil",""],["http://purl.obolibrary.org/obo/ENVO_00005742","arable soil",""],["http://purl.obolibrary.org/obo/ENVO_00005746","savanna soil",""],["http://purl.obolibrary.org/obo/ENVO_00005748","dry soil",""],["http://purl.obolibrary.org/obo/ENVO_00005749","farm soil",""],["http://purl.obolibrary.org/obo/ENVO_00005750","grassland soil",""],["http://purl.obolibrary.org/obo/ENVO_00005754","fertilized soil",""],["http://purl.obolibrary.org/obo/ENVO_00005755","field soil",""],["http://purl.obolibrary.org/obo/ENVO_00005760","burned soil",""],["http://purl.obolibrary.org/obo/ENVO_00005761","meadow soil",""],["http://purl.obolibrary.org/obo/ENVO_00005766","limed soil",""],["http://purl.obolibrary.org/obo/ENVO_00005771","muddy soil",""],["http://purl.obolibrary.org/obo/ENVO_00005773","pasture soil",""],["http://purl.obolibrary.org/obo/ENVO_00005774","peat soil",""],["http://purl.obolibrary.org/obo/ENVO_00005775","salt contaminated soil",""],["http://purl.obolibrary.org/obo/ENVO_00005777","steppe soil",""],["http://purl.obolibrary.org/obo/ENVO_00005778","tropical soil",""],["http://purl.obolibrary.org/obo/ENVO_00005783","leafy wood soil",""],["http://purl.obolibrary.org/obo/ENVO_00005785","volcanic soil",""],["http://purl.obolibrary.org/obo/ENVO_00005786","upland soil",""],["http://purl.obolibrary.org/obo/ENVO_00005790","red soil",""],["http://purl.obolibrary.org/obo/ENVO_00005792","underground water",""],["http://purl.obolibrary.org/obo/ENVO_00005793","muddy water",""],["http://purl.obolibrary.org/obo/ENVO_00005795","marine mud",""],["http://purl.obolibrary.org/obo/ENVO_00005799","rocky sand",""],["http://purl.obolibrary.org/obo/ENVO_00005800","desert sand",""],["http://purl.obolibrary.org/obo/ENVO_00005801","rhizosphere","The narrow region of soil that is directly influenced by root secretions and associated soil microorganisms."],["http://purl.obolibrary.org/obo/ENVO_00005806","Tropical and subtropical coniferous forest",""],["http://purl.obolibrary.org/obo/ENVO_00010358","fomite","A fomite is any inanimate object or substance capable of carrying infectious organisms (such as germs or parasites) and hence transferring them from one individual to another. A fomite can be anything such as a cloth or mop heads so when cleaning this is important to remember that this could aid when spreading pathogenic organisms."],["http://purl.obolibrary.org/obo/ENVO_00010505","aerosol","Airborne solid particles (also called dust or particulate matter (PM)) or liquid droplets."],["http://purl.obolibrary.org/obo/ENVO_00012408","aquifer","An underground layer of water-bearing permeable rock or unconsolidated materials (gravel, sand, silt, or clay) from which groundwater can be usefully extracted using a water well."],["http://purl.obolibrary.org/obo/ENVO_00012411","karst cave",""],["http://purl.obolibrary.org/obo/ENVO_0010163","dry river valley",""],["http://purl.obolibrary.org/obo/ENVO_01000000","humus","Organic matter in soil which has reached a point of stability, where it will break down no further and might, if conditions do not change, remain essentially as it is for centuries, or millennia."],["http://purl.obolibrary.org/obo/ENVO_01000001","mud","A liquid or semi-liquid mixture of water and some combination of soil, silt, and clay."],["http://purl.obolibrary.org/obo/ENVO_01000002","water well",""],["http://purl.obolibrary.org/obo/ENVO_01000008","microbial mat","A multi-layered sheet of micro-organisms, mainly bacteria and archaea. Microbial mats grow at interfaces between different types of material, mostly on submerged or moist surfaces but a few survive in deserts."],["http://purl.obolibrary.org/obo/ENVO_01000017","sand","A naturally occurring granular material composed of finely divided rock and mineral particles."],["http://purl.obolibrary.org/obo/ENVO_01000018","gravel","Gravel is an environmental material which is composed of pieces of rock that are at least two millimeters (2mm) in its largest dimension and no more than 75 millimeters."],["http://purl.obolibrary.org/obo/ENVO_01000019","cave floor",""],["http://purl.obolibrary.org/obo/ENVO_01000020","estuarine","Expressions of the estuarine biome occur at wide lower courses of a rivers where they flow into a sea. Estuaries experience tidal flows and their water is a changing mixture of fresh and salt."],["http://purl.obolibrary.org/obo/ENVO_01000022","salt marsh","The marine salt marsh biome comprises marshes that are transitional intertidals between land and salty or brackish marine water (e.g.: sloughs, bays, estuaries). It is dominated by halophytic (salt tolerant) herbaceous plants. The daily tidal surges bring in nutrients, which tend to settle in roots of the plants within the salt marsh. The natural chemical activity of salty (or brackish) water and the tendency of algae to bloom in the shallow unshaded water also allow for great biodiversity."],["http://purl.obolibrary.org/obo/ENVO_01000023","marine pelagic","The marine pelagic biome (pelagic meaning open sea) is that of the marine water column, from the surface to the greatest depths."],["http://purl.obolibrary.org/obo/ENVO_01000024","marine benthic","The marine benthic biome (benthic meaning 'bottom') encompasses the seafloor and includes such areas as shores, littoral or intertidal areas, marine coral reefs, and the deep seabed."],["http://purl.obolibrary.org/obo/ENVO_01000026","bathyal zone","The mariine bathyal zone biome comprises regions of the marine benthic biome between approximately 200 m and 3000 m depth. This zone generally coincides with the continental slope."],["http://purl.obolibrary.org/obo/ENVO_01000028","hadal zone","The marine hadal zone biome describes sea floor deeper than 6000 m such as that of the oceanic trenches."],["http://purl.obolibrary.org/obo/ENVO_01000029","marine reef","A biome expressed by strips or ridges of rocks, sand, or coral that rises to or near the surface of a body of marine water."],["http://purl.obolibrary.org/obo/ENVO_01000030","hydrothermal vent","The marine hydrothermal vent biome comprises regions of the marine benthic biome where heat generated due to tectonic activity, either at divergent plate boundaries or convergent ocean plates where back-arc spreading occurs, is released or 'vented' to the surface. The resultant high temperature water jets are laden with dissolved metals and minerals."],["http://purl.obolibrary.org/obo/ENVO_01000032","neritic pelagic zone","The neritic epipelagic zone biome comprises the marine water column above a continental shelf."],["http://purl.obolibrary.org/obo/ENVO_01000037","oceanic bathypelagic zone","The bathypelagic zone biome comprises the marine water column below approximately 1000 m water depth - the maximum depth to which detectable daylight penetrates in all but the clearest oligotrophic waters - and extends to about 2500 - 2700 m water depth. In the temperate Atlantic, the beginning of the bathypelagic zone biome approximates to the deep oxygen minimum and the base of the permanent thermocline."],["http://purl.obolibrary.org/obo/ENVO_01000040","oceanic benthopelagic zone","The benthopelagic zone biome comprises regions of the marine water column which usually coincide with the benthic boundary layer (BBL) - the layer of isothermal and isohaline water contiguous to the sea floor. A general reversal in the declining gradient of pelagic biomass may be observed here, perhaps explained by viable nutrition on the sea floor being resuspended by bottom currents. This zone typically extends 100 m above the seafloor, but may reach upto1000 m during benthic storms."],["http://purl.obolibrary.org/obo/ENVO_01000058","kelp forest",""],["http://purl.obolibrary.org/obo/ENVO_01000059","sea grass bed","Seagrass beds are highly diverse and productive ecosystems, and can harbour hundreds of associated species from all phyla. They partly create their own habitat: the leaves slow down water-currents increasing sedimentation, and the seagrass roots and rhizomes stabilize the seabed."],["http://purl.obolibrary.org/obo/ENVO_01000063","marine upwelling","A marine upwelling is a net flow of marine water to the surface of the water column from deeper regions. This is often a result of surface water displacement off continental coasts by wind action. Localised upwellings may also occur along divergent fronts around eddies and along some of the major oceanographic features. Deeper waters often have higher nutrient content; consequently blooms of primary producers, such as planktonic algae, are generally observed around upwelling zones."],["http://purl.obolibrary.org/obo/ENVO_01000070","terrigenous sediment","Sediment comprised of weathered continental rocks, wind blown dust, volcanic ash or other terrestrial material."],["http://purl.obolibrary.org/obo/ENVO_01000071","oceanic front","An oceanic front is a narrow zone of enhanced horizontal gradients of water properties (temperature, salinity, nutrients, etc.) that separates broader areas with different water masses or different vertical structure (stratification)."],["http://purl.obolibrary.org/obo/ENVO_01000112","polymetallic nodule","Polymetallic nodules, also called manganese nodules, are rock concretions on the sea bottom formed of concentric layers of iron and manganese hydroxides around a core. Nodules vary in size from tiny particles visible only under a microscope to large pellets more than 20 centimetres (8 in) across. However, most nodules are between 5 and 10 cm in diameter."],["http://purl.obolibrary.org/obo/ENVO_01000113","suspended sediment","Suspended sediment, or suspended load, is the term for the particles settle  slowly enough to be carried in flowing water (such as a stream or coastal area) either without touching the bed or while only intermittently touching it. These particles are generally of the fine sand, silt and clay size, although larger particles may be carried as well depending on the intensity of the flow."],["http://purl.obolibrary.org/obo/ENVO_01000115","cobble sediment","Sediment characterised by an average particle diameter between 64 and 256 mm."],["http://purl.obolibrary.org/obo/ENVO_01000116","pebble sediment","Sediment characterised by an average particle diameter between 4 and 32 mm."],["http://purl.obolibrary.org/obo/ENVO_01000117","granular sediment","Sediment characterised by an average particle diameter between 2 and 4 mm."],["http://purl.obolibrary.org/obo/ENVO_01000118","sandy sediment","Sediment characterised by an average particle diameter between 62.5 micrometers and 2 mm."],["http://purl.obolibrary.org/obo/ENVO_01000119","silty sediment","Sediment characterised by an average particle diameter between 3.9 and 62.5 micrometers."],["http://purl.obolibrary.org/obo/ENVO_01000120","clay sediment","Sediment characterised by an average particle diameter between 1 and 3.9 micrometers."],["http://purl.obolibrary.org/obo/ENVO_01000134","hydrothermal fluid","High temperature water ejected from hydrothermal vents and laden with dissolved metals and minerals as a result of percolation through crustal rocks."],["http://purl.obolibrary.org/obo/ENVO_01000144","coral reef flat zone",""],["http://purl.obolibrary.org/obo/ENVO_01000145","coral reef back reef",""],["http://purl.obolibrary.org/obo/ENVO_01000155","organic material","Environmental material characteristic of, pertaining to, or derived from living organisms."],["http://purl.obolibrary.org/obo/ENVO_01000158","marine snow","Marine snow is a continuous shower of mostly organic detritus falling from the upper layers of the water column. Its origin lies in activities within the productive photic zone."],["http://purl.obolibrary.org/obo/ENVO_01000173","anoxic water","Water depleted of dissolved oxygen."],["http://purl.obolibrary.org/obo/ENVO_01000174","forest","A forest biome is a terrestrial biome which includes, across its entire spatial extent, densely packed vegetation which strongly limits light penetration to the forest floor."],["http://purl.obolibrary.org/obo/ENVO_01000175","woodland","A woodland biome is a terrestrial biome which includes, across its entire spatial extent, woody plants spaced sufficiently far apart to allow light penetration to support communities of herbaceous plants or shrubs living closer to the woodland floor."],["http://purl.obolibrary.org/obo/ENVO_01000176","shrubland","A shrubland biome is a terrestrial biome which includes, across its entire spatial extent, dense groups of shrubs."],["http://purl.obolibrary.org/obo/ENVO_01000177","grassland","A grassland biome is a terrestrial biome which  includes, across its entire spatial extent, an unbroken layer of grasses (Gramineae), sedges (Cyperaceae) or  rushes (Juncaceae)."],["http://purl.obolibrary.org/obo/ENVO_01000178","savanna","A savanna biome is a woodland biome which has seasonal water availability and includes, across its entire spatial extent, trees spaced sufficiently far apart to allow an unbroken layer of grass, sedge (Cyperaceae) or  rush (Juncaceae) communities to live."],["http://purl.obolibrary.org/obo/ENVO_01000179","desert","A desert biome is a terrestrial biome which loses more liquid water by evapotranspiration than is supplied by precipitation and includes communities adapted to these conditions."],["http://purl.obolibrary.org/obo/ENVO_01000180","tundra","A tundra is a terrestrial biome which includes, across its spatial extent, only low-growing vegetation such as dwarf shrubs, sedges and grasses, mosses, and lichens. Tundra biomes rarely have monthly average temperatures above 10 degrees Celsius and have low evapotranspiration ratios."],["http://purl.obolibrary.org/obo/ENVO_01000181","mangrove","A mangrove biome is a terrestrial biome which includes, across its spatial extent, mangrove plants (Rhizophoraceae). Mangrove plants are able to withstand high levels of salinity as well as regions of anoxia and frequent tidal inundation. Mangrove biomes often occur near tropical and sub-tropical estuaries and depositional marine coastal environments where fine sediments (often with high organic content) collect in areas protected from high energy wave action."],["http://purl.obolibrary.org/obo/ENVO_01000182","temperate desert",""],["http://purl.obolibrary.org/obo/ENVO_01000183","tropical desert","A tropical desert biome is a desert biome which has communities adapted to temperatures above a monthly average of 18 degrees Celsius, high daily temperature ranges of approximately 20 degrees Celsius, very high insolation due to inhibited cloud formation, and very low precipitation. Tropical desert biomes located near coasts with cold upwellings may have cooler temperatures and reduced insolution due to fog."],["http://purl.obolibrary.org/obo/ENVO_01000184","subtropical desert",""],["http://purl.obolibrary.org/obo/ENVO_01000185","montane desert","A montane desert biome is a desert biome which occurs in regions elevated above sea level and which has community structure determined by elevation-dependent environmental conditions."],["http://purl.obolibrary.org/obo/ENVO_01000186","polar desert",""],["http://purl.obolibrary.org/obo/ENVO_01000187","subtropical savanna",""],["http://purl.obolibrary.org/obo/ENVO_01000188","tropical savanna",""],["http://purl.obolibrary.org/obo/ENVO_01000189","temperate savanna",""],["http://purl.obolibrary.org/obo/ENVO_01000190","flooded savanna","A flooded savanna biome is a savanna biome which has very wet to saturated soil moisture content."],["http://purl.obolibrary.org/obo/ENVO_01000191","subtropical grassland",""],["http://purl.obolibrary.org/obo/ENVO_01000192","tropical grassland",""],["http://purl.obolibrary.org/obo/ENVO_01000193","temperate grassland",""],["http://purl.obolibrary.org/obo/ENVO_01000194","montane grassland","A montane grassland biome is a grassland biome which occurs in regions elevated above sea level and which has community structure determined by elevation-dependent environmental conditions."],["http://purl.obolibrary.org/obo/ENVO_01000195","flooded grassland",""],["http://purl.obolibrary.org/obo/ENVO_01000196","coniferous forest","A coniferous forest biome is a forest biome which contains densely packed populations or communities of coniferous trees, strongly limiting light penetration to the forest floor."],["http://purl.obolibrary.org/obo/ENVO_01000197","broadleaf forest","A broadleaf forest biome is a forest biome which contains densely packed populations or communities of broadleaf trees, strongly limiting light penetration to the forest floor."],["http://purl.obolibrary.org/obo/ENVO_01000198","mixed forest","A mixed forest biome is a forest biome which contains densely packed populations or communities of broadleaf and coniferous trees, strongly limiting light penetration to the forest floor."],["http://purl.obolibrary.org/obo/ENVO_01000199","mediterranean forest","A mediterranean forest biome is a forest biome which includes communities adapted to hot to warm, dry summers, mild to cold, rainy winters, and the influence of large, usually marine, bodies of water."],["http://purl.obolibrary.org/obo/ENVO_01000200","tropical broadleaf forest",""],["http://purl.obolibrary.org/obo/ENVO_01000201","subtropical broadleaf forest",""],["http://purl.obolibrary.org/obo/ENVO_01000202","temperate broadleaf forest",""],["http://purl.obolibrary.org/obo/ENVO_01000205","subtropical",""],["http://purl.obolibrary.org/obo/ENVO_01000206","temperate",""],["http://purl.obolibrary.org/obo/ENVO_01000208","mediterranean woodland","A mediterranean woodland biome is a subtropical woodland biome which includes communities adapted to hot to warm, dry summers, mild to cold, rainy winters, and the influence of large, usually marine, bodies of water."],["http://purl.obolibrary.org/obo/ENVO_01000209","subtropical coniferous forest",""],["http://purl.obolibrary.org/obo/ENVO_01000210","tropical coniferous forest",""],["http://purl.obolibrary.org/obo/ENVO_01000211","temperate coniferous forest",""],["http://purl.obolibrary.org/obo/ENVO_01000212","temperate mixed forest",""],["http://purl.obolibrary.org/obo/ENVO_01000213","subtropical shrubland",""],["http://purl.obolibrary.org/obo/ENVO_01000214","tropical shrubland",""],["http://purl.obolibrary.org/obo/ENVO_01000215","temperate shrubland",""],["http://purl.obolibrary.org/obo/ENVO_01000216","montane shrubland","A montane shrubland biome is a shrubland biome which occurs in regions elevated above sea level and which has community structure determined by elevation-dependent environmental conditions."],["http://purl.obolibrary.org/obo/ENVO_01000217","mediterranean shrubland","A mediterranean shrubland biome is a subtropical shrubland biome which includes communities adapted to hot to warm, dry summers, mild to cold, rainy winters, and the influence of large, usually marine, bodies of water."],["http://purl.obolibrary.org/obo/ENVO_01000218","xeric shrubland",""],["http://purl.obolibrary.org/obo/ENVO_01000220","tropical woodland",""],["http://purl.obolibrary.org/obo/ENVO_01000221","temperate woodland",""],["http://purl.obolibrary.org/obo/ENVO_01000222","subtropical woodland",""],["http://purl.obolibrary.org/obo/ENVO_01000223","montane savanna","A montane savanna biome is a savanna biome which occurs in regions elevated above sea level and which has community structure determined by elevation-dependent environmental conditions."],["http://purl.obolibrary.org/obo/ENVO_01000224","mediterranean grassland","A mediterranean grassland biome is a  subtropical grassland biome which includes communities adapted to hot to warm, dry summers, mild to cold, rainy winters, and the influence of large, usually marine, bodies of water."],["http://purl.obolibrary.org/obo/ENVO_01000225","subtropical dry broadleaf forest",""],["http://purl.obolibrary.org/obo/ENVO_01000226","subtropical moist broadleaf forest",""],["http://purl.obolibrary.org/obo/ENVO_01000227","tropical dry broadleaf forest",""],["http://purl.obolibrary.org/obo/ENVO_01000228","tropical moist broadleaf forest",""],["http://purl.obolibrary.org/obo/ENVO_01000230","arid","An arid condition is an environmental condition in which annual precipitation is less than half of annual potential evapotranspiration."],["http://purl.obolibrary.org/obo/ENVO_01000234","mafic lava",""],["http://purl.obolibrary.org/obo/ENVO_01000236","basalt","Basalt is a volcanic rock which is formed by the rapid cooling of basaltic lava."],["http://purl.obolibrary.org/obo/ENVO_01000237","coastal scrubland","A coastal scrubland is a scrubland which is part of a coast."],["http://purl.obolibrary.org/obo/ENVO_01000239","oak woodland","An oak woodland is a woodland which has a tree community primarily composed of oak trees."],["http://purl.obolibrary.org/obo/ENVO_01000240","conifer woodland","A conifer woodland is a woodland which has a tree community primarily composed of coniferous trees, from the Division Pinophyta, also known as Coniferophyta or Coniferae."],["http://purl.obolibrary.org/obo/ENVO_01000241","juniper woodland","A juniper woodland is a woodland which has a tree community primarily composed of trees of the genus Juniperus."],["http://purl.obolibrary.org/obo/ENVO_01000242","desert scrubland","A scrubland which is located in a desert."],["http://purl.obolibrary.org/obo/ENVO_01000244","pinyon juniper woodland","A pinyon juniper woodland is a conifer woodland which has a tree community primarily composed of trees of the subsection Cembroides of the genus Pinus and the genus Juniperus."],["http://purl.obolibrary.org/obo/ENVO_01000247","rangeland","A rangeland biome is an anthropogenic terrestrial biome which is primarily used for the rearing and grazing of livestock."],["http://purl.obolibrary.org/obo/ENVO_01000248","dense settlement biome","A dense settlement biome is an anthropogenic terrestrial biome which is primarily used for human habitation, recreation, and industry within built structures with little other land use."],["http://purl.obolibrary.org/obo/ENVO_01000252","lake",""],["http://purl.obolibrary.org/obo/ENVO_01000253","river",""],["http://purl.obolibrary.org/obo/ENVO_01000277","ice","water frozen into a solid state"],["http://purl.obolibrary.org/obo/ENVO_01000316","alkaline environment","An alkaline environment is an environment in which entities are exposed to high pH, typically greater than a pH of 9"],["http://purl.obolibrary.org/obo/ENVO_01000331","cypress swamp","A cypress swamp is a swamp which has a plant community dominated by Cupressaceae, often swamp cypresses. Swamp cypresses typically belong to the genus Taxodium or the species Glyptostrobus pensilis and Actinostrobus pyramidalis."],["http://purl.obolibrary.org/obo/ENVO_01000339","polar",""],["http://purl.obolibrary.org/obo/ENVO_01000388","tropical semideciduous forest","A semi-deciduous broadleaf forest which is subject to tropical climate patterns."],["http://purl.obolibrary.org/obo/ENVO_01000435","montane forest",""],["http://purl.obolibrary.org/obo/ENVO_01000635","ground","planetary surface that is not covered by water"],["http://purl.obolibrary.org/obo/ENVO_01000687","coastal",""],["http://purl.obolibrary.org/obo/ENVO_01000816","deciduous forest","a forest in which the majority of trees shed foliage simultaneously in response to seasonal change."],["http://purl.obolibrary.org/obo/ENVO_01000843","evergreen forest","An area of a planet's surface which is primarily covered by a forest in which the majority of trees maintain their foliage despite seasonal change."],["http://purl.obolibrary.org/obo/ENVO_01001240","woodland canopy","A canopy which is part of a woodland ecosystem."],["http://purl.obolibrary.org/obo/ENVO_01001305","vegetated area",""],["http://purl.obolibrary.org/obo/ENVO_02000040","mucus","Mucus is a bodily fluid consisting of a slippery secretion of the lining of the mucous membranes in the body. It is a viscous colloid containing antiseptic enzymes (such as lysozyme) and immunoglobulins. Mucus is produced by goblet cells in the mucous membranes that cover the surfaces of the membranes. It is made up of mucins and inorganic salts suspended in water."],["http://purl.obolibrary.org/obo/ENVO_02000044","siliceous ooze","Siliceous ooze is a marine sediment composed of the debris of plankton with silica shells, such as diatoms and radiolaria. This ooze is limited to areas with high biological productivity, such as the polar oceans, and upwelling zones near the equator. The least common type of sediment, it covers only 15% of the ocean floor. It accumulates at a slower rate than calcareous ooze: 0.2-1 cm / 1000 yr."],["http://purl.obolibrary.org/obo/ENVO_02000045","red clay","Red clay, also known as pelagic clay, accumulates in the deepest and most remote areas of the ocean. Containing less than 30% biogenic material, its composition is a varied mix of very fine quartz and clay minerals, authigenic deposits precipitated directly from seawater, and micrometeorites. Though called \"red\" because it sometimes takes the color of oxidized iron minerals, it is usually brownish in color. Its ultimate origin is uncertain, but red clay seems to be mostly derived from distant rivers, and windblown dust. Covering 38% of the ocean floor, it accumulates more slowly than any other sediment type, at only 0.1-0.5 cm / 1000 yr."],["http://purl.obolibrary.org/obo/ENVO_02000046","calcareous ooze","Calcareous ooze is a marine sediment composed primarily of the shells--also known as tests--of foraminifera, coccolithophores, and pteropods. This is the most common pelagic sediment by area, covering 48% of the world ocean's floor. This type of ooze is limited to depths above the Carbonate Compensation Depth at time of burial. It accumulates more rapidly than any other pelagic sediment type, with a rate that varies from 0.3 - 5 cm / 1000 yr."],["http://purl.obolibrary.org/obo/ENVO_02000052","umbrella","A canopy designed to protect against precipitation or sunlight."],["http://purl.obolibrary.org/obo/ENVO_02000053","hide","A skin obtained from animals for human use typically from deer or cattle sources used to produce leather, shoes, fashion accessories, musical instruments."],["http://purl.obolibrary.org/obo/ENVO_02000059","surface soil","A soil consisting of the upper layer of soil on the surface consisting of loose material capable of supporting life composed of a mixture of mineral and organic matter."],["http://purl.obolibrary.org/obo/ENVO_02000081","letter","A written message from one person to another addressed to a person or organization."],["http://purl.obolibrary.org/obo/ENVO_03000033","marine sediment","Sediment which has been transported through the marine water column, settling on the seafloor"],["http://purl.obolibrary.org/obo/ENVO_03000034","shallow marine sediment","Marine sediment that accumulates within shallow regions of the oceanic basin close to continents, such as the continental shelf, or continental slope"],["http://purl.obolibrary.org/obo/EO_0007059","acidic soil",""],["http://purl.obolibrary.org/obo/FLOPO_0000032","fruit shape",""],["http://purl.obolibrary.org/obo/FLOPO_0000147","fruit color",""],["http://purl.obolibrary.org/obo/FLOPO_0000875","stem diameter","linear distance through the cross section of the stem or trunk, passing through the center"],["http://purl.obolibrary.org/obo/FLOPO_0001133","leaf length",""],["http://purl.obolibrary.org/obo/FLOPO_0001366","fruit length",""],["http://purl.obolibrary.org/obo/FLOPO_0003958","leaf size class",""],["http://purl.obolibrary.org/obo/FLOPO_0005532","rhizomatous plant","a plant having a rhizome, a modified subterranean plant stem that sends out roots and shoots from its nodes"],["http://purl.obolibrary.org/obo/FLOPO_0007484","Leaf Complexity","whether a leaf is intricate or compounded"],["http://purl.obolibrary.org/obo/FLOPO_0008548","leaf sheddability","A plant's disposition to lose leaves by a natural process"],["http://purl.obolibrary.org/obo/FLOPO_0015519","seed mass",""],["http://purl.obolibrary.org/obo/FLOPO_0015921","fruit width",""],["http://purl.obolibrary.org/obo/FLOPO_0019932","leaf morphology",""],["http://purl.obolibrary.org/obo/FLOPO_0022142","herb","whole plant herbaceous"],["http://purl.obolibrary.org/obo/FLOPO_0023069","thallus diameter","diameter of the thallus, a gametophytic lifestage that has a flat growth form"],["http://purl.obolibrary.org/obo/FLOPO_0900022","plant lifeform","whole plant lifeform"],["http://purl.obolibrary.org/obo/FLOPO_0900024","geophyte","whole plant geophytic"],["http://purl.obolibrary.org/obo/FLOPO_0900025","helophyte","whole plant helophytic"],["http://purl.obolibrary.org/obo/FLOPO_0900026","hydrophyte","whole plant hydrophytic"],["http://purl.obolibrary.org/obo/FLOPO_0900032","plant growth form","whole plant growth form. eg: herbaceous, tree, liana"],["http://purl.obolibrary.org/obo/FLOPO_0900033","tree","whole plant arborescent"],["http://purl.obolibrary.org/obo/FLOPO_0900034","shrub","whole plant frutescent, bush, shrub"],["http://purl.obolibrary.org/obo/FLOPO_0900035","climber","whole plant lianescent or scandent; eg: liana or vine"],["http://purl.obolibrary.org/obo/FLOPO_0900036","grass","whole plant graminoid"],["http://purl.obolibrary.org/obo/FLOPO_0900037","forb","whole plant forbacious"],["http://purl.obolibrary.org/obo/FLOPO_0900044","aquatic plant","whole plant aquatic"],["http://purl.obolibrary.org/obo/FLOPO_0980071","annual","Of plant duration, a plant whose life span ends within one year after germination, e.g. a winter annual germinating in the autumn and flowering in the spring (esp. in Mediterranean climates), approximately synonymous to therophyte, c.f. biennial, ephemeral, perennial, c.f. also of flowering with respect to architecture, hapaxanthic, monocarpic, pleonanthic."],["http://purl.obolibrary.org/obo/FLOPO_0980072","biennial","Of life span, a plant which lives for more than one but less than two years after germination, c.f. annual, ephemeral, perennial, of flowering with respect to architecture, hapaxanthic, monocarpic, pleonanthic."],["http://purl.obolibrary.org/obo/FLOPO_0980073","perennial","Of plant duration, a plant whose life span extends over more than two growing seasons, c.f. annual, biennial, ephemeral, of flowering with respect to architecture, hapaxanthic, monocarpic, pleonanthic"],["http://purl.obolibrary.org/obo/FOODON_00001006","meat","A food product made of meat, the skeletal muscle and associated fat, and other edible tissues such as organs, livers, skin, brains, bone marrow, kidneys, or lungs"],["http://purl.obolibrary.org/obo/FOODON_00001256","dairy","A dairy food product has mammilian milk or a milk component as an ingredient."],["http://purl.obolibrary.org/obo/FOODON_00001857","seasoning",""],["http://purl.obolibrary.org/obo/FOODON_00002300","sweetener",""],["http://purl.obolibrary.org/obo/FOODON_03301293","fodder","Feed for domesticated animals"],["http://purl.obolibrary.org/obo/FOODON_03303179","food colorant",""],["http://purl.obolibrary.org/obo/FOODON_03412972","food additive",""],["http://purl.obolibrary.org/obo/FOODON_03413448","anadromous","Anadromous fish live in the sea mostly, breed in fresh water; the best-known are salmon, which hatch in small freshwater streams, go down to the sea and live there for several years, then return to the same streams where they were hatched, spawn, and die shortly thereafter.\r\n"],["http://purl.obolibrary.org/obo/FOODON_03413449","catadromous","Catadromous fish live in fresh water, breed in the sea; the most remarkable are freshwater eels of genus Anguilla, whose larvae drift on the open ocean, sometimes for months or years, before travelling thousands of kilometres back to their original streams."],["http://purl.obolibrary.org/obo/FOODON_03413450","amphidromous","Amphidromous fish move between fresh and salt water during some part of life cycle, but not for breeding.\r\n"],["http://purl.obolibrary.org/obo/FOODON_03420194","eggs (commodity)","Poultry, game bird or turtle eggs."],["http://purl.obolibrary.org/obo/GAZ_00000071","biogeographic realm","The largest scale biogeographic division of the earth's surface based on the historic and evolutionary distribution patterns of plants and animals."],["http://purl.obolibrary.org/obo/GO_0000003","reproduction","The production of new individuals that contain some portion of genetic material inherited from one or more parent organisms"],["http://purl.obolibrary.org/obo/GO_0007552","metamorphosis",""],["http://purl.obolibrary.org/obo/GO_0009399","nitrogen fixation","The process in which nitrogen is taken from its relatively inert molecular form (N2) in the atmosphere and converted into nitrogen compounds useful for other chemical processes, such as ammonia, nitrate and nitrogen dioxide. "],["http://purl.obolibrary.org/obo/GO_0009507","chloroplast","A chlorophyll-containing plastid with thylakoids organized into grana and frets, or stroma thylakoids, and embedded in a stroma."],["http://purl.obolibrary.org/obo/GO_0009566","fertilization","The union of gametes of opposite sexes during the process of sexual reproduction to form a zygote.  It involves the fusion of the gametic nuclei (karyogamy) and cytoplasm (plasmogamy)."],["http://purl.obolibrary.org/obo/GO_0019953","sexual reproduction","Capable of creating a new organism by combining the genetic material of two gametes, which may come from two parent organisms or from a single organism, in the case of self-fertilizing hermaphrodites."],["http://purl.obolibrary.org/obo/GO_0019954","asexual reproduction","Capable of the biological process in which new individuals are produced by either a single cell or a group of cells, in the absence of any sexual process."],["http://purl.obolibrary.org/obo/GO_0035805","egg coat","A specialized extracellular matrix that surrounds the plasma membrane of the ovum of animals. The egg coat provides structural support and can play an essential role in oogenesis, fertilization and early development."],["http://purl.obolibrary.org/obo/GO_0036268","swimming","Self-propelled movement of an organism from one location to another through water, often by means of active fin movement."],["http://purl.obolibrary.org/obo/GO_0040011","locomotion","Self-propelled movement of a cell or organism from one location to another. "],["http://purl.obolibrary.org/obo/GO_0060746","parental care","A reproductive behavior in which a parent cares for and rears offspring. "],["http://purl.obolibrary.org/obo/GO_0097618","sulcal notch","A dinoflagellate sulcus that extends all the way to the posterior end of the cell (also known as antapex). The presence of a sulcal notch makes the dinoflagellate hypocone appear bilobed."],["http://purl.obolibrary.org/obo/GO_0097685","apical groove","A cell surface furrow (or groove) found on a dinoflagellate apex. It typically loops around the apex."],["http://purl.obolibrary.org/obo/GO_0097686","apical horn","A horn-shaped dinoflagellate apex found in thecate species."],["http://purl.obolibrary.org/obo/GO_0097687","antapical horn","A horn-shaped dinoflagellate antapex found in thecate species"],["http://purl.obolibrary.org/obo/GO_1990413","eye spot","A small pigmented organelle used in single-celled organisms to detect light."],["http://purl.obolibrary.org/obo/IDOMAL_0002084","migration"," Is a persistent and straightened-out movement effected by the animal's own locomotory exertions or by its active embarkation on a vehicle such as wind. Migration depends on some temporary inhibition of station-keeping responses, but promotes their eventual disinhibition and recurrence."],["http://purl.obolibrary.org/obo/MAT_0000366","storage organ","[non-woody storage organs, normally modified stems as bulbs, corms or tubers]"],["http://purl.obolibrary.org/obo/NBO_0000011","social","A behavior that occurs predominantly or only, in individuals that are part of a group."],["http://purl.obolibrary.org/obo/NBO_0000055","running","The act of locomoting on limbs with body off the ground such that periodically none of the limbs are touching the ground."],["http://purl.obolibrary.org/obo/NBO_0000056","walking","locomoting on limbs with body off the ground such that at least one limb is always touching the ground"],["http://purl.obolibrary.org/obo/NBO_0000363","crawling","Behavior related to the movement resulting by dragging the body close to the ground or substrate"],["http://purl.obolibrary.org/obo/NBO_0000364","arboreal (locomotion)","Behavior related to the locomotion of animals in trees."],["http://purl.obolibrary.org/obo/NBO_0000366","aerial","Behavior related to the movement of an organism from one location to another through the air."],["http://purl.obolibrary.org/obo/NBO_0000367","flight","self-propelled movement of an organism from one location to another through the air, usually by means of active wing movement"],["http://purl.obolibrary.org/obo/NBO_0000369","gliding","Behavior related to the expansion lateral surface of the body with the intention of increasing the wind resistance against the body and hence reducing the speed of falling."],["http://purl.obolibrary.org/obo/NBO_0000370","saltation","(Bipedal jumping.) Behavior related to the upward thrust produced by the rapid, simultaneous extension of the hind legs with the intend to rise in the air."],["http://purl.obolibrary.org/obo/NBO_0050001","inchworming","movement of an organism from one location to another using an inchworm like motion. This motion consists of extending the front part of the body and pulling the rear along the surface to meet the front."],["http://purl.obolibrary.org/obo/NCIT_C142605","medicinal","substance or combination of substances that may be administered to human beings (or animals) for treating or preventing disease, or with the intent to make a medical diagnosis or to restore, correct or modify physiological functions."],["http://purl.obolibrary.org/obo/NCIT_C16452","communication","The exchange of information between objects, people, or groups."],["http://purl.obolibrary.org/obo/NCIT_C25513","forms","combine to create (something), eg: a structure"],["http://purl.obolibrary.org/obo/NCIT_C25669","security","Services provided to prevent, deter, detect and/or document crime, fire, disorder or violations of rules"],["http://purl.obolibrary.org/obo/NCIT_C70589","abundance","Relative degree of plentifulness."],["http://purl.obolibrary.org/obo/NCIT_C79627","canes","A long, hollow or pithy, jointed woody stem that usually lives only one or two years."],["http://purl.obolibrary.org/obo/OBA_0000048","cell diameter",""],["http://purl.obolibrary.org/obo/OBA_0000052","cell shape","The approximate three dimensional shape of a cell, described as one or more geometric solids."],["http://purl.obolibrary.org/obo/OBA_0000056","cell volume","Volume of one cell."],["http://purl.obolibrary.org/obo/OBA_0002342","skeleton structure","The structure of a skeleton."],["http://purl.obolibrary.org/obo/OBA_1000018","nucleus shape","A morphological quality inhering in a nucleus by virtue of the nucleus's ratios of distances between its features (points, edges, surfaces and also holes etc)."],["http://purl.obolibrary.org/obo/OBA_1000036","cell mass","Mass of one cell."],["http://purl.obolibrary.org/obo/OBA_1000039","Shell length","The length of a mollusc shell."],["http://purl.obolibrary.org/obo/OBA_1000040","wood density","Secondary xylem volumetric density. Any measurable or observable characteristic related to the volumetric density of a secondary xylem."],["http://purl.obolibrary.org/obo/OBA_1000075","cytosol color","The color of the part of the cytoplasm that does not contain organelles but which does contain other particulate matter, such as protein complexes."],["http://purl.obolibrary.org/obo/OBA_1000083","nucleus length","A 1D measurement of a nucleus along its longest axis. "],["http://purl.obolibrary.org/obo/OBA_1000084","cell surface texture","A morphologic quality of the external part of the cell wall and/or plasma membrane by virtue of the cell's relative size, organization and distribution of its surface elements or the representation or invention of the appearance of its surface; visual cell surface characteristics."],["http://purl.obolibrary.org/obo/OBA_1000085","nucleus width","A 1D measurement of a nucleus along its shortest axis."],["http://purl.obolibrary.org/obo/OBA_1000092","dinoflagellate cingulum shape","A morphological quality inhering in a dinoflagellate cingulum by virtue of the cingulum's ratios of distances between its features (points, edges, surfaces and also holes etc)."],["http://purl.obolibrary.org/obo/OBA_1000093","sulcus shape","The shape of the sulcus."],["http://purl.obolibrary.org/obo/OBA_1000094","chloroplast shape","Any measurable or observable characteristic related to the shape of a chloroplast."],["http://purl.obolibrary.org/obo/OBA_1000095","chloroplast arrangement","Any measurable or observable characteristic related to the spatial pattern of a chloroplast."],["http://purl.obolibrary.org/obo/OBA_1000096","chloroplast color","Any measurable or observable characteristic related to the color of a chloroplast."],["http://purl.obolibrary.org/obo/OBA_1000097","chloroplast size","Any measurable or observable characteristic related to the size of a chloroplast."],["http://purl.obolibrary.org/obo/OBA_1000098","sulcus width","Any measurable or observable characteristic related to the width of a dinoflagellate sulcus.\r\n"],["http://purl.obolibrary.org/obo/OBA_1000106","skeleton contains","The composition of a skeletal tissue."],["http://purl.obolibrary.org/obo/OBA_1000126","epicone length","Length of the epicone from the cingulum to the apex"],["http://purl.obolibrary.org/obo/OBA_1000127","hypocone length","Length of hypocone from cingulum to antapex"],["http://purl.obolibrary.org/obo/OBA_1000128","eye spot color","Color of the eye spot or stigma"],["http://purl.obolibrary.org/obo/OBA_1000129","cell color","Overall color of a whole cell"],["http://purl.obolibrary.org/obo/OBA_1000131","eye spot location","Location within the cell where the eye spot is located"],["http://purl.obolibrary.org/obo/OBA_1000133","apex shape","The approximate 3D shape of the anterior end of a dinoflagellate cell, typically the point of the epicone, described as one or more geometric solids."],["http://purl.obolibrary.org/obo/OBA_1000134","antapex shape","The approximate 3D shape of the posterior end of a dinoflagellate cell, typically the point of the hypocone, described as one or more geometric solids."],["http://purl.obolibrary.org/obo/OBA_1000135","apical horn shape","Shape of the apical horn"],["http://purl.obolibrary.org/obo/OBA_1000136","antapical horn shape","Shape of the antapical horn. "],["http://purl.obolibrary.org/obo/OBA_VT0001256","body length",""],["http://purl.obolibrary.org/obo/OBA_VT0100005","body size","The size of a multicellular organism"],["http://purl.obolibrary.org/obo/OMIT_0011562","pest control",""],["http://purl.obolibrary.org/obo/OMIT_0013523","macroalga","macroscopic, multicellular, marine algae"],["http://purl.obolibrary.org/obo/PATO_0000050","life span","A time quality inhering in a bearer by virtue of the bearer's expected maximum age."],["http://purl.obolibrary.org/obo/PATO_0000052","shape","A morphological quality inhering in a bearer by virtue of the bearer's ratios of distances between its features (points, edges, surfaces and also holes etc)."],["http://purl.obolibrary.org/obo/PATO_0000128","weight","A physical quality inhering in a bearer that has mass near a gravitational body."],["http://purl.obolibrary.org/obo/PATO_0000273","fecundity","A reproductive quality inhering in an organism or population by virtue of the bearer's potential reproductive capacity and measured by the number of gametes."],["http://purl.obolibrary.org/obo/PATO_0000317","black","A color that lacks any hues as parts. \r\n"],["http://purl.obolibrary.org/obo/PATO_0000318","blue","A color hue with low wavelength of that portion of the visible spectrum lying between green and indigo, evoked in the human observer by radiant energy with wavelengths of approximately 420 to 490 nanometers."],["http://purl.obolibrary.org/obo/PATO_0000320","green","A color hue with medium-low wavelength of that portion of the visible spectrum lying between yellow and blue, evoked in the human observer by radiant energy with wavelengths of approximately 490 to 570 nanometers."],["http://purl.obolibrary.org/obo/PATO_0000322","red","A color hue with high wavelength of the long-wave end of the visible spectrum, evoked in the human observer by radiant energy with wavelengths of approximately 630 to 750 nanometers. "],["http://purl.obolibrary.org/obo/PATO_0000323","white","An achromatic color of maximum brightness; the color of objects that reflect nearly all light of all visible wavelengths. "],["http://purl.obolibrary.org/obo/PATO_0000324","yellow","A color hue with medium wavelength of that portion of the visible spectrum lying between orange and green, evoked in the human observer by radiant energy with wavelengths of approximately 570 to 590 nanometers. "],["http://purl.obolibrary.org/obo/PATO_0000461","medium (normal)","Average.  A quality inhering in a bearer by virtue of the bearer's exhibiting no deviation from normal or average."],["http://purl.obolibrary.org/obo/PATO_0000586","large","A size quality which is relatively high"],["http://purl.obolibrary.org/obo/PATO_0000587","small","A size quality which is relatively low."],["http://purl.obolibrary.org/obo/PATO_0000625","inverted","An oriented quality inhering in a bearer by virtue of the bearer's being reversed in position, order, or condition."],["http://purl.obolibrary.org/obo/PATO_0000911","slow","Decreased rate.  A rate which is relatively low."],["http://purl.obolibrary.org/obo/PATO_0000912","fast","Increased rate.  A rate which is relatively high."],["http://purl.obolibrary.org/obo/PATO_0000915","thickness","A 1-D extent quality which is equal to the dimension through an object as opposed to its length or width"],["http://purl.obolibrary.org/obo/PATO_0000948","heart shaped","A concave 3-D shape quality inhering in a bearer by virtue of the bearer's having a sinus or rounded lobe at the base. "],["http://purl.obolibrary.org/obo/PATO_0000951","purple","A color that falls about midway between red and blue in hue."],["http://purl.obolibrary.org/obo/PATO_0000952","brown","A color consisting of dark orange, red, of very low intensity. "],["http://purl.obolibrary.org/obo/PATO_0000953","orange","A color hue with high-medium wavelength that of that portion of the visible spectrum lying between red and yellow, evoked in the human observer by radiant energy with wavelengths of approximately 585 to 620 nanometers."],["http://purl.obolibrary.org/obo/PATO_0001154","elongated","having length notably greater than width"],["http://purl.obolibrary.org/obo/PATO_0001199","linear","A shape quality inhering in a bearer by virtue of the bearer's being narrow, with the two opposite margins parallel. "],["http://purl.obolibrary.org/obo/PATO_0001603","high life span","Increased life span: A life span which is relatively high."],["http://purl.obolibrary.org/obo/PATO_0001604","low life span","Decreased life span: A life span which is relatively low."],["http://purl.obolibrary.org/obo/PATO_0001709","area",""],["http://purl.obolibrary.org/obo/PATO_0001710","volume",""],["http://purl.obolibrary.org/obo/PATO_0001729","shedability","An organismal quality inhering in a bearer by virtue of the bearer's disposition to lose an entitity by natural process."],["http://purl.obolibrary.org/obo/PATO_0001731","deciduous","Deciduous (plant):  A quality inhering in a plant by virtue of the bearer's disposition to shed foliage. "],["http://purl.obolibrary.org/obo/PATO_0001733","evergreen","Evergreen (plant): A quality inhering in a plant by virtue of the bearer's disposition to retain foliage. "],["http://purl.obolibrary.org/obo/PATO_0001734","semi-deciduous","A quality inhering in a plant by virtue of the bearer's disposition to being between evergeen and deciduous"],["http://purl.obolibrary.org/obo/PATO_0001794","coiling","wound in a continuous series of loops"],["http://purl.obolibrary.org/obo/PATO_0001891","ovate","Egg-shaped; a spheroid quality inhering in a bearer by virtue of the bearer's exhibiting a continuous convex surface with an axis of symmetry and one axis longer than the other."],["http://purl.obolibrary.org/obo/PATO_0001941","yellow green","A color consisting of yellow and green hues."],["http://purl.obolibrary.org/obo/PATO_0001980","digitate","having distinct parts arising from a common point or center. "],["http://purl.obolibrary.org/obo/PATO_0002044","trapezoid","A shape quality inhering in a bearer by virtue of the bearer's being a quadrilateral with two parallel sides."],["http://purl.obolibrary.org/obo/PATO_0002122","mixed","A composition quality inhering in a bearer by virtue of the bearer's being composed of more than one identifiable entities. "],["http://purl.obolibrary.org/obo/PATO_0002124","laminar","having the form of a thin plate sheet or layer."],["http://purl.obolibrary.org/obo/PATO_0002300","increased quality","A quality that has a value that is increased compared to normal or average."],["http://purl.obolibrary.org/obo/PATO_0002301","decreased quality","A quality that has a value that is decreased compared to normal or average"],["http://purl.obolibrary.org/obo/PATO_0002336","pyramidal","Pyramid-shaped; having triangular faces that meet at a common point and containing a polygonal shaped base."],["http://purl.obolibrary.org/obo/PATO_0002343","decumbent","A positional quality inhering in a bearer by virtue of the bearer's lying or growing on the ground but with erect or rising tips. "],["http://purl.obolibrary.org/obo/PATO_0002359","broad","A quality inhering in a bearer by virtue of the bearer's width being notably higher than its length. "],["http://purl.obolibrary.org/obo/PATO_0002389","procumbent","Growing horizontal to the ground without setting roots. \r\n"],["http://purl.obolibrary.org/obo/PATO_0002393","high tolerance","increased tolerance to: A tolerance quality inhering in a bearer by virtue of the bearer's increased ability to endure a stimulus. \r\n"],["http://purl.obolibrary.org/obo/PATO_0002394","low tolerance","decreased tolerance to: A tolerance quality inhering in a bearer by virtue of the bearer's decreased ability to endure a stimulus. "],["http://purl.obolibrary.org/obo/PATO_0002425","exposed","Open to view or not covered by another entity."],["http://purl.obolibrary.org/obo/PATO_0002440","ornamentation","A surface feature shape quality inhering in a bearer by virtue of the degree of the bearer's highly topographical with ridges, pits, rugosity or other surface structures"],["http://purl.obolibrary.org/obo/PATO_0002451","sexually dimorphic","A quality inhering in a bearer by virtue of the bearer's exhibiting a phenotypic difference between males and females of the same species."],["http://purl.obolibrary.org/obo/PATO_0002457","leaf-like","similar in appearance to a leaf"],["http://purl.obolibrary.org/obo/PATO_0002467","lathlike","resembling a thin narrow strip"],["http://purl.obolibrary.org/obo/PORO_0000389","massive growth habit","Large, compact structure without definable shape"],["http://purl.obolibrary.org/obo/PORO_0000436","palmate","Hand shaped"],["http://purl.obolibrary.org/obo/PO_0000037","shoot apex","A shoot axis that is the most distal part of a shoot system and has as parts a shoot apical meristem and the youngest leaf primordia. "],["http://purl.obolibrary.org/obo/PO_0004518","bark","All tissues outside the vascular cambium or the xylem; in older trees may be divided into dead outer bark and living inner bark, which consists of secondary phloem. "],["http://purl.obolibrary.org/obo/PO_0004542","rhizome","A swollen shoot axis that grows horizontally at or below the substrate surface and produces shoots above and roots or rhizoids below."],["http://purl.obolibrary.org/obo/PO_0005848","secondary xylem",""],["http://purl.obolibrary.org/obo/PO_0009001","fruit","A multi-tissue plant structure (PO:0025496) that develops from a gynoecium (PO:0009062) and may have as parts one or more seeds (PO:0009010). \r\n"],["http://purl.obolibrary.org/obo/PO_0009005","roots","root: A plant axis (PO:0025004) that is part of a root system (PO:0025025). "],["http://purl.obolibrary.org/obo/PO_0009010","seed","A multi-tissue plant structure (PO:0025496) that develops from a plant ovule (PO:0020003) and has as parts a plant embryo (PO:0009009) enclosed in a seed coat (PO:0009088). "],["http://purl.obolibrary.org/obo/PO_0020042","simple","A leaf in which the lamina is undivided"],["http://purl.obolibrary.org/obo/PO_0020043","compound","A leaf having two or more distinct leaflets that are evident as such from early in development"],["http://purl.obolibrary.org/obo/PO_0025173","spine-shaped","A leaf that is a sclerified and pointed and lacks a lamina."],["http://purl.obolibrary.org/obo/PO_0025603","resin","plant substance that consists of a complex mixture of organic aromatic compounds such as mono-, sesqui-, and diterpenoids. "],["http://purl.obolibrary.org/obo/RO_0002208","parasitoid of",""],["http://purl.obolibrary.org/obo/RO_0002209","has parasitoid",""],["http://purl.obolibrary.org/obo/RO_0002303","habitat","x has habitat y if: x is an organism, y is a habitat, and y can sustain and allow the growth of a population of x"],["http://purl.obolibrary.org/obo/RO_0002437","interacts with",""],["http://purl.obolibrary.org/obo/RO_0002439","preys on","An interaction relationship involving a predation process, where the subject kills the target in order to eat it or to feed to siblings, offspring or group members"],["http://purl.obolibrary.org/obo/RO_0002440","symbiont of","The smaller partner living in close association with"],["http://purl.obolibrary.org/obo/RO_0002441","commensal with","two organisms living together in more or less intimate association in a relationship in which one benefits and the other is unaffected"],["http://purl.obolibrary.org/obo/RO_0002442","mutualistic with","An interaction relationship between two organisms living together in more or less intimate association in a relationship in which both organisms benefit from each other"],["http://purl.obolibrary.org/obo/RO_0002444","parasite of",""],["http://purl.obolibrary.org/obo/RO_0002445","parasitized by","automatically added during harvest"],["http://purl.obolibrary.org/obo/RO_0002454","has host",""],["http://purl.obolibrary.org/obo/RO_0002458","preyed upon by",""],["http://purl.obolibrary.org/obo/RO_0002459","is vector for",""],["http://purl.obolibrary.org/obo/RO_0002460","has vector",""],["http://purl.obolibrary.org/obo/RO_0002470","eats",""],["http://purl.obolibrary.org/obo/RO_0002471","is eaten by",""],["http://purl.obolibrary.org/obo/RO_0002553","hyperparasite of",""],["http://purl.obolibrary.org/obo/RO_0002554","has hyperparasite",""],["http://purl.obolibrary.org/obo/RO_0002556","pathogen of",""],["http://purl.obolibrary.org/obo/RO_0002557","has pathogen",""],["http://purl.obolibrary.org/obo/RO_0002618","visits",""],["http://purl.obolibrary.org/obo/RO_0002619","visited by",""],["http://purl.obolibrary.org/obo/RO_0002622","visits flowers of",""],["http://purl.obolibrary.org/obo/RO_0002623","flowers visited by",""],["http://purl.obolibrary.org/obo/RO_0002626","kills",""],["http://purl.obolibrary.org/obo/RO_0002627","is killed by",""],["http://purl.obolibrary.org/obo/RO_0002632","ectoparasite of",""],["http://purl.obolibrary.org/obo/RO_0002633","has ectoparasite",""],["http://purl.obolibrary.org/obo/RO_0002634","endoparasite of",""],["http://purl.obolibrary.org/obo/RO_0002635","has endoparasite",""],["http://purl.obolibrary.org/obo/RO_0003000","produces","This organism produces this material or substance, either during its life or after death. A produces B if some process that occurs in A has output B."],["http://purl.obolibrary.org/obo/RO_0003008","RO 0003008","automatically added during harvest"],["http://purl.obolibrary.org/obo/RO_0008503","kleptoparasite of",""],["http://purl.obolibrary.org/obo/RO_0008505","creates habitat for",""],["http://purl.obolibrary.org/obo/RO_0008507","lays eggs on",""],["http://purl.obolibrary.org/obo/RO_0008508","has eggs laid on by",""],["http://purl.obolibrary.org/obo/TO_0000207","plant height","A stature and vigor trait (TO:0000133) which is associated with the height of a whole plant (PO:0000003)."],["http://purl.obolibrary.org/obo/TO_0000276","drought tolerance","Becoming tolerant to drought like conditions of minimal or no water content in the growth environment.\r\n"],["http://purl.obolibrary.org/obo/TO_0000326","leaf color","A vascular leaf anatomy and morphology trait (TO:0000748) which is associated with the color of leaf (PO:0025034)."],["http://purl.obolibrary.org/obo/TO_0000492","leaf shape","A leaf anatomy and morphology trait (TO:0000748) which is associated with the variation in shapes and forms of a leaf (PO:0025034). "],["http://purl.obolibrary.org/obo/TO_0000519","rooting depth","It is calculated from the deepest soil layer where roots were present and the longest root measured in the layer."],["http://purl.obolibrary.org/obo/TO_0000537","flower color","A flower anatomy and morphology trait (TO:0000499) which is associated with the color of the flower (PO:0009046). "],["http://purl.obolibrary.org/obo/TO_0000540","leaf area","A leaf anatomy and morphology trait (TO:0000748) which is associated with the total area of a leaf (PO:0025034)."],["http://purl.obolibrary.org/obo/TO_0000598","protein content","The total protein content measured in a body or body part"],["http://purl.obolibrary.org/obo/TO_0000602","lipid content","The total fat or lipid content present in a body part"],["http://purl.obolibrary.org/obo/TO_0000624","allelopathic effect","This is an assay of any direct or indirect, harmful or beneficial effect of one plant on another through the production of chemical compounds (allelochemicals) that escape in the environment."],["http://purl.obolibrary.org/obo/TO_0000850","fruit type","A fruit anatomy and morphology trait (TO:0002629) which is associated with the type of a fruit (PO:0009001). "],["http://purl.obolibrary.org/obo/TO_0001015","photosynthetic rate","The total amount of carbon fixed by the plant per unit time"],["http://purl.obolibrary.org/obo/TO_0001026","respiratory rate","The total amount of oxygen consumed or carbon lost metabolically per unit time"],["http://purl.obolibrary.org/obo/TO_0002725","life cycle habit","Determined for type of life cycle being annual, binneal, perennial etc."],["http://purl.obolibrary.org/obo/TO_0006001","salt tolerance","Tolerance to the high salt content in the growth medium."],["http://purl.obolibrary.org/obo/UBERON_0000022","feather","One of the epidermal growths that form the distinctive outer covering, or plumage, on birds. Feathers are formed in tiny follicles in the epidermis, or outer skin layer, that produce keratin proteins."],["http://purl.obolibrary.org/obo/UBERON_0000107","cleavage stage","The first few specialized divisions of an activated animal egg; Stage consisting of division of cells in the early embryo. The zygotes of many species undergo rapid cell cycles with no significant growth, producing a cluster of cells the same size as the original zygote. The different cells derived from cleavage are called blastomeres and form a compact mass called the morula. Cleavage ends with the formation of the blastula."],["http://purl.obolibrary.org/obo/UBERON_0000970","eyes","An organ that detects light."],["http://purl.obolibrary.org/obo/UBERON_0002104","visual system","The sensory system subserving the sense of vision."],["http://purl.obolibrary.org/obo/UBERON_0008260","spines","A hard, thorny or needle-like structure which occurs on various organisms. Animals such as porcupines and sea urchins grow spines as a self-defense mechanism"],["http://purl.obolibrary.org/obo/UBERON_0010362","endoskeleton","internal support structure of an animal, composed of mineralized tissue."],["http://purl.obolibrary.org/obo/UBERON_0036016","honey","A sweet viscid material elaborated out of the nectar of flowers in the honey sac of various bees."],["http://purl.obolibrary.org/obo/UBERON_4000013","mineralized tissue contains","Component found in mineralized tissue, (a specialized form of biogenic tissue in which the extracellular matrix is mineralized)"],["http://purl.obolibrary.org/obo/UO_0010006","ratio","A dimensionless ratio unit"],["http://purl.obolibrary.org/obo/VT_0001256","body length","The distance from point to point along the longest axis of the body of an organism."],["http://purl.obolibrary.org/obo/VT_0001259","body mass","The amount of matter in the body of an organism."],["http://purl.obolibrary.org/obo/VT_0001502","behavioral circadian rhythm","Any measurable or observable behavioral characteristic related to a daily biological activity cycle."],["http://purl.obolibrary.org/obo/VT_0001661","total life span","The full period of time from birth to death of an organism."],["http://purl.obolibrary.org/obo/VT_0001933","clutch/brood/litter size","Single birth offspring quantity.  The proportion or number of offspring produced from a single pregnancy (mammals) or ovulation (fish) or nesting (birds)."],["http://purl.obolibrary.org/obo/VT_0002292","gestation period duration","The length of time between when a fertilized egg implants in the wall of the uterus and the birth of offspring."],["http://purl.obolibrary.org/obo/VT_0002683","onset of fertility","The age at which an organism develops the ability to produce live offspring."],["http://purl.obolibrary.org/obo/VT_0002758","tail length","The distance from point to point along the longest axis of the appendage at the caudal end of the vertebral column."],["http://purl.obolibrary.org/obo/VT_0004348","femur length","The distance from point to point along the longest axis of the long bone of the thigh."],["http://purl.obolibrary.org/obo/VT_0010023","forelimb length","The distance from point to point along the longest axis of the anterior/superior jointed appendages used for locomotion or grasping."],["http://purl.obolibrary.org/obo/VT_0015039","body width","The distance from side to side of the body of an organism, perpendicular to the axis along which height is measured."],["http://purl.obolibrary.org/obo/VT_1000666","femur width","The distance from side to side of the long bone of the thigh."],["http://purl.org/obo/owlATOL_0001658","Fork length","length of a fish from the tip of the snout to the end of the middle caudal fin rays"],["http://purl.org/obo/owlATOL_0001659","Standard length","length of a fish measured from the tip of the snout to the posterior end of the last vertebra or to the posterior end of the midlateral portion of the hypural plate. Simply put, this measurement excludes the length of the caudal fin"],["http://purl.org/obo/owlATOL_0001660","total length","length from the tip of the snout to the tip of the longer lobe of the caudal fin, usually measured with the lobes compressed along the midline. It is a straight-line measure, not measured over the curve of the body"],["http://resource.geosciml.org/classifier/ics/ischart/Aalenian","Aalenian Age",""],["http://resource.geosciml.org/classifier/ics/ischart/Aeronian","Aeronian Age",""],["http://resource.geosciml.org/classifier/ics/ischart/Albian","Albian Age",""],["http://resource.geosciml.org/classifier/ics/ischart/Anisian","Anisian Age",""],["http://resource.geosciml.org/classifier/ics/ischart/Aptian","Aptian Age",""],["http://resource.geosciml.org/classifier/ics/ischart/Aquitanian","Aquitanian Age",""],["http://resource.geosciml.org/classifier/ics/ischart/Artinskian","Artinskian Age",""],["http://resource.geosciml.org/classifier/ics/ischart/Asselian","Asselian Age",""],["http://resource.geosciml.org/classifier/ics/ischart/Bajocian","Bajocian Age",""],["http://resource.geosciml.org/classifier/ics/ischart/Barremian","Barremian Age",""],["http://resource.geosciml.org/classifier/ics/ischart/Bartonian","Bartonian Age",""],["http://resource.geosciml.org/classifier/ics/ischart/Bashkirian","Bashkirian Age",""],["http://resource.geosciml.org/classifier/ics/ischart/Bathonian","Bathonian Age",""],["http://resource.geosciml.org/classifier/ics/ischart/Berriasian","Berriasian Age",""],["http://resource.geosciml.org/classifier/ics/ischart/Burdigalian","Burdigalian Age",""],["http://resource.geosciml.org/classifier/ics/ischart/Calabrian","Calabrian Age",""],["http://resource.geosciml.org/classifier/ics/ischart/Callovian","Callovian Age",""],["http://resource.geosciml.org/classifier/ics/ischart/Cambrian","Cambrian Period",""],["http://resource.geosciml.org/classifier/ics/ischart/CambrianSeries2","Cambrian Series 2 Epoch",""],["http://resource.geosciml.org/classifier/ics/ischart/CambrianSeries3","Cambrian Series 3 Epoch",""],["http://resource.geosciml.org/classifier/ics/ischart/CambrianStage10","Cambrian Stage 10 Age",""],["http://resource.geosciml.org/classifier/ics/ischart/CambrianStage3","Cambrian Stage 3 Age",""],["http://resource.geosciml.org/classifier/ics/ischart/CambrianStage4","Cambrian Stage 4 Age",""],["http://resource.geosciml.org/classifier/ics/ischart/CambrianStage5","Cambrian Stage 5 Age",""],["http://resource.geosciml.org/classifier/ics/ischart/Campanian","Campanian Age",""],["http://resource.geosciml.org/classifier/ics/ischart/Capitanian","Capitanian Age",""],["http://resource.geosciml.org/classifier/ics/ischart/Carboniferous","Carboniferous Period",""],["http://resource.geosciml.org/classifier/ics/ischart/Carnian","Carnian Age",""],["http://resource.geosciml.org/classifier/ics/ischart/Cenomanian","Cenomanian Age",""],["http://resource.geosciml.org/classifier/ics/ischart/Cenozoic","Cenozoic Era",""],["http://resource.geosciml.org/classifier/ics/ischart/Changhsingian","Changhsingian Age",""],["http://resource.geosciml.org/classifier/ics/ischart/Chattian","Chattian Age",""],["http://resource.geosciml.org/classifier/ics/ischart/Cisuralian","Cisuralian Epoch",""],["http://resource.geosciml.org/classifier/ics/ischart/Coniacian","Coniacian Age",""],["http://resource.geosciml.org/classifier/ics/ischart/Cretaceous","Cretaceous Period",""],["http://resource.geosciml.org/classifier/ics/ischart/Cryogenian","Cryogenian Period",""],["http://resource.geosciml.org/classifier/ics/ischart/Danian","Danian Age",""],["http://resource.geosciml.org/classifier/ics/ischart/Dapingian","Dapingian Age",""],["http://resource.geosciml.org/classifier/ics/ischart/Darriwilian","Darriwilian Age",""],["http://resource.geosciml.org/classifier/ics/ischart/Devonian","Devonian Period",""],["http://resource.geosciml.org/classifier/ics/ischart/Drumian","Drumian Age",""],["http://resource.geosciml.org/classifier/ics/ischart/Ediacaran","Ediacaran Period",""],["http://resource.geosciml.org/classifier/ics/ischart/Eifelian","Eifelian Age",""],["http://resource.geosciml.org/classifier/ics/ischart/Emsian","Emsian Age",""],["http://resource.geosciml.org/classifier/ics/ischart/Eocene","Eocene Epoch",""],["http://resource.geosciml.org/classifier/ics/ischart/Famennian","Famennian Age",""],["http://resource.geosciml.org/classifier/ics/ischart/Floian","Floian Age",""],["http://resource.geosciml.org/classifier/ics/ischart/Fortunian","Fortunian Age",""],["http://resource.geosciml.org/classifier/ics/ischart/Frasnian","Frasnian Age",""],["http://resource.geosciml.org/classifier/ics/ischart/Furongian","Furongian Epoch",""],["http://resource.geosciml.org/classifier/ics/ischart/Gelasian","Gelasian Age",""],["http://resource.geosciml.org/classifier/ics/ischart/Givetian","Givetian Age",""],["http://resource.geosciml.org/classifier/ics/ischart/Gorstian","Gorstian Age",""],["http://resource.geosciml.org/classifier/ics/ischart/Guadalupian","Guadalupian Epoch",""],["http://resource.geosciml.org/classifier/ics/ischart/Guzhangian","Guzhangian Age",""],["http://resource.geosciml.org/classifier/ics/ischart/Gzhelian","Gzhelian Age",""],["http://resource.geosciml.org/classifier/ics/ischart/Hauterivian","Hauterivian Age",""],["http://resource.geosciml.org/classifier/ics/ischart/Hettangian","Hettangian Age",""],["http://resource.geosciml.org/classifier/ics/ischart/Hirnantian","Hirnantian Age",""],["http://resource.geosciml.org/classifier/ics/ischart/Holocene","Holocene Epoch",""],["http://resource.geosciml.org/classifier/ics/ischart/Homerian","Homerian Age",""],["http://resource.geosciml.org/classifier/ics/ischart/Induan","Induan Age",""],["http://resource.geosciml.org/classifier/ics/ischart/Jiangshanian","Jiangshanian Age",""],["http://resource.geosciml.org/classifier/ics/ischart/Jurassic","Jurassic Period",""],["http://resource.geosciml.org/classifier/ics/ischart/Kasimovian","Kasimovian Age",""],["http://resource.geosciml.org/classifier/ics/ischart/Katian","Katian Age",""],["http://resource.geosciml.org/classifier/ics/ischart/Kimmeridgian","Kimmeridgian Age",""],["http://resource.geosciml.org/classifier/ics/ischart/Kungurian","Kungurian Age",""],["http://resource.geosciml.org/classifier/ics/ischart/Ladinian","Ladinian Age",""],["http://resource.geosciml.org/classifier/ics/ischart/Langhian","Langhian Age",""],["http://resource.geosciml.org/classifier/ics/ischart/Llandovery","Llandovery Epoch",""],["http://resource.geosciml.org/classifier/ics/ischart/Lochkovian","Lochkovian Age",""],["http://resource.geosciml.org/classifier/ics/ischart/Lopingian","Lopingian Epoch",""],["http://resource.geosciml.org/classifier/ics/ischart/LowerCretaceous","Lower Cretaceous Epoch",""],["http://resource.geosciml.org/classifier/ics/ischart/LowerDevonian","Lower Devonian Epoch",""],["http://resource.geosciml.org/classifier/ics/ischart/LowerJurassic","Lower Jurassic Epoch",""],["http://resource.geosciml.org/classifier/ics/ischart/LowerOrdovician","Lower Ordovician Epoch",""],["http://resource.geosciml.org/classifier/ics/ischart/LowerTriassic","Lower Triassic Epoch",""],["http://resource.geosciml.org/classifier/ics/ischart/Ludfordian","Ludfordian Age",""],["http://resource.geosciml.org/classifier/ics/ischart/Ludlow","Ludlow Epoch",""],["http://resource.geosciml.org/classifier/ics/ischart/Lutetian","Lutetian Age",""],["http://resource.geosciml.org/classifier/ics/ischart/Maastrichtian","Maastrichtian Age",""],["http://resource.geosciml.org/classifier/ics/ischart/Mesozoic","Mesozoic Era",""],["http://resource.geosciml.org/classifier/ics/ischart/Messinian","Messinian Age",""],["http://resource.geosciml.org/classifier/ics/ischart/MiddleDevonian","Middle Devonian Epoch",""],["http://resource.geosciml.org/classifier/ics/ischart/MiddleJurassic","Middle Jurassic Epoch",""],["http://resource.geosciml.org/classifier/ics/ischart/MiddleOrdovician","Middle Ordovician Epoch",""],["http://resource.geosciml.org/classifier/ics/ischart/MiddlePleistocene","Middle Pleistocene Age",""],["http://resource.geosciml.org/classifier/ics/ischart/MiddleTriassic","Middle Triassic Epoch",""],["http://resource.geosciml.org/classifier/ics/ischart/Miocene","Miocene Epoch",""],["http://resource.geosciml.org/classifier/ics/ischart/Mississippian","Mississippian Sub-period",""],["http://resource.geosciml.org/classifier/ics/ischart/Moscovian","Moscovian Age",""],["http://resource.geosciml.org/classifier/ics/ischart/Neogene","Neogenen Period",""],["http://resource.geosciml.org/classifier/ics/ischart/Neoproterozoic","Neoproterozoic Era",""],["http://resource.geosciml.org/classifier/ics/ischart/Norian","Norian Age",""],["http://resource.geosciml.org/classifier/ics/ischart/Olenekian","Olenekian Age",""],["http://resource.geosciml.org/classifier/ics/ischart/Oligocene","Oligocene Epoch",""],["http://resource.geosciml.org/classifier/ics/ischart/Ordovician","Ordovician Period",""],["http://resource.geosciml.org/classifier/ics/ischart/Oxfordian","Oxfordian Age",""],["http://resource.geosciml.org/classifier/ics/ischart/Paleoarchean","Paleoarchean Era",""],["http://resource.geosciml.org/classifier/ics/ischart/Paleocene","Paleocene Epoch",""],["http://resource.geosciml.org/classifier/ics/ischart/Paleogene","Paleogene Period",""],["http://resource.geosciml.org/classifier/ics/ischart/Paleozoic","Paleozoic Era",".."],["http://resource.geosciml.org/classifier/ics/ischart/Pennsylvanian","Pennsylvanian Sub-period",""],["http://resource.geosciml.org/classifier/ics/ischart/Permian","Permian Era",""],["http://resource.geosciml.org/classifier/ics/ischart/Phanerozoic","Phanerozoic Eon",""],["http://resource.geosciml.org/classifier/ics/ischart/Piacenzian","Piacenzian Age",""],["http://resource.geosciml.org/classifier/ics/ischart/Pleistocene","Pleistocene Epoch",""],["http://resource.geosciml.org/classifier/ics/ischart/Pliensbachian","Pliensbachian Age",""],["http://resource.geosciml.org/classifier/ics/ischart/Pliocene","Pliocene Epoch",""],["http://resource.geosciml.org/classifier/ics/ischart/Pragian","Pragian Age",""],["http://resource.geosciml.org/classifier/ics/ischart/Priabonian","Priabonian Age",""],["http://resource.geosciml.org/classifier/ics/ischart/Pridoli","Pridoli Epoch",""],["http://resource.geosciml.org/classifier/ics/ischart/Rhaetian","Rhaetian Age",""],["http://resource.geosciml.org/classifier/ics/ischart/Rhuddanian","Rhuddanian Age",""],["http://resource.geosciml.org/classifier/ics/ischart/Rhyacian","Rhyacian Period",""],["http://resource.geosciml.org/classifier/ics/ischart/Roadian","Roadian Age",""],["http://resource.geosciml.org/classifier/ics/ischart/Rupelian","Rupelian Age",""],["http://resource.geosciml.org/classifier/ics/ischart/Sakmarian","Sakmarian Age",""],["http://resource.geosciml.org/classifier/ics/ischart/Sandbian","Sandbian Age",""],["http://resource.geosciml.org/classifier/ics/ischart/Santonian","Santonian Age",""],["http://resource.geosciml.org/classifier/ics/ischart/Selandian","Selandian Age",""],["http://resource.geosciml.org/classifier/ics/ischart/Serpukhovian","Serpukhovian Age",""],["http://resource.geosciml.org/classifier/ics/ischart/Serravallian","Serravallian Age",""],["http://resource.geosciml.org/classifier/ics/ischart/Sheinwoodian","Sheinwoodian Age",""],["http://resource.geosciml.org/classifier/ics/ischart/Silurian","Silurian Period",""],["http://resource.geosciml.org/classifier/ics/ischart/Sinemurian","Sinemurian Age",""],["http://resource.geosciml.org/classifier/ics/ischart/Statherian","Statherian Period",""],["http://resource.geosciml.org/classifier/ics/ischart/Telychian","Telychian Age",""],["http://resource.geosciml.org/classifier/ics/ischart/Terreneuvian","Terreneuvian Epoch",""],["http://resource.geosciml.org/classifier/ics/ischart/Thanetian","Thanetian Age",""],["http://resource.geosciml.org/classifier/ics/ischart/Tithonian","Tithonian Age",""],["http://resource.geosciml.org/classifier/ics/ischart/Toarcian","Toarcian Age",""],["http://resource.geosciml.org/classifier/ics/ischart/Tortonian","Tortonian Age",""],["http://resource.geosciml.org/classifier/ics/ischart/Tournaisian","Tournaisian Age",""],["http://resource.geosciml.org/classifier/ics/ischart/Tremadocian","Tremadocian Age",""],["http://resource.geosciml.org/classifier/ics/ischart/Triassic","Triassic Period",""],["http://resource.geosciml.org/classifier/ics/ischart/Turonian","Turonian Age",""],["http://resource.geosciml.org/classifier/ics/ischart/UpperCretaceous","Upper Cretaceous Epoch",""],["http://resource.geosciml.org/classifier/ics/ischart/UpperDevonian","Upper Devonian Epoch",""],["http://resource.geosciml.org/classifier/ics/ischart/UpperJurassic","Upper Jurassic Epoch",""],["http://resource.geosciml.org/classifier/ics/ischart/UpperOrdovician","Upper Ordovician Epoch",""],["http://resource.geosciml.org/classifier/ics/ischart/UpperPleistocene","Upper Pleistocene Age",""],["http://resource.geosciml.org/classifier/ics/ischart/UpperTriassic","Upper Triassic Epoch",""],["http://resource.geosciml.org/classifier/ics/ischart/Valanginian","Valanginian Age",""],["http://resource.geosciml.org/classifier/ics/ischart/Visean","Visean Age",""],["http://resource.geosciml.org/classifier/ics/ischart/Wenlock","Wenlock Epoch",""],["http://resource.geosciml.org/classifier/ics/ischart/Wordian","Wordian Age",""],["http://resource.geosciml.org/classifier/ics/ischart/Wuchiapingian","Wuchiapingian Age",""],["http://resource.geosciml.org/classifier/ics/ischart/Ypresian","Ypresian Age",""],["http://resource.geosciml.org/classifier/ics/ischart/Zanclean","Zanclean Age",""],["http://rs.tdwg.org/dwc/terms/decimalLatitude","latitude","The geographic latitude (in decimal degrees, using the spatial reference system given in geodeticDatum) of the geographic center of a Location. Positive values are north of the Equator, negative values are south of it. Legal values lie between -90 and 90, inclusive."],["http://rs.tdwg.org/dwc/terms/decimalLongitude","longitude","The geographic longitude (in decimal degrees, using the spatial reference system given in geodeticDatum) of the geographic center of a Location. Positive values are east of the Greenwich Meridian, negative values are west of it. Legal values lie between -180 and 180, inclusive."],["http://rs.tdwg.org/dwc/terms/habitat","habitat","A category or description of the habitat in which the Event occurred."],["http://rs.tdwg.org/dwc/terms/verbatimDepth","water depth","The depth of seawater at a location where this organism has been observed or collected."],["http://rs.tdwg.org/dwc/terms/verbatimElevation","elevation","The original description of the elevation (altitude, usually above sea level) of the Location."],["http://rs.tdwg.org/ontology/voc/SPMInfoItems#ConservationStatus","conservation status","degree of conservation concern as assessed by a government agency or other recognized authority such as IUCN or CITES"],["http://rs.tdwg.org/ontology/voc/SPMInfoItems#Distribution","entire geographic distribution","A description of the geographic distribution, or range, of the taxon. Includes descriptions of global, regional, or political aspects of range and whether the taxon is native or introduced in portions of the range and endemicity."],["http://sweet.jpl.nasa.gov/2.3/humanAgriculture.owl#Horticulture","horticulture","Horticulture is the art and science of the cultivation of plants"],["http://sweet.jpl.nasa.gov/2.3/matrSediment.owl#Debris","debris",""],["http://top-thesaurus.org/annotationInfo?viz=1\u0026\u0026trait=Leaf_mass_per_area ","Leaf mass per area","the ratio of the dry mass of a leaf to its area"],["http://top-thesaurus.org/annotationInfo?viz=1\u0026\u0026trait=Leaf_nitrogen_content_per_leaf_dry_mass","Leaf nitrogen per dry mass","The ratio of the quantity of nitrogen in the leaf or component thereof, i.e. leaf lamina or leaflet, per respective unit dry mass"],["http://top-thesaurus.org/annotationInfo?viz=1\u0026\u0026trait=Leaflet_lamina_area","Leaf lamina area","the area of the leaflet lamina in the one sided projection"],["http://top-thesaurus.org/annotationInfo?viz=1\u0026\u0026trait=Plant_height_vegetative","Vegetative plant height","the plant height considering the highest vegetative component"],["http://top-thesaurus.org/annotationInfo?viz=1\u0026\u0026trait=Seed_dry_mass","seed dry mass","the mass of a seed, assessed after drying"],["http://top-thesaurus.org/annotationInfo?viz=1\u0026\u0026trait=Stem_specific_density","Stem specific density","the ratio of the mass of the stem or an unit thereof assessed after drying, to its volume assessed without drying"],["http://top-thesaurus.org/annotationInfo?viz=1\u0026trait=Woodiness","woodiness","a feature of the whole plant, defining the occurrence and distribution of wood (secondary xylem) along the stem"],["http://www.ebi.ac.uk/efo/EFO_0004820","population sex ratio",""],["http://www.marinespecies.org/traits/Epifaunal","epifaunal","An animal living on the surface of the substratum."],["http://www.marinespecies.org/traits/ExternalTube","external tube","A built-structure inhabited by an organism and essential to its survival, but not part of its body, composed of hardened (either rigid or flexible) secretions, with or without the addition of embedded particles, with those particles either selectively collected from the environment or passively becoming glued during formation (pers. comm. Read, G.)."],["http://www.marinespecies.org/traits/Hydrostatic","Hydrostatic skeleton","Skeletal support provided by hydrostatic pressure from a fluid filled cavity (e.g. the coelum) surrounded by muscles. Hydrostatic pressure provides skeletal support in sea anemones, jellyfish, nematodes, annelids, echinoderms, and other groups."],["http://www.marinespecies.org/traits/Infaunal","infaunal","Benthic animals which live within the seabed."],["http://www.marinespecies.org/traits/Nekton","nectonic","Active swimming organisms that live in the water column and are able to move independently of the water mass (adapted from Lincoln et al., 1998)."],["http://www.marinespecies.org/traits/NonSolidCement","cement","component that keeps the agglutinated particles of the non-massive skeleton together."],["http://www.marinespecies.org/traits/NonSolidParticlesComp","particulate skeleton (non-solid)","small and individual structural elements that function as supporting structure/enclosure, e.g. spicules in sponges."],["http://www.marinespecies.org/traits/Plankton﻿","planktonic","Living in a fluid medium (eg: water) but unable to maintain their position or distribution independently of the movement of the fluid (adapted from Lincoln et al., 1998)."],["http://www.marinespecies.org/traits/SupportingStructuresEnclosures","Supporting Structures and Enclosures","Hard framework, internal or external, which supports and protects softer parts of plant, animal or unicellular organism, and to which muscles usually attach in animals, includes skeletons (derived from Lawrence, 2005)."],["http://www.nucleodiversus.org/index.php?mod=caracter\u0026id=17","Specific leaf area","the one-sided area of a fresh leaf, divided by its oven-dry mass"],["http://www.owl-ontologies.com/unnamed.owl#Dimorphism","sexual dimorphism","Sexual dimorphism is a phenotypic difference between males and females of the same species. The prototypical example is for differences in characteristics of reproductive organs. Other possible examples are for secondary sex characteristics, body size and morphology, ornamentation and behavior."],["http://www.wikidata.org/entity/Q1053008","trophic level","position of an organism in a food web. May be described verbally with descriptors including primary producer, herbivore or carnivore. If described numerically, 1 indicates a primary producer, 2 a herbivore, and so on up the food web."],["http://www.wikidata.org/entity/Q1818052","Schmidt Sting Pain Index","Insect pain scale described by Justin O. Schmidt using a scale from 0 (no pain) to 4 (traumatically painful), with half point intervals."],["http://www.wikidata.org/entity/Q245097","wingspan",""],["http://www.wikidata.org/entity/Q33596","motility","ability to move spontaneously and actively, consuming energy in the process"],["https://eol.org/schema/terms/adventive","adventive in","A possibly ambiguous term used to describe the presence of the taxon in a region. Common definitions include newly arrived; vagrant; in flux. May or may not have been introduced by human activity."],["https://eol.org/schema/terms/ampharetid_feeder","Ampharetid feeder","a carnivore that feeds primarily on ampharetid worms (Ampharetidae)"],["https://eol.org/schema/terms/anal_dorsal_fins","anal and dorsal fin swimming","swimming mainly using undulations of anal and dorsal fins"],["https://eol.org/schema/terms/anal_fin","anal fin swimming","swimming mainly using undulations of the anal fin"],["https://eol.org/schema/terms/andromonoecious","andromonoecious","having both bisexual and male flowers on the same plant"],["https://eol.org/schema/terms/anguilliform","anguilliform","Body/caudal fin propulsion, with little increase in the amplitude of the flexion wave as it passes along the body"],["https://eol.org/schema/terms/benthic_diatom_feeder","benthic diatom feeder","a consumer that feeds primarily on benthic diatoms"],["https://eol.org/schema/terms/bipedal_running","bipedal running","terrestrial locomotion where an organism moves by means of its two rear limbs or legs, such that periodically neither of the limbs are touching the ground"],["https://eol.org/schema/terms/body_caudal_fin","body/caudal fin propulsion","swimming by generating thrust using lateral movements of their body and caudal fin. Most fishes use this type of propulsion"],["https://eol.org/schema/terms/brittlestar_feeder","brittle-star feeder","a carnivore that feeds primarily on brittle-stars"],["https://eol.org/schema/terms/burrowDepth","burrow depth","Depth within soil, sediment or rock that a burrow of this species is typically located."],["https://eol.org/schema/terms/burrowDiameter","burrow diameter","diameter of the cross section of a burrow in soil, sediment or rock, presumed to represent a measure of body size of the burrow occupant, orthogonal to length (~body depth or width)"],["https://eol.org/schema/terms/burrow_builder","burrow builder","an animal that excavates holes or tunnels into soil or benthic sediment to create a space suitable for habitation, temporary refuge, or as a byproduct of locomotion. Inhabited burrows function as a refuge, protecting the inhabitants from predation and environmental extremes. They provide physical support for the digging and feeding activities of the burrow inhabitants. The harsh chemical environment deep in aquatic burrows must be counteracted by active or passive irrigation of burrow water.  "],["https://eol.org/schema/terms/carangiform","carangiform","Body/caudal fin propulsion, with the vast majority of movement is concentrated in the very rear of the body and tail. Carangiform swimmers generally have rapidly oscillating tails."],["https://eol.org/schema/terms/carcharhiniform","carcharhiniform","Body/caudal fin propulsion, retaining eel-like body movements and exploiting interactions between the sidewash from an anterior median fin with the next posterior fin, increasing its effective angle of attack"],["https://eol.org/schema/terms/cell_sucker","cell-sucker","A consumer that feeds by piercing and sucking fluid from individual cells, of either a single celled or a multicelled organism"],["https://eol.org/schema/terms/crab_feeder","crab feeder","a consumer that feeds primarily on crabs, Brachyura."],["https://eol.org/schema/terms/crinoid_feeder","crinoid feeder","a carnivore that feeds primarily on crinoids"],["https://eol.org/schema/terms/crustacean_feeder","crustacean feeder","a carnivore that feeds primarily on crustaceans"],["https://eol.org/schema/terms/cultivated_in","cultivated in","This organism is cultivated (populations grown with the aid of human effort or technology) in the following region(s)"],["https://eol.org/schema/terms/diatom_feeder","diatom feeder","a consumer that feeds primarily on diatoms"],["https://eol.org/schema/terms/dioicous","dioicous","In the haploid (gametophyte) lifestage of a moss or fern, the antheridia (male) and archegonia (female) reproductive organs occur on different individual plants"],["https://eol.org/schema/terms/domesticated_in","domesticated in","Location where this organism was originally domesticated"],["https://eol.org/schema/terms/dorsal_fin","dorsal fin swimming","swimming mainly using undulations of the dorsal fin"],["https://eol.org/schema/terms/dorsoventral_undulatory","dorso-ventral undulatory swimming","swimming by generating thrust using dorso-ventral undulations of the body. "],["https://eol.org/schema/terms/dracaenoid","Dracaenoid","wood-like secondary growth found in monocots, supporting tree growth forms, as in the genus Dracaena, the Dragon Trees"],["https://eol.org/schema/terms/drag_based_swimming","drag powered swimming","Drag swimmers use a cyclic motion where they push water back in a power stroke, and return their limb forward in the return or recovery stroke. When they push water directly backwards, this moves their body forward, but as they return their limbs to the starting position, they push water forward, which will thus pull them back to some degree, and so opposes the direction that the body is heading. This opposing force is called drag. The return-stroke drag causes drag swimmers to employ different strategies than lift swimmers. Reducing drag on the return stroke is essential for optimizing efficiency."],["https://eol.org/schema/terms/duodichogamous","duodichogamous","monoecious (separate male and female flowers are always found on the same plant) with sequential cohorts of flowers, alternating sex in a sequence of male, then female, then male flowers"],["https://eol.org/schema/terms/eel_feeder","eel feeder","a carnivore that feeds primarily on eels (Anguilliformes)"],["https://eol.org/schema/terms/elasmobranch_feeder","elasmobranch feeder","a carnivore that feeds primarily on cartilaginous fishes (elasmobranchs)"],["https://eol.org/schema/terms/fixes","fixes","Captures an element from the air and incorporates it into its biochemistry"],["https://eol.org/schema/terms/foram_feeder","foram feeder","a consumer that feeds primarily on foraminifera"],["https://eol.org/schema/terms/freshwater_animals","freshwater animals","animals naturally inhabiting freshwater"],["https://eol.org/schema/terms/freshwater_benthic","freshwater benthic","freshwater benthic (benthic meaning 'bottom') habitat includes lakebeds, river beds, and the bottoms of all freshwater bodies"],["https://eol.org/schema/terms/freshwater_carnivore","freshwater carnivore","A consumer that feeds primarily on freshwater animals"],["https://eol.org/schema/terms/freshwater_decapods","freshwater decapods","decapods naturally inhabiting freshwater"],["https://eol.org/schema/terms/hagfish_feeder","hagfish feeder","a carnivore that feeds primarily on hagfishes (Myxiniformes)"],["https://eol.org/schema/terms/harvested_in","harvested in","This organism is caught or collected, and put to human use, in the following region(s)"],["https://eol.org/schema/terms/labile_material_feeder","labile material feeder","consumers specializing in labile organic matter, which is easily metabolized; usually low molecular weight compounds, eg: simple sugars or proteins. For instance, metabolic scaling puts intense selective pressure on small organisms to ingest foods rich in labile organic matter; the residence time in a very short gut is too brief for enzymatic hydrolysis, so they specialize in rapidly metabolizable compounds."],["https://eol.org/schema/terms/lift_based_swimming","lift powered swimming","Hydrofoils, or fins, are used to push against the water to create a normal force to provide thrust, propelling the animal through water. The reduction of fin cross-sectional area helps to minimize drag, and therefore increase efficiency. Regardless of size of the animal, at any particular speed, maximum possible lift is proportional to (wing area) x (speed)\u003csup\u003e2\u003c/sup\u003e. Dolphins and whales have large, horizontal caudal hydrofoils, while many fish and sharks have vertical caudal hydrofoils."],["https://eol.org/schema/terms/marineChemosyntheticHabitat","chemosynthetic habitat","marine environments supporting chemosynthetic life, for instance, hydrothermal vents and seeps, whalefalls"],["https://eol.org/schema/terms/marine_animals","marine animals",""],["https://eol.org/schema/terms/marine_carnivore","marine carnivore","A consumer that feeds primarily on marine animals"],["https://eol.org/schema/terms/median_paired_fin","median/paired fin propulsion","swimming mainly using undulations of median and paired fins"],["https://eol.org/schema/terms/microalgae","microalgae","microscopic algae, typically found in freshwater and marine systems, living in both the water column and sediment. They are unicellular species which exist individually, or in chains or groups."],["https://eol.org/schema/terms/mineralizedSkeletonContains","mineralized skeleton contains","Component found in mineralized skeletal tissue, (a specialized form of biogenic tissue in which the extracellular matrix is mineralized, and which functions in mechanical and structural support.)"],["https://eol.org/schema/terms/mobile_prey_feeder","mobile prey feeder","preys on organisms that move habitually, of their own volition"],["https://eol.org/schema/terms/monoicous","monoicous","In the haploid (gametophyte) lifestage of a moss or fern, the antheridia (male) and archegonia (female) reproductive organs occur on the same individual plant. They may be borne on different shoots (autoicous), on the same shoot but not together in a common structure (paroicous), or together in a common \"inflorescence\" (synoicous)."],["https://eol.org/schema/terms/mucus_gliding","mucus mediated gliding","muscular waves propelling an animal over a mucus layer overlaying the substrate; alternating regions of muscular contraction and expansion create traveling waves that shear the mucus, resulting in translation of the animal."],["https://eol.org/schema/terms/neuston","neuston","Small aquatic organisms inhabiting the surface layer or moving on the surface film."],["https://eol.org/schema/terms/omnidirectional","omnidirectional","existing in every direction"],["https://eol.org/schema/terms/omnivoreCarnivore","omnivore-carnivore","An omnivorous animal that usually or preferentially feeds on animals"],["https://eol.org/schema/terms/optimal_rainfall","optimal rainfall","rainfall required for survival and growth"],["https://eol.org/schema/terms/ostraciiform","ostraciiform","Body/caudal fin propulsion, with no appreciable body wave when they employ caudal locomotion. Only the tail fin itself oscillates (often very rapidly) to create thrust. Typical of the Ostraciidae"],["https://eol.org/schema/terms/palmeiral","Palmeiral","palm tree woodland"],["https://eol.org/schema/terms/pectoral_fins","pectoral fin swimming","swimming mainly using undulations of the pectoral fins"],["https://eol.org/schema/terms/pectoral_oscillation","pectoral fin oscillation","a type of pectoral-fin-based swimming, also known as mobuliform locomotion. Lower frequency than fin undulation; can be described as the production of less than half a wave on the fin, similar to a bird wing flapping. Pelagic stingrays use oscillatory locomotion."],["https://eol.org/schema/terms/polygamodioecious","polygamodioecious","mostly dioecious, but with either a few flowers of the opposite sex or a few bisexual flowers on the same plant"],["https://eol.org/schema/terms/rockyVegetated","Rocky outcrops with vegetation","Inselbergs or rock outcrops surrounded by vegetation"],["https://eol.org/schema/terms/sea_urchin_feeder","sea urchin feeder","a carnivore that feeds primarily on sea urchins"],["https://eol.org/schema/terms/sessile_prey_feeder","sessile prey feeder","preys on organisms that do not possess a means of self-locomotion and are normally immobile"],["https://eol.org/schema/terms/springing","springing","(Quadrupedal jumping) Progression composed of a series of leaps in which the hind legs supply the chief propulsive force, lifting the body completely from the ground and forward. The fore feet touch the ground simultaneously or in close sequence; the body rolls forward over these as in a vault; the hind feet, overstepping the fore feet, at least in greatest speed, come down next and again lift the body forward. "],["https://eol.org/schema/terms/starfish_feeder","starfish feeder","a carnivore that feeds primarily on starfishes"],["https://eol.org/schema/terms/subcarangiform","sub-carangiform","Body/caudal fin propulsion, like anguilliform, with a more marked increase in wave amplitude along the body with the vast majority of the work being done by the rear half of the fish. In general, the fish body is stiffer, making for higher speed but reduced maneuverability. Trout use sub-carangiform locomotion."],["https://eol.org/schema/terms/surficialModifier","surficial modifier","bioturbating fauna with activities restricted to the sediment layer immediately below the sediment surface"],["https://eol.org/schema/terms/thallus_length","thallus length","length of the thallus, a gametophytic lifestage that has a flat growth form"],["https://eol.org/schema/terms/threatened","threatened","may become endangered within the foreseeable future"],["https://eol.org/schema/terms/thunniform","thunniform","Body/caudal fin propulsion, characteristic of tunas, also found in several lamnid sharks. Virtually all the sideways movement is in the tail and the region connecting the main body to the tail (the peduncle). The tail itself tends to be large and crescent shaped. This form of swimming enables these fish to chase and catch prey more easily due to the increase in speed of swimming, like in barracudas."],["https://eol.org/schema/terms/tissue_contains","tissue contains","describes a component found in biotic tissue"],["https://eol.org/schema/terms/tubicolous","tubicolous","aquatic organisms that construct and inhabit simple unbranched vertical shafts with only one opening to the surface. These are primarily above-sediment filter-feeders, surface deposit-feeders, and  subsurface deposit-feeders  (head-down, conveyor-belt feeders) \r\n"],["https://eol.org/schema/terms/tuft","tuft","a small cluster of elongated flexible outgrowths attached or close together at the base and free at the opposite ends\r\nespecially : a growing bunch of grasses or close-set plants"],["https://eol.org/schema/terms/unisexual_flowers","unisexual flowers","in which either the stamens or the carpels are missing, vestigial or otherwise non-functional. Each flower is either \"staminate\" (having only functional stamens) and thus \"male\", or \"carpellate\" (or \"pistillate\") (having only functional carpels) and thus \"female\". If separate staminate and carpellate flowers are always found on the same plant, the species is called monoecious. If separate staminate and carpellate flowers are always found on different plants, the species is called dioecious."],["https://eol.org/schema/terms/weeping","weeping","pendant or pendulous; hanging downwards"],["https://www.wikidata.org/entity/Q295469","ecoregion","ecologically and geographically defined area that is smaller than a biogeographic realm"],["https://www.wikidata.org/entity/Q30715289","semi-aquatic",""],["https://www.wikidata.org/entity/Q3711325","speed","magnitude of velocity"],["https://www.wikidata.org/entity/Q4296711","mitotic index","the ratio between the number of cells in a population undergoing mitosis to the total number of cells in a population"],["https://www.wikidata.org/entity/Q57735866","mechanical defense",""]]}
